#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(dead_code)]

/* automatically generated by rust-bindgen 0.65.1 */

pub const __WORDSIZE: u32 = 64;
pub const __DARWIN_ONLY_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const __DARWIN_ONLY_VERS_1050: u32 = 1;
pub const __DARWIN_UNIX03: u32 = 1;
pub const __DARWIN_64_BIT_INO_T: u32 = 1;
pub const __DARWIN_VERS_1050: u32 = 1;
pub const __DARWIN_NON_CANCELABLE: u32 = 0;
pub const __DARWIN_SUF_EXTSN: &[u8; 14usize] = b"$DARWIN_EXTSN\0";
pub const __DARWIN_C_ANSI: u32 = 4096;
pub const __DARWIN_C_FULL: u32 = 900000;
pub const __DARWIN_C_LEVEL: u32 = 900000;
pub const __STDC_WANT_LIB_EXT1__: u32 = 1;
pub const __DARWIN_NO_LONG_LONG: u32 = 0;
pub const _DARWIN_FEATURE_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_64_BIT_INODE: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_VERS_1050: u32 = 1;
pub const _DARWIN_FEATURE_ONLY_UNIX_CONFORMANCE: u32 = 1;
pub const _DARWIN_FEATURE_UNIX_CONFORMANCE: u32 = 3;
pub const __has_ptrcheck: u32 = 0;
pub const __PTHREAD_SIZE__: u32 = 8176;
pub const __PTHREAD_ATTR_SIZE__: u32 = 56;
pub const __PTHREAD_MUTEXATTR_SIZE__: u32 = 8;
pub const __PTHREAD_MUTEX_SIZE__: u32 = 56;
pub const __PTHREAD_CONDATTR_SIZE__: u32 = 8;
pub const __PTHREAD_COND_SIZE__: u32 = 40;
pub const __PTHREAD_ONCE_SIZE__: u32 = 8;
pub const __PTHREAD_RWLOCK_SIZE__: u32 = 192;
pub const __PTHREAD_RWLOCKATTR_SIZE__: u32 = 16;

pub const MAC_OS_X_VERSION_10_8: u32 = 1080;
pub const MAC_OS_X_VERSION_10_9: u32 = 1090;
pub const MAC_OS_X_VERSION_10_10: u32 = 101000;
pub const MAC_OS_X_VERSION_10_10_2: u32 = 101002;
pub const MAC_OS_X_VERSION_10_10_3: u32 = 101003;
pub const MAC_OS_X_VERSION_10_11: u32 = 101100;
pub const MAC_OS_X_VERSION_10_11_2: u32 = 101102;
pub const MAC_OS_X_VERSION_10_11_3: u32 = 101103;
pub const MAC_OS_X_VERSION_10_11_4: u32 = 101104;
pub const MAC_OS_X_VERSION_10_12: u32 = 101200;
pub const MAC_OS_X_VERSION_10_12_1: u32 = 101201;
pub const MAC_OS_X_VERSION_10_12_2: u32 = 101202;
pub const MAC_OS_X_VERSION_10_12_4: u32 = 101204;
pub const MAC_OS_X_VERSION_10_13: u32 = 101300;
pub const MAC_OS_X_VERSION_10_13_1: u32 = 101301;
pub const MAC_OS_X_VERSION_10_13_2: u32 = 101302;
pub const MAC_OS_X_VERSION_10_13_4: u32 = 101304;
pub const MAC_OS_X_VERSION_10_14: u32 = 101400;
pub const MAC_OS_X_VERSION_10_14_1: u32 = 101401;
pub const MAC_OS_X_VERSION_10_14_4: u32 = 101404;
pub const MAC_OS_X_VERSION_10_14_6: u32 = 101406;
pub const MAC_OS_X_VERSION_10_15: u32 = 101500;
pub const MAC_OS_X_VERSION_10_15_1: u32 = 101501;
pub const MAC_OS_X_VERSION_10_16: u32 = 101600;
pub const MAC_OS_VERSION_11_0: u32 = 110000;
pub const MAC_OS_VERSION_12_0: u32 = 120000;
pub const MAC_OS_VERSION_13_0: u32 = 130000;
pub const __DRIVERKIT_19_0: u32 = 190000;
pub const __DRIVERKIT_20_0: u32 = 200000;
pub const __DRIVERKIT_21_0: u32 = 210000;
pub const __MAC_OS_X_VERSION_MAX_ALLOWED: u32 = 130300;
pub const __ENABLE_LEGACY_MAC_AVAILABILITY: u32 = 1;
pub const TIME_UTC: u32 = 1;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast8_t = i8;
pub type int_fast16_t = i16;
pub type int_fast32_t = i32;
pub type int_fast64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast16_t = u16;
pub type uint_fast32_t = u32;
pub type uint_fast64_t = u64;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __darwin_intptr_t = ::std::os::raw::c_long;
pub type __darwin_natural_t = ::std::os::raw::c_uint;
pub type __darwin_ct_rune_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t {
    pub __mbstate8: [::std::os::raw::c_char; 128usize],
    pub _mbstateL: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        128usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mbstate8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__mbstate8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mbstateL) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(_mbstateL)
        )
    );
}
pub type __darwin_mbstate_t = __mbstate_t;
pub type __darwin_ptrdiff_t = ::std::os::raw::c_long;
pub type __darwin_size_t = ::std::os::raw::c_ulong;
pub type __darwin_va_list = __builtin_va_list;
pub type __darwin_wchar_t = ::std::os::raw::c_int;
pub type __darwin_rune_t = __darwin_wchar_t;
pub type __darwin_wint_t = ::std::os::raw::c_int;
pub type __darwin_clock_t = ::std::os::raw::c_ulong;
pub type __darwin_socklen_t = __uint32_t;
pub type __darwin_ssize_t = ::std::os::raw::c_long;
pub type __darwin_time_t = ::std::os::raw::c_long;
pub type __darwin_blkcnt_t = __int64_t;
pub type __darwin_blksize_t = __int32_t;
pub type __darwin_dev_t = __int32_t;
pub type __darwin_fsblkcnt_t = ::std::os::raw::c_uint;
pub type __darwin_fsfilcnt_t = ::std::os::raw::c_uint;
pub type __darwin_gid_t = __uint32_t;
pub type __darwin_id_t = __uint32_t;
pub type __darwin_ino64_t = __uint64_t;
pub type __darwin_ino_t = __darwin_ino64_t;
pub type __darwin_mach_port_name_t = __darwin_natural_t;
pub type __darwin_mach_port_t = __darwin_mach_port_name_t;
pub type __darwin_mode_t = __uint16_t;
pub type __darwin_off_t = __int64_t;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_sigset_t = __uint32_t;
pub type __darwin_suseconds_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type __darwin_useconds_t = __uint32_t;
pub type __darwin_uuid_t = [::std::os::raw::c_uchar; 16usize];
pub type __darwin_uuid_string_t = [::std::os::raw::c_char; 37usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __darwin_pthread_handler_rec {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __next: *mut __darwin_pthread_handler_rec,
}
#[test]
fn bindgen_test_layout___darwin_pthread_handler_rec() {
    const UNINIT: ::std::mem::MaybeUninit<__darwin_pthread_handler_rec> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__darwin_pthread_handler_rec>(),
        24usize,
        concat!("Size of: ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        ::std::mem::align_of::<__darwin_pthread_handler_rec>(),
        8usize,
        concat!("Alignment of ", stringify!(__darwin_pthread_handler_rec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__routine) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__routine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__arg) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__arg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__darwin_pthread_handler_rec),
            "::",
            stringify!(__next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_attr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_attr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_attr_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_attr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_cond_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_cond_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_cond_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_condattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_condattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_condattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_condattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_condattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutex_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 56usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutex_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutex_t>(),
        64usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutex_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_mutexattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_mutexattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_mutexattr_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_mutexattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_mutexattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_once_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_once_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_once_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_once_t>(),
        16usize,
        concat!("Size of: ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_once_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_once_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_once_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlock_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 192usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlock_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlock_t>(),
        200usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlock_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_rwlockattr_t {
    pub __sig: ::std::os::raw::c_long,
    pub __opaque: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_rwlockattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_rwlockattr_t>(),
        24usize,
        concat!("Size of: ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_rwlockattr_t),
            "::",
            stringify!(__opaque)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _opaque_pthread_t {
    pub __sig: ::std::os::raw::c_long,
    pub __cleanup_stack: *mut __darwin_pthread_handler_rec,
    pub __opaque: [::std::os::raw::c_char; 8176usize],
}
#[test]
fn bindgen_test_layout__opaque_pthread_t() {
    const UNINIT: ::std::mem::MaybeUninit<_opaque_pthread_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_opaque_pthread_t>(),
        8192usize,
        concat!("Size of: ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_opaque_pthread_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_opaque_pthread_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__sig) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__sig)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cleanup_stack) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__cleanup_stack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_opaque_pthread_t),
            "::",
            stringify!(__opaque)
        )
    );
}
pub type __darwin_pthread_attr_t = _opaque_pthread_attr_t;
pub type __darwin_pthread_cond_t = _opaque_pthread_cond_t;
pub type __darwin_pthread_condattr_t = _opaque_pthread_condattr_t;
pub type __darwin_pthread_key_t = ::std::os::raw::c_ulong;
pub type __darwin_pthread_mutex_t = _opaque_pthread_mutex_t;
pub type __darwin_pthread_mutexattr_t = _opaque_pthread_mutexattr_t;
pub type __darwin_pthread_once_t = _opaque_pthread_once_t;
pub type __darwin_pthread_rwlock_t = _opaque_pthread_rwlock_t;
pub type __darwin_pthread_rwlockattr_t = _opaque_pthread_rwlockattr_t;
pub type __darwin_pthread_t = *mut _opaque_pthread_t;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = i64;
pub type user_addr_t = u_int64_t;
pub type user_size_t = u_int64_t;
pub type user_ssize_t = i64;
pub type user_long_t = i64;
pub type user_ulong_t = u_int64_t;
pub type user_time_t = i64;
pub type user_off_t = i64;
pub type syscall_arg_t = u_int64_t;
pub type intmax_t = ::std::os::raw::c_long;
pub type uintmax_t = ::std::os::raw::c_ulong;
pub type rsize_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
pub type max_align_t = f64;
pub type char16_t = uint_least16_t;
#[doc = "\n CEF string type definitions. Whomever allocates |str| is responsible for\n providing an appropriate |dtor| implementation that will free the string in\n the same memory space. When reusing an existing string structure make sure\n to call |dtor| for the old value before assigning new |str| and |dtor|\n values. Static strings will have a NULL |dtor| value. Using the below\n functions if you want this managed for you.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_wide_t {
    pub str_: *mut wchar_t,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut wchar_t)>,
}
#[test]
fn bindgen_test_layout__cef_string_wide_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_string_wide_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_string_wide_t>(),
        24usize,
        concat!("Size of: ", stringify!(_cef_string_wide_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_string_wide_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_string_wide_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).str_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_wide_t),
            "::",
            stringify!(str_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_wide_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dtor) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_wide_t),
            "::",
            stringify!(dtor)
        )
    );
}
#[doc = "\n CEF string type definitions. Whomever allocates |str| is responsible for\n providing an appropriate |dtor| implementation that will free the string in\n the same memory space. When reusing an existing string structure make sure\n to call |dtor| for the old value before assigning new |str| and |dtor|\n values. Static strings will have a NULL |dtor| value. Using the below\n functions if you want this managed for you.\n"]
pub type cef_string_wide_t = _cef_string_wide_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_utf8_t {
    pub str_: *mut ::std::os::raw::c_char,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut ::std::os::raw::c_char)>,
}
#[test]
fn bindgen_test_layout__cef_string_utf8_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_string_utf8_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_string_utf8_t>(),
        24usize,
        concat!("Size of: ", stringify!(_cef_string_utf8_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_string_utf8_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_string_utf8_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).str_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf8_t),
            "::",
            stringify!(str_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf8_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dtor) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf8_t),
            "::",
            stringify!(dtor)
        )
    );
}
pub type cef_string_utf8_t = _cef_string_utf8_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_utf16_t {
    pub str_: *mut char16_t,
    pub length: usize,
    pub dtor: ::std::option::Option<unsafe extern "C" fn(str_: *mut char16_t)>,
}
#[test]
fn bindgen_test_layout__cef_string_utf16_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_string_utf16_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_string_utf16_t>(),
        24usize,
        concat!("Size of: ", stringify!(_cef_string_utf16_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_string_utf16_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_string_utf16_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).str_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf16_t),
            "::",
            stringify!(str_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf16_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dtor) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_string_utf16_t),
            "::",
            stringify!(dtor)
        )
    );
}
pub type cef_string_utf16_t = _cef_string_utf16_t;
extern "C" {
    #[doc = "\n These functions set string values. If |copy| is true (1) the value will be\n copied instead of referenced. It is up to the user to properly manage\n the lifespan of references.\n"]
    pub fn cef_string_wide_set(
        src: *const wchar_t,
        src_len: usize,
        output: *mut cef_string_wide_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf8_set(
        src: *const ::std::os::raw::c_char,
        src_len: usize,
        output: *mut cef_string_utf8_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf16_set(
        src: *const char16_t,
        src_len: usize,
        output: *mut cef_string_utf16_t,
        copy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n These functions clear string values. The structure itself is not freed.\n"]
    pub fn cef_string_wide_clear(str_: *mut cef_string_wide_t);
}
extern "C" {
    pub fn cef_string_utf8_clear(str_: *mut cef_string_utf8_t);
}
extern "C" {
    pub fn cef_string_utf16_clear(str_: *mut cef_string_utf16_t);
}
extern "C" {
    #[doc = "\n These functions compare two string values with the same results as strcmp().\n"]
    pub fn cef_string_wide_cmp(
        str1: *const cef_string_wide_t,
        str2: *const cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf8_cmp(
        str1: *const cef_string_utf8_t,
        str2: *const cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf16_cmp(
        str1: *const cef_string_utf16_t,
        str2: *const cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n These functions convert between UTF-8, -16, and -32 strings. They are\n potentially slow so unnecessary conversions should be avoided. The best\n possible result will always be written to |output| with the boolean return\n value indicating whether the conversion is 100% valid.\n"]
    pub fn cef_string_wide_to_utf8(
        src: *const wchar_t,
        src_len: usize,
        output: *mut cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf8_to_wide(
        src: *const ::std::os::raw::c_char,
        src_len: usize,
        output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_wide_to_utf16(
        src: *const wchar_t,
        src_len: usize,
        output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf16_to_wide(
        src: *const char16_t,
        src_len: usize,
        output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf8_to_utf16(
        src: *const ::std::os::raw::c_char,
        src_len: usize,
        output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf16_to_utf8(
        src: *const char16_t,
        src_len: usize,
        output: *mut cef_string_utf8_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n These functions convert an ASCII string, typically a hardcoded constant, to\n a Wide/UTF16 string. Use instead of the UTF8 conversion routines if you know\n the string is ASCII.\n"]
    pub fn cef_string_ascii_to_wide(
        src: *const ::std::os::raw::c_char,
        src_len: usize,
        output: *mut cef_string_wide_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_ascii_to_utf16(
        src: *const ::std::os::raw::c_char,
        src_len: usize,
        output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
#[doc = "\n It is sometimes necessary for the system to allocate string structures with\n the expectation that the user will free them. The userfree types act as a\n hint that the user is responsible for freeing the structure.\n"]
pub type cef_string_userfree_wide_t = *mut cef_string_wide_t;
pub type cef_string_userfree_utf8_t = *mut cef_string_utf8_t;
pub type cef_string_userfree_utf16_t = *mut cef_string_utf16_t;
extern "C" {
    #[doc = "\n These functions allocate a new string structure. They must be freed by\n calling the associated free function.\n"]
    pub fn cef_string_userfree_wide_alloc() -> cef_string_userfree_wide_t;
}
extern "C" {
    pub fn cef_string_userfree_utf8_alloc() -> cef_string_userfree_utf8_t;
}
extern "C" {
    pub fn cef_string_userfree_utf16_alloc() -> cef_string_userfree_utf16_t;
}
extern "C" {
    #[doc = "\n These functions free the string structure allocated by the associated\n alloc function. Any string contents will first be cleared.\n"]
    pub fn cef_string_userfree_wide_free(str_: cef_string_userfree_wide_t);
}
extern "C" {
    pub fn cef_string_userfree_utf8_free(str_: cef_string_userfree_utf8_t);
}
extern "C" {
    pub fn cef_string_userfree_utf16_free(str_: cef_string_userfree_utf16_t);
}
extern "C" {
    #[doc = "\n These functions convert utf16 string case using the current ICU locale. This\n may change the length of the string in some cases.\n"]
    pub fn cef_string_utf16_to_lower(
        src: *const char16_t,
        src_len: usize,
        output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_string_utf16_to_upper(
        src: *const char16_t,
        src_len: usize,
        output: *mut cef_string_utf16_t,
    ) -> ::std::os::raw::c_int;
}
pub type cef_char_t = char16_t;
pub type cef_string_userfree_t = cef_string_userfree_utf16_t;
pub type cef_string_t = cef_string_utf16_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_list_t {
    _unused: [u8; 0],
}
#[doc = "\n CEF string maps are a set of key/value string pairs.\n"]
pub type cef_string_list_t = *mut _cef_string_list_t;
extern "C" {
    #[doc = "\n Allocate a new string map.\n"]
    pub fn cef_string_list_alloc() -> cef_string_list_t;
}
extern "C" {
    #[doc = "\n Return the number of elements in the string list.\n"]
    pub fn cef_string_list_size(list: cef_string_list_t) -> usize;
}
extern "C" {
    #[doc = "\n Retrieve the value at the specified zero-based string list index. Returns\n true (1) if the value was successfully retrieved.\n"]
    pub fn cef_string_list_value(
        list: cef_string_list_t,
        index: usize,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Append a new value at the end of the string list.\n"]
    pub fn cef_string_list_append(list: cef_string_list_t, value: *const cef_string_t);
}
extern "C" {
    #[doc = "\n Clear the string list.\n"]
    pub fn cef_string_list_clear(list: cef_string_list_t);
}
extern "C" {
    #[doc = "\n Free the string list.\n"]
    pub fn cef_string_list_free(list: cef_string_list_t);
}
extern "C" {
    #[doc = "\n Creates a copy of an existing string list.\n"]
    pub fn cef_string_list_copy(list: cef_string_list_t) -> cef_string_list_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_map_t {
    _unused: [u8; 0],
}
#[doc = "\n CEF string maps are a set of key/value string pairs.\n"]
pub type cef_string_map_t = *mut _cef_string_map_t;
extern "C" {
    #[doc = "\n Allocate a new string map.\n"]
    pub fn cef_string_map_alloc() -> cef_string_map_t;
}
extern "C" {
    #[doc = "\n Return the number of elements in the string map.\n"]
    pub fn cef_string_map_size(map: cef_string_map_t) -> usize;
}
extern "C" {
    #[doc = "\n Return the value assigned to the specified key.\n"]
    pub fn cef_string_map_find(
        map: cef_string_map_t,
        key: *const cef_string_t,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Return the key at the specified zero-based string map index.\n"]
    pub fn cef_string_map_key(
        map: cef_string_map_t,
        index: usize,
        key: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Return the value at the specified zero-based string map index.\n"]
    pub fn cef_string_map_value(
        map: cef_string_map_t,
        index: usize,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Append a new key/value pair at the end of the string map. If the key exists,\n overwrite the existing value with a new value w/o changing the pair order.\n"]
    pub fn cef_string_map_append(
        map: cef_string_map_t,
        key: *const cef_string_t,
        value: *const cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Clear the string map.\n"]
    pub fn cef_string_map_clear(map: cef_string_map_t);
}
extern "C" {
    #[doc = "\n Free the string map.\n"]
    pub fn cef_string_map_free(map: cef_string_map_t);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_string_multimap_t {
    _unused: [u8; 0],
}
#[doc = "\n CEF string multimaps are a set of key/value string pairs.\n More than one value can be assigned to a single key.\n"]
pub type cef_string_multimap_t = *mut _cef_string_multimap_t;
extern "C" {
    #[doc = "\n Allocate a new string multimap.\n"]
    pub fn cef_string_multimap_alloc() -> cef_string_multimap_t;
}
extern "C" {
    #[doc = "\n Return the number of elements in the string multimap.\n"]
    pub fn cef_string_multimap_size(map: cef_string_multimap_t) -> usize;
}
extern "C" {
    #[doc = "\n Return the number of values with the specified key.\n"]
    pub fn cef_string_multimap_find_count(
        map: cef_string_multimap_t,
        key: *const cef_string_t,
    ) -> usize;
}
extern "C" {
    #[doc = "\n Return the value_index-th value with the specified key.\n"]
    pub fn cef_string_multimap_enumerate(
        map: cef_string_multimap_t,
        key: *const cef_string_t,
        value_index: usize,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Return the key at the specified zero-based string multimap index.\n"]
    pub fn cef_string_multimap_key(
        map: cef_string_multimap_t,
        index: usize,
        key: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Return the value at the specified zero-based string multimap index.\n"]
    pub fn cef_string_multimap_value(
        map: cef_string_multimap_t,
        index: usize,
        value: *mut cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Append a new key/value pair at the end of the string multimap.\n"]
    pub fn cef_string_multimap_append(
        map: cef_string_multimap_t,
        key: *const cef_string_t,
        value: *const cef_string_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Clear the string multimap.\n"]
    pub fn cef_string_multimap_clear(map: cef_string_multimap_t);
}
extern "C" {
    #[doc = "\n Free the string multimap.\n"]
    pub fn cef_string_multimap_free(map: cef_string_multimap_t);
}
pub type __darwin_nl_item = ::std::os::raw::c_int;
pub type __darwin_wctrans_t = ::std::os::raw::c_int;
pub type __darwin_wctype_t = __uint32_t;
pub type clock_t = __darwin_clock_t;
pub type time_t = __darwin_time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __darwin_time_t,
    pub tv_nsec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static mut getdate_err: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub fn asctime(arg1: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn ctime(arg1: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn difftime(arg1: time_t, arg2: time_t) -> f64;
}
extern "C" {
    pub fn getdate(arg1: *const ::std::os::raw::c_char) -> *mut tm;
}
extern "C" {
    pub fn gmtime(arg1: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(arg1: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn mktime(arg1: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        arg1: *mut ::std::os::raw::c_char,
        arg2: usize,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn strptime(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut tm,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn time(arg1: *mut time_t) -> time_t;
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub fn asctime_r(
        arg1: *const tm,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(
        arg1: *const time_t,
        arg2: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gmtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(arg1: *const time_t, arg2: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn posix2time(arg1: time_t) -> time_t;
}
extern "C" {
    pub fn tzsetwall();
}
extern "C" {
    pub fn time2posix(arg1: time_t) -> time_t;
}
extern "C" {
    pub fn timelocal(arg1: *mut tm) -> time_t;
}
extern "C" {
    pub fn timegm(arg1: *mut tm) -> time_t;
}
extern "C" {
    pub fn nanosleep(__rqtp: *const timespec, __rmtp: *mut timespec) -> ::std::os::raw::c_int;
}
pub const clockid_t__CLOCK_REALTIME: clockid_t = 0;
pub const clockid_t__CLOCK_MONOTONIC: clockid_t = 6;
pub const clockid_t__CLOCK_MONOTONIC_RAW: clockid_t = 4;
pub const clockid_t__CLOCK_MONOTONIC_RAW_APPROX: clockid_t = 5;
pub const clockid_t__CLOCK_UPTIME_RAW: clockid_t = 8;
pub const clockid_t__CLOCK_UPTIME_RAW_APPROX: clockid_t = 9;
pub const clockid_t__CLOCK_PROCESS_CPUTIME_ID: clockid_t = 12;
pub const clockid_t__CLOCK_THREAD_CPUTIME_ID: clockid_t = 16;
pub type clockid_t = ::std::os::raw::c_uint;
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime_nsec_np(__clock_id: clockid_t) -> __uint64_t;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(ts: *mut timespec, base: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[doc = "\n Represents a wall clock time in UTC. Values are not guaranteed to be\n monotonically non-decreasing and are subject to large amounts of skew.\n Time is stored internally as microseconds since the Windows epoch (1601).\n\n This is equivalent of Chromium `base::Time` (see base/time/time.h).\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_basetime_t {
    pub val: i64,
}
#[test]
fn bindgen_test_layout__cef_basetime_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_basetime_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_basetime_t>(),
        8usize,
        concat!("Size of: ", stringify!(_cef_basetime_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_basetime_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_basetime_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_basetime_t),
            "::",
            stringify!(val)
        )
    );
}
#[doc = "\n Represents a wall clock time in UTC. Values are not guaranteed to be\n monotonically non-decreasing and are subject to large amounts of skew.\n Time is stored internally as microseconds since the Windows epoch (1601).\n\n This is equivalent of Chromium `base::Time` (see base/time/time.h).\n"]
pub type cef_basetime_t = _cef_basetime_t;
#[doc = "\n Time information. Values should always be in UTC.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_time_t {
    #[doc = "\n Four or five digit year \"2007\" (1601 to 30827 on Windows, 1970 to 2038 on\n 32-bit POSIX)\n"]
    pub year: ::std::os::raw::c_int,
    #[doc = "\n 1-based month (values 1 = January, etc.)\n"]
    pub month: ::std::os::raw::c_int,
    #[doc = "\n 0-based day of week (0 = Sunday, etc.)\n"]
    pub day_of_week: ::std::os::raw::c_int,
    #[doc = "\n 1-based day of month (1-31)\n"]
    pub day_of_month: ::std::os::raw::c_int,
    #[doc = "\n Hour within the current day (0-23)\n"]
    pub hour: ::std::os::raw::c_int,
    #[doc = "\n Minute within the current hour (0-59)\n"]
    pub minute: ::std::os::raw::c_int,
    #[doc = "\n Second within the current minute (0-59 plus leap seconds which may take\n it up to 60).\n"]
    pub second: ::std::os::raw::c_int,
    #[doc = "\n Milliseconds within the current second (0-999)\n"]
    pub millisecond: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_time_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_time_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_time_t>(),
        32usize,
        concat!("Size of: ", stringify!(_cef_time_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_time_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_time_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).year) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).month) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(month)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).day_of_week) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(day_of_week)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).day_of_month) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(day_of_month)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hour) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minute) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(minute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).second) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(second)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).millisecond) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_time_t),
            "::",
            stringify!(millisecond)
        )
    );
}
#[doc = "\n Time information. Values should always be in UTC.\n"]
pub type cef_time_t = _cef_time_t;
extern "C" {
    #[doc = "\n Converts cef_time_t to/from time_t. Returns true (1) on success and false\n (0) on failure.\n"]
    pub fn cef_time_to_timet(
        cef_time: *const cef_time_t,
        time: *mut time_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_time_from_timet(time: time_t, cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Converts cef_time_t to/from a double which is the number of seconds since\n epoch (Jan 1, 1970). Webkit uses this format to represent time. A value of 0\n means \"not initialized\". Returns true (1) on success and false (0) on\n failure.\n"]
    pub fn cef_time_to_doublet(
        cef_time: *const cef_time_t,
        time: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn cef_time_from_doublet(time: f64, cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Retrieve the current system time. Returns true (1) on success and false (0)\n on failure.\n"]
    pub fn cef_time_now(cef_time: *mut cef_time_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Retrieve the current system time.\n"]
    pub fn cef_basetime_now() -> cef_basetime_t;
}
extern "C" {
    #[doc = "\n Retrieve the delta in milliseconds between two time values. Returns true (1)\n on success and false (0) on failure."]
    pub fn cef_time_delta(
        cef_time1: *const cef_time_t,
        cef_time2: *const cef_time_t,
        delta: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Converts cef_time_t to cef_basetime_t. Returns true (1) on success and\n false (0) on failure.\n"]
    pub fn cef_time_to_basetime(
        from: *const cef_time_t,
        to: *mut cef_basetime_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = "\n Converts cef_basetime_t to cef_time_t. Returns true (1) on success and\n false (0) on failure.\n"]
    pub fn cef_time_from_basetime(
        from: cef_basetime_t,
        to: *mut cef_time_t,
    ) -> ::std::os::raw::c_int;
}
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_COOKIES:
    cef_content_setting_types_t = 0;
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_IMAGES: cef_content_setting_types_t =
    1;
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_JAVASCRIPT:
    cef_content_setting_types_t = 2;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_POPUPS: cef_content_setting_types_t =
    3;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_GEOLOCATION:
    cef_content_setting_types_t = 4;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_NOTIFICATIONS:
    cef_content_setting_types_t = 5;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_AUTO_SELECT_CERTIFICATE:
    cef_content_setting_types_t = 6;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_MIXEDSCRIPT:
    cef_content_setting_types_t = 7;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_MEDIASTREAM_MIC:
    cef_content_setting_types_t = 8;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_MEDIASTREAM_CAMERA:
    cef_content_setting_types_t = 9;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_PROTOCOL_HANDLERS:
    cef_content_setting_types_t = 10;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_DEPRECATED_PPAPI_BROKER:
    cef_content_setting_types_t = 11;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_AUTOMATIC_DOWNLOADS:
    cef_content_setting_types_t = 12;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_MIDI_SYSEX:
    cef_content_setting_types_t = 13;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_SSL_CERT_DECISIONS:
    cef_content_setting_types_t = 14;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_PROTECTED_MEDIA_IDENTIFIER:
    cef_content_setting_types_t = 15;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_APP_BANNER:
    cef_content_setting_types_t = 16;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_SITE_ENGAGEMENT:
    cef_content_setting_types_t = 17;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_DURABLE_STORAGE:
    cef_content_setting_types_t = 18;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_USB_CHOOSER_DATA:
    cef_content_setting_types_t = 19;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_BLUETOOTH_GUARD:
    cef_content_setting_types_t = 20;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_BACKGROUND_SYNC:
    cef_content_setting_types_t = 21;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_AUTOPLAY:
    cef_content_setting_types_t = 22;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_IMPORTANT_SITE_INFO:
    cef_content_setting_types_t = 23;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_PERMISSION_AUTOBLOCKER_DATA:
    cef_content_setting_types_t = 24;
#[doc = " This setting governs both popups and unwanted redirects like tab-unders\n and framebusting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_ADS: cef_content_setting_types_t =
    25;
#[doc = " Website setting which stores metadata for the subresource filter to aid in\n decisions for whether or not to show the UI."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_ADS_DATA:
    cef_content_setting_types_t = 26;
#[doc = " This is special-cased in the permissions layer to always allow, and as\n such doesn't have associated prefs data."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_MIDI: cef_content_setting_types_t =
    27;
#[doc = " This content setting type is for caching password protection service's\n verdicts of each origin."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_PASSWORD_PROTECTION:
    cef_content_setting_types_t = 28;
#[doc = " Website setting which stores engagement data for media related to a\n specific origin."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_MEDIA_ENGAGEMENT:
    cef_content_setting_types_t = 29;
#[doc = " Content setting which stores whether or not the site can play audible\n sound. This will not block playback but instead the user will not hear it."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_SOUND: cef_content_setting_types_t =
    30;
#[doc = " Website setting which stores the list of client hints that the origin\n requested the browser to remember. The browser is expected to send all\n client hints in the HTTP request headers for every resource requested\n from that origin."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_CLIENT_HINTS:
    cef_content_setting_types_t = 31;
#[doc = " Generic Sensor API covering ambient-light-sensor, accelerometer, gyroscope\n and magnetometer are all mapped to a single content_settings_type.\n Setting for the Generic Sensor API covering ambient-light-sensor,\n accelerometer, gyroscope and magnetometer. These are all mapped to a\n single ContentSettingsType."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_SENSORS:
    cef_content_setting_types_t = 32;
#[doc = " Content setting which stores whether or not the user has granted the site\n permission to respond to accessibility events, which can be used to\n provide a custom accessibility experience. Requires explicit user consent\n because some users may not want sites to know they're using assistive\n technology."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_ACCESSIBILITY_EVENTS:
    cef_content_setting_types_t = 33;
#[doc = " Used to store whether to allow a website to install a payment handler."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_PAYMENT_HANDLER:
    cef_content_setting_types_t = 34;
#[doc = " Content setting which stores whether to allow sites to ask for permission\n to access USB devices. If this is allowed specific device permissions are\n stored under USB_CHOOSER_DATA."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_USB_GUARD:
    cef_content_setting_types_t = 35;
#[doc = " Nothing is stored in this setting at present. Please refer to\n BackgroundFetchPermissionContext for details on how this permission\n is ascertained."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_BACKGROUND_FETCH:
    cef_content_setting_types_t = 36;
#[doc = " Website setting which stores the amount of times the user has dismissed\n intent picker UI without explicitly choosing an option."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_INTENT_PICKER_DISPLAY:
    cef_content_setting_types_t = 37;
#[doc = " Used to store whether to allow a website to detect user active/idle state."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_IDLE_DETECTION:
    cef_content_setting_types_t = 38;
#[doc = " Setting for enabling auto-select of all screens for getDisplayMediaSet."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_GET_DISPLAY_MEDIA_SET_SELECT_ALL_SCREENS : cef_content_setting_types_t = 39 ;
#[doc = " Content settings for access to serial ports. The \"guard\" content setting\n stores whether to allow sites to ask for permission to access a port. The\n permissions granted to access particular ports are stored in the \"chooser\n data\" website setting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_SERIAL_GUARD:
    cef_content_setting_types_t = 40;
#[doc = " Content settings for access to serial ports. The \"guard\" content setting\n stores whether to allow sites to ask for permission to access a port. The\n permissions granted to access particular ports are stored in the \"chooser\n data\" website setting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_SERIAL_CHOOSER_DATA:
    cef_content_setting_types_t = 41;
#[doc = " Nothing is stored in this setting at present. Please refer to\n PeriodicBackgroundSyncPermissionContext for details on how this permission\n is ascertained.\n This content setting is not registered because it does not require access\n to any existing providers."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_PERIODIC_BACKGROUND_SYNC:
    cef_content_setting_types_t = 42;
#[doc = " Content setting which stores whether to allow sites to ask for permission\n to do Bluetooth scanning."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_BLUETOOTH_SCANNING:
    cef_content_setting_types_t = 43;
#[doc = " Content settings for access to HID devices. The \"guard\" content setting\n stores whether to allow sites to ask for permission to access a device.\n The permissions granted to access particular devices are stored in the\n \"chooser data\" website setting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_HID_GUARD:
    cef_content_setting_types_t = 44;
#[doc = " Content settings for access to HID devices. The \"guard\" content setting\n stores whether to allow sites to ask for permission to access a device.\n The permissions granted to access particular devices are stored in the\n \"chooser data\" website setting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_HID_CHOOSER_DATA:
    cef_content_setting_types_t = 45;
#[doc = " Wake Lock API, which has two lock types: screen and system locks.\n Currently, screen locks do not need any additional permission, and system\n locks are always denied while the right UI is worked out."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_WAKE_LOCK_SCREEN:
    cef_content_setting_types_t = 46;
#[doc = " Wake Lock API, which has two lock types: screen and system locks.\n Currently, screen locks do not need any additional permission, and system\n locks are always denied while the right UI is worked out."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_WAKE_LOCK_SYSTEM:
    cef_content_setting_types_t = 47;
#[doc = " Legacy SameSite cookie behavior. This disables SameSite=Lax-by-default,\n SameSite=None requires Secure, and Schemeful Same-Site, forcing the\n legacy behavior wherein 1) cookies that don't specify SameSite are treated\n as SameSite=None, 2) SameSite=None cookies are not required to be Secure,\n and 3) schemeful same-site is not active.\n\n This will also be used to revert to legacy behavior when future changes\n in cookie handling are introduced."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_LEGACY_COOKIE_ACCESS:
    cef_content_setting_types_t = 48;
#[doc = " Content settings which stores whether to allow sites to ask for permission\n to save changes to an original file selected by the user through the\n File System Access API."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_WRITE_GUARD:
    cef_content_setting_types_t = 49;
#[doc = " Used to store whether to allow a website to exchange data with NFC\n devices."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_NFC: cef_content_setting_types_t =
    50;
#[doc = " Website setting to store permissions granted to access particular\n Bluetooth devices."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_BLUETOOTH_CHOOSER_DATA:
    cef_content_setting_types_t = 51;
#[doc = " Full access to the system clipboard (sanitized read without user gesture,\n and unsanitized read and write with user gesture)."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_CLIPBOARD_READ_WRITE:
    cef_content_setting_types_t = 52;
#[doc = " This is special-cased in the permissions layer to always allow, and as\n such doesn't have associated prefs data."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_CLIPBOARD_SANITIZED_WRITE:
    cef_content_setting_types_t = 53;
#[doc = " This content setting type is for caching safe browsing real time url\n check's verdicts of each origin."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_SAFE_BROWSING_URL_CHECK_DATA:
    cef_content_setting_types_t = 54;
#[doc = " Used to store whether a site is allowed to request AR or VR sessions with\n the WebXr Device API."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_VR: cef_content_setting_types_t = 55;
#[doc = " Used to store whether a site is allowed to request AR or VR sessions with\n the WebXr Device API."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_AR: cef_content_setting_types_t = 56;
#[doc = " Content setting which stores whether to allow site to open and read files\n and directories selected through the File System Access API."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_READ_GUARD:
    cef_content_setting_types_t = 57;
#[doc = " Access to first party storage in a third-party context. Exceptions are\n scoped to the combination of requesting/top-level origin, and are managed\n through the Storage Access API. For the time being, this content setting\n exists in parallel to third-party cookie rules stored in COOKIES."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_STORAGE_ACCESS:
    cef_content_setting_types_t = 58;
#[doc = " Content setting which stores whether to allow a site to control camera\n movements. It does not give access to camera."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_CAMERA_PAN_TILT_ZOOM:
    cef_content_setting_types_t = 59;
#[doc = " Content setting for Screen Enumeration and Screen Detail functionality.\n Permits access to detailed multi-screen information, like size and\n position. Permits placing fullscreen and windowed content on specific\n screens. See also: https://w3c.github.io/window-placement"]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_WINDOW_MANAGEMENT:
    cef_content_setting_types_t = 60;
#[doc = " Stores whether to allow insecure websites to make local network requests.\n See also: https://wicg.github.io/local-network-access\n Set through enterprise policies only."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_INSECURE_LOCAL_NETWORK:
    cef_content_setting_types_t = 61;
#[doc = " Content setting which stores whether or not a site can access low-level\n locally installed font data using the Local Fonts Access API."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_LOCAL_FONTS:
    cef_content_setting_types_t = 62;
#[doc = " Stores per-origin state for permission auto-revocation (for all permission\n types)."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_PERMISSION_AUTOREVOCATION_DATA:
    cef_content_setting_types_t = 63;
#[doc = " Stores per-origin state of the most recently selected directory for the\n use by the File System Access API."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_LAST_PICKED_DIRECTORY:
    cef_content_setting_types_t = 64;
#[doc = " Controls access to the getDisplayMedia API when {preferCurrentTab: true}\n is specified."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_DISPLAY_CAPTURE:
    cef_content_setting_types_t = 65;
#[doc = " Website setting to store permissions metadata granted to paths on the\n local file system via the File System Access API.\n |FILE_SYSTEM_WRITE_GUARD| is the corresponding \"guard\" setting."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_FILE_SYSTEM_ACCESS_CHOOSER_DATA:
    cef_content_setting_types_t = 66;
#[doc = " Stores a grant that allows a relying party to send a request for identity\n information to specified identity providers, potentially through any\n anti-tracking measures that would otherwise prevent it. This setting is\n associated with the relying party's origin."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_SHARING:
    cef_content_setting_types_t = 67;
#[doc = " Whether to use the v8 optimized JIT for running JavaScript on the page."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_JAVASCRIPT_JIT:
    cef_content_setting_types_t = 68;
#[doc = " Content setting which stores user decisions to allow loading a site over\n HTTP. Entries are added by hostname when a user bypasses the HTTPS-First\n Mode interstitial warning when a site does not support HTTPS. Allowed\n hosts are exact hostname matches -- subdomains of a host on the allowlist\n must be separately allowlisted."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_HTTP_ALLOWED:
    cef_content_setting_types_t = 69;
#[doc = " Stores metadata related to form fill, such as e.g. whether user data was\n autofilled on a specific website."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_FORMFILL_METADATA:
    cef_content_setting_types_t = 70;
#[doc = " Setting to indicate that there is an active federated sign-in session\n between a specified relying party and a specified identity provider for\n a specified account. When this is present it allows access to session\n management capabilities between the sites. This setting is associated\n with the relying party's origin."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_ACTIVE_SESSION:
    cef_content_setting_types_t = 71;
#[doc = " Setting to indicate whether Chrome should automatically apply darkening to\n web content."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_AUTO_DARK_WEB_CONTENT:
    cef_content_setting_types_t = 72;
#[doc = " Setting to indicate whether Chrome should request the desktop view of a\n site instead of the mobile one."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_REQUEST_DESKTOP_SITE:
    cef_content_setting_types_t = 73;
#[doc = " Setting to indicate whether browser should allow signing into a website\n via the browser FedCM API."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_API:
    cef_content_setting_types_t = 74;
#[doc = " Stores notification interactions per origin for the past 90 days.\n Interactions per origin are pre-aggregated over seven-day windows: A\n notification interaction or display is assigned to the last Monday\n midnight in local time."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_NOTIFICATION_INTERACTIONS:
    cef_content_setting_types_t = 75;
#[doc = " Website setting which stores the last reduced accept language negotiated\n for a given origin, to be used on future visits to the origin."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_REDUCED_ACCEPT_LANGUAGE:
    cef_content_setting_types_t = 76;
#[doc = " Website setting which is used for NotificationPermissionReviewService to\n store origin blocklist from review notification permissions feature."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_NOTIFICATION_PERMISSION_REVIEW:
    cef_content_setting_types_t = 77;
#[doc = " Website setting to store permissions granted to access particular devices\n in private network."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_PRIVATE_NETWORK_GUARD:
    cef_content_setting_types_t = 78;
#[doc = " Website setting to store permissions granted to access particular devices\n in private network."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_PRIVATE_NETWORK_CHOOSER_DATA:
    cef_content_setting_types_t = 79;
#[doc = " Website setting which stores whether the browser has observed the user\n signing into an identity-provider based on observing the IdP-SignIn-Status\n HTTP header."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_IDENTITY_PROVIDER_SIGNIN_STATUS : cef_content_setting_types_t = 80 ;
#[doc = " Website setting which is used for UnusedSitePermissionsService to\n store revoked permissions of unused sites from unused site permissions\n feature."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_REVOKED_UNUSED_SITE_PERMISSIONS:
    cef_content_setting_types_t = 81;
#[doc = " Similar to STORAGE_ACCESS, but applicable at the page-level rather than\n being specific to a frame."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_TOP_LEVEL_STORAGE_ACCESS:
    cef_content_setting_types_t = 82;
#[doc = " Setting to indicate whether user has opted in to allowing auto re-authn\n via the FedCM API."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_AUTO_REAUTHN_PERMISSION : cef_content_setting_types_t = 83 ;
#[doc = " Website setting which stores whether the user has explicitly registered\n a website as an identity-provider."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_FEDERATED_IDENTITY_IDENTITY_PROVIDER_REGISTRATION : cef_content_setting_types_t = 84 ;
#[doc = " Content setting which is used to indicate whether anti-abuse functionality\n should be enabled."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_ANTI_ABUSE:
    cef_content_setting_types_t = 85;
#[doc = " Content setting used to indicate whether third-party storage partitioning\n should be enabled."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_THIRD_PARTY_STORAGE_PARTITIONING:
    cef_content_setting_types_t = 86;
#[doc = " Used to indicate whether HTTPS-First Mode is enabled on the hostname."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_HTTPS_ENFORCED:
    cef_content_setting_types_t = 87;
#[doc = " Used to indicate whether HTTPS-First Mode is enabled on the hostname."]
pub const cef_content_setting_types_t_CEF_CONTENT_SETTING_TYPE_NUM_TYPES:
    cef_content_setting_types_t = 88;
#[doc = "\n Supported content setting types. Some types are platform-specific or only\n supported with the Chrome runtime. Should be kept in sync with Chromium's\n ContentSettingsType type.\n"]
pub type cef_content_setting_types_t = ::std::os::raw::c_uint;
pub const cef_content_setting_values_t_CEF_CONTENT_SETTING_VALUE_DEFAULT:
    cef_content_setting_values_t = 0;
pub const cef_content_setting_values_t_CEF_CONTENT_SETTING_VALUE_ALLOW:
    cef_content_setting_values_t = 1;
pub const cef_content_setting_values_t_CEF_CONTENT_SETTING_VALUE_BLOCK:
    cef_content_setting_values_t = 2;
pub const cef_content_setting_values_t_CEF_CONTENT_SETTING_VALUE_ASK: cef_content_setting_values_t =
    3;
pub const cef_content_setting_values_t_CEF_CONTENT_SETTING_VALUE_SESSION_ONLY:
    cef_content_setting_values_t = 4;
pub const cef_content_setting_values_t_CEF_CONTENT_SETTING_VALUE_DETECT_IMPORTANT_CONTENT:
    cef_content_setting_values_t = 5;
pub const cef_content_setting_values_t_CEF_CONTENT_SETTING_VALUE_NUM_VALUES:
    cef_content_setting_values_t = 6;
#[doc = "\n Supported content setting values. Should be kept in sync with Chromium's\n ContentSetting type.\n"]
pub type cef_content_setting_values_t = ::std::os::raw::c_uint;
#[doc = "\n Structure representing a point.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_point_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_point_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_point_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_point_t>(),
        8usize,
        concat!("Size of: ", stringify!(_cef_point_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_point_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_point_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_point_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_point_t),
            "::",
            stringify!(y)
        )
    );
}
#[doc = "\n Structure representing a point.\n"]
pub type cef_point_t = _cef_point_t;
#[doc = "\n Structure representing a rectangle.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_rect_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_rect_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_rect_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_rect_t>(),
        16usize,
        concat!("Size of: ", stringify!(_cef_rect_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_rect_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_rect_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_rect_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_rect_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_rect_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_rect_t),
            "::",
            stringify!(height)
        )
    );
}
#[doc = "\n Structure representing a rectangle.\n"]
pub type cef_rect_t = _cef_rect_t;
#[doc = "\n Structure representing a size.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_size_t {
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_size_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_size_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_size_t>(),
        8usize,
        concat!("Size of: ", stringify!(_cef_size_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_size_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_size_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_size_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_size_t),
            "::",
            stringify!(height)
        )
    );
}
#[doc = "\n Structure representing a size.\n"]
pub type cef_size_t = _cef_size_t;
#[doc = "\n Structure representing insets.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_insets_t {
    pub top: ::std::os::raw::c_int,
    pub left: ::std::os::raw::c_int,
    pub bottom: ::std::os::raw::c_int,
    pub right: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_insets_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_insets_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_insets_t>(),
        16usize,
        concat!("Size of: ", stringify!(_cef_insets_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_insets_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_insets_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).top) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_insets_t),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_insets_t),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bottom) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_insets_t),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).right) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_insets_t),
            "::",
            stringify!(right)
        )
    );
}
#[doc = "\n Structure representing insets.\n"]
pub type cef_insets_t = _cef_insets_t;
#[doc = "\n Structure representing CefExecuteProcess arguments.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_main_args_t {
    pub argc: ::std::os::raw::c_int,
    pub argv: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout__cef_main_args_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_main_args_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_main_args_t>(),
        16usize,
        concat!("Size of: ", stringify!(_cef_main_args_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_main_args_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_main_args_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_main_args_t),
            "::",
            stringify!(argc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).argv) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_main_args_t),
            "::",
            stringify!(argv)
        )
    );
}
#[doc = "\n Structure representing CefExecuteProcess arguments.\n"]
pub type cef_main_args_t = _cef_main_args_t;
#[doc = "\n Class representing window information.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_window_info_t {
    pub window_name: cef_string_t,
    #[doc = "\n Initial window bounds.\n"]
    pub bounds: cef_rect_t,
    #[doc = "\n Set to true (1) to create the view initially hidden.\n"]
    pub hidden: ::std::os::raw::c_int,
    #[doc = "\n NSView pointer for the parent view.\n"]
    pub parent_view: *mut ::std::os::raw::c_void,
    #[doc = "\n Set to true (1) to create the browser using windowless (off-screen)\n rendering. No view will be created for the browser and all rendering will\n occur via the CefRenderHandler interface. The |parent_view| value will be\n used to identify monitor info and to act as the parent view for dialogs,\n context menus, etc. If |parent_view| is not provided then the main screen\n monitor will be used and some functionality that requires a parent view\n may not function correctly. In order to create windowless browsers the\n CefSettings.windowless_rendering_enabled value must be set to true.\n Transparent painting is enabled by default but can be disabled by setting\n CefBrowserSettings.background_color to an opaque value.\n"]
    pub windowless_rendering_enabled: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to enable shared textures for windowless rendering. Only\n valid if windowless_rendering_enabled above is also set to true. Currently\n only supported on Windows (D3D11).\n"]
    pub shared_texture_enabled: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to enable the ability to issue BeginFrame from the client\n application.\n"]
    pub external_begin_frame_enabled: ::std::os::raw::c_int,
    #[doc = "\n NSView pointer for the new browser view. Only used with windowed\n rendering.\n"]
    pub view: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__cef_window_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_window_info_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_window_info_t>(),
        80usize,
        concat!("Size of: ", stringify!(_cef_window_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_window_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_window_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).window_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(window_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bounds) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(bounds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hidden) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(hidden)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent_view) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(parent_view)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).windowless_rendering_enabled) as usize - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(windowless_rendering_enabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shared_texture_enabled) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(shared_texture_enabled)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).external_begin_frame_enabled) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(external_begin_frame_enabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).view) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_window_info_t),
            "::",
            stringify!(view)
        )
    );
}
#[doc = "\n Class representing window information.\n"]
pub type cef_window_info_t = _cef_window_info_t;
pub type cef_color_t = u32;
#[doc = "\n Default logging (currently INFO logging).\n"]
pub const cef_log_severity_t_LOGSEVERITY_DEFAULT: cef_log_severity_t = 0;
#[doc = "\n Verbose logging.\n"]
pub const cef_log_severity_t_LOGSEVERITY_VERBOSE: cef_log_severity_t = 1;
#[doc = "\n DEBUG logging.\n"]
pub const cef_log_severity_t_LOGSEVERITY_DEBUG: cef_log_severity_t = 1;
#[doc = "\n INFO logging.\n"]
pub const cef_log_severity_t_LOGSEVERITY_INFO: cef_log_severity_t = 2;
#[doc = "\n WARNING logging.\n"]
pub const cef_log_severity_t_LOGSEVERITY_WARNING: cef_log_severity_t = 3;
#[doc = "\n ERROR logging.\n"]
pub const cef_log_severity_t_LOGSEVERITY_ERROR: cef_log_severity_t = 4;
#[doc = "\n FATAL logging.\n"]
pub const cef_log_severity_t_LOGSEVERITY_FATAL: cef_log_severity_t = 5;
#[doc = "\n Disable logging to file for all messages, and to stderr for messages with\n severity less than FATAL.\n"]
pub const cef_log_severity_t_LOGSEVERITY_DISABLE: cef_log_severity_t = 99;
#[doc = "\n Log severity levels.\n"]
pub type cef_log_severity_t = ::std::os::raw::c_uint;
#[doc = "\n Use the default state for the setting.\n"]
pub const cef_state_t_STATE_DEFAULT: cef_state_t = 0;
#[doc = "\n Enable or allow the setting.\n"]
pub const cef_state_t_STATE_ENABLED: cef_state_t = 1;
#[doc = "\n Disable or disallow the setting.\n"]
pub const cef_state_t_STATE_DISABLED: cef_state_t = 2;
#[doc = "\n Represents the state of a setting.\n"]
pub type cef_state_t = ::std::os::raw::c_uint;
#[doc = "\n Initialization settings. Specify NULL or 0 to get the recommended default\n values. Many of these and other settings can also configured using command-\n line switches.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_settings_t {
    #[doc = "\n Size of this structure.\n"]
    pub size: usize,
    #[doc = "\n Set to true (1) to disable the sandbox for sub-processes. See\n cef_sandbox_win.h for requirements to enable the sandbox on Windows. Also\n configurable using the \"no-sandbox\" command-line switch.\n"]
    pub no_sandbox: ::std::os::raw::c_int,
    #[doc = "\n The path to a separate executable that will be launched for sub-processes.\n If this value is empty on Windows or Linux then the main process\n executable will be used. If this value is empty on macOS then a helper\n executable must exist at \"Contents/Frameworks/<app>\n Helper.app/Contents/MacOS/<app> Helper\" in the top-level app bundle. See\n the comments on CefExecuteProcess() for details. If this value is\n non-empty then it must be an absolute path. Also configurable using the\n \"browser-subprocess-path\" command-line switch.\n"]
    pub browser_subprocess_path: cef_string_t,
    #[doc = "\n The path to the CEF framework directory on macOS. If this value is empty\n then the framework must exist at \"Contents/Frameworks/Chromium Embedded\n Framework.framework\" in the top-level app bundle. If this value is\n non-empty then it must be an absolute path. Also configurable using the\n \"framework-dir-path\" command-line switch.\n"]
    pub framework_dir_path: cef_string_t,
    #[doc = "\n The path to the main bundle on macOS. If this value is empty then it\n defaults to the top-level app bundle. If this value is non-empty then it\n must be an absolute path. Also configurable using the \"main-bundle-path\"\n command-line switch.\n"]
    pub main_bundle_path: cef_string_t,
    #[doc = "\n Set to true (1) to enable use of the Chrome runtime in CEF. This feature\n is considered experimental and is not recommended for most users at this\n time. See issue #2969 for details.\n"]
    pub chrome_runtime: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to have the browser process message loop run in a separate\n thread. If false (0) then the CefDoMessageLoopWork() function must be\n called from your application message loop. This option is only supported\n on Windows and Linux.\n"]
    pub multi_threaded_message_loop: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to control browser process main (UI) thread message pump\n scheduling via the CefBrowserProcessHandler::OnScheduleMessagePumpWork()\n callback. This option is recommended for use in combination with the\n CefDoMessageLoopWork() function in cases where the CEF message loop must\n be integrated into an existing application message loop (see additional\n comments and warnings on CefDoMessageLoopWork). Enabling this option is\n not recommended for most users; leave this option disabled and use either\n the CefRunMessageLoop() function or multi_threaded_message_loop if\n possible.\n"]
    pub external_message_pump: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to enable windowless (off-screen) rendering support. Do\n not enable this value if the application does not use windowless rendering\n as it may reduce rendering performance on some systems.\n"]
    pub windowless_rendering_enabled: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to disable configuration of browser process features using\n standard CEF and Chromium command-line arguments. Configuration can still\n be specified using CEF data structures or via the\n CefApp::OnBeforeCommandLineProcessing() method.\n"]
    pub command_line_args_disabled: ::std::os::raw::c_int,
    #[doc = "\n The location where data for the global browser cache will be stored on\n disk. If this value is non-empty then it must be an absolute path that is\n either equal to or a child directory of CefSettings.root_cache_path. If\n this value is empty then browsers will be created in \"incognito mode\"\n where in-memory caches are used for storage and no data is persisted to\n disk. HTML5 databases such as localStorage will only persist across\n sessions if a cache path is specified. Can be overridden for individual\n CefRequestContext instances via the CefRequestContextSettings.cache_path\n value. When using the Chrome runtime the \"default\" profile will be used if\n |cache_path| and |root_cache_path| have the same value.\n"]
    pub cache_path: cef_string_t,
    #[doc = "\n The root directory that all CefSettings.cache_path and\n CefRequestContextSettings.cache_path values must have in common. If this\n value is empty and CefSettings.cache_path is non-empty then it will\n default to the CefSettings.cache_path value. If both values are empty\n then the default platform-specific directory will be used\n (\"~/.config/cef_user_data\" directory on Linux, \"~/Library/Application\n Support/CEF/User Data\" directory on MacOS, \"AppData\\Local\\CEF\\User Data\"\n directory under the user profile directory on Windows). If this value is\n non-empty then it must be an absolute path. Failure to set this value\n correctly may result in the sandbox blocking read/write access to certain\n files.\n"]
    pub root_cache_path: cef_string_t,
    #[doc = "\n To persist session cookies (cookies without an expiry date or validity\n interval) by default when using the global cookie manager set this value\n to true (1). Session cookies are generally intended to be transient and\n most Web browsers do not persist them. A |cache_path| value must also be\n specified to enable this feature. Also configurable using the\n \"persist-session-cookies\" command-line switch. Can be overridden for\n individual CefRequestContext instances via the\n CefRequestContextSettings.persist_session_cookies value.\n"]
    pub persist_session_cookies: ::std::os::raw::c_int,
    #[doc = "\n To persist user preferences as a JSON file in the cache path directory set\n this value to true (1). A |cache_path| value must also be specified\n to enable this feature. Also configurable using the\n \"persist-user-preferences\" command-line switch. Can be overridden for\n individual CefRequestContext instances via the\n CefRequestContextSettings.persist_user_preferences value.\n"]
    pub persist_user_preferences: ::std::os::raw::c_int,
    #[doc = "\n Value that will be returned as the User-Agent HTTP header. If empty the\n default User-Agent string will be used. Also configurable using the\n \"user-agent\" command-line switch.\n"]
    pub user_agent: cef_string_t,
    #[doc = "\n Value that will be inserted as the product portion of the default\n User-Agent string. If empty the Chromium product version will be used. If\n |userAgent| is specified this value will be ignored. Also configurable\n using the \"user-agent-product\" command-line switch.\n"]
    pub user_agent_product: cef_string_t,
    #[doc = "\n The locale string that will be passed to WebKit. If empty the default\n locale of \"en-US\" will be used. This value is ignored on Linux where\n locale is determined using environment variable parsing with the\n precedence order: LANGUAGE, LC_ALL, LC_MESSAGES and LANG. Also\n configurable using the \"lang\" command-line switch.\n"]
    pub locale: cef_string_t,
    #[doc = "\n The directory and file name to use for the debug log. If empty a default\n log file name and location will be used. On Windows and Linux a\n \"debug.log\" file will be written in the main executable directory. On\n MacOS a \"~/Library/Logs/[app name]_debug.log\" file will be written where\n [app name] is the name of the main app executable. Also configurable using\n the \"log-file\" command-line switch.\n"]
    pub log_file: cef_string_t,
    #[doc = "\n The log severity. Only messages of this severity level or higher will be\n logged. When set to DISABLE no messages will be written to the log file,\n but FATAL messages will still be output to stderr. Also configurable using\n the \"log-severity\" command-line switch with a value of \"verbose\", \"info\",\n \"warning\", \"error\", \"fatal\" or \"disable\".\n"]
    pub log_severity: cef_log_severity_t,
    #[doc = "\n Custom flags that will be used when initializing the V8 JavaScript engine.\n The consequences of using custom flags may not be well tested. Also\n configurable using the \"js-flags\" command-line switch.\n"]
    pub javascript_flags: cef_string_t,
    #[doc = "\n The fully qualified path for the resources directory. If this value is\n empty the *.pak files must be located in the module directory on\n Windows/Linux or the app bundle Resources directory on MacOS. If this\n value is non-empty then it must be an absolute path. Also configurable\n using the \"resources-dir-path\" command-line switch.\n"]
    pub resources_dir_path: cef_string_t,
    #[doc = "\n The fully qualified path for the locales directory. If this value is empty\n the locales directory must be located in the module directory. If this\n value is non-empty then it must be an absolute path. This value is ignored\n on MacOS where pack files are always loaded from the app bundle Resources\n directory. Also configurable using the \"locales-dir-path\" command-line\n switch.\n"]
    pub locales_dir_path: cef_string_t,
    #[doc = "\n Set to true (1) to disable loading of pack files for resources and\n locales. A resource bundle handler must be provided for the browser and\n render processes via CefApp::GetResourceBundleHandler() if loading of pack\n files is disabled. Also configurable using the \"disable-pack-loading\"\n command- line switch.\n"]
    pub pack_loading_disabled: ::std::os::raw::c_int,
    #[doc = "\n Set to a value between 1024 and 65535 to enable remote debugging on the\n specified port. Also configurable using the \"remote-debugging-port\"\n command-line switch. Remote debugging can be accessed by loading the\n chrome://inspect page in Google Chrome. Port numbers 9222 and 9229 are\n discoverable by default. Other port numbers may need to be configured via\n \"Discover network targets\" on the Devices tab.\n"]
    pub remote_debugging_port: ::std::os::raw::c_int,
    #[doc = "\n The number of stack trace frames to capture for uncaught exceptions.\n Specify a positive value to enable the\n CefRenderProcessHandler::OnUncaughtException() callback. Specify 0\n (default value) and OnUncaughtException() will not be called. Also\n configurable using the \"uncaught-exception-stack-size\" command-line\n switch.\n"]
    pub uncaught_exception_stack_size: ::std::os::raw::c_int,
    #[doc = "\n Background color used for the browser before a document is loaded and when\n no document color is specified. The alpha component must be either fully\n opaque (0xFF) or fully transparent (0x00). If the alpha component is fully\n opaque then the RGB components will be used as the background color. If\n the alpha component is fully transparent for a windowed browser then the\n default value of opaque white be used. If the alpha component is fully\n transparent for a windowless (off-screen) browser then transparent\n painting will be enabled.\n"]
    pub background_color: cef_color_t,
    #[doc = "\n Comma delimited ordered list of language codes without any whitespace that\n will be used in the \"Accept-Language\" HTTP header. May be overridden on a\n per-browser basis using the CefBrowserSettings.accept_language_list value.\n If both values are empty then \"en-US,en\" will be used. Can be overridden\n for individual CefRequestContext instances via the\n CefRequestContextSettings.accept_language_list value.\n"]
    pub accept_language_list: cef_string_t,
    #[doc = "\n Comma delimited list of schemes supported by the associated\n CefCookieManager. If |cookieable_schemes_exclude_defaults| is false (0)\n the default schemes (\"http\", \"https\", \"ws\" and \"wss\") will also be\n supported. Not specifying a |cookieable_schemes_list| value and setting\n |cookieable_schemes_exclude_defaults| to true (1) will disable all loading\n and saving of cookies. These settings will only impact the global\n CefRequestContext. Individual CefRequestContext instances can be\n configured via the CefRequestContextSettings.cookieable_schemes_list and\n CefRequestContextSettings.cookieable_schemes_exclude_defaults values.\n"]
    pub cookieable_schemes_list: cef_string_t,
    pub cookieable_schemes_exclude_defaults: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_settings_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_settings_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_settings_t>(),
        416usize,
        concat!("Size of: ", stringify!(_cef_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_settings_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_settings_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).no_sandbox) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(no_sandbox)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).browser_subprocess_path) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(browser_subprocess_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).framework_dir_path) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(framework_dir_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).main_bundle_path) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(main_bundle_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chrome_runtime) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(chrome_runtime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).multi_threaded_message_loop) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(multi_threaded_message_loop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).external_message_pump) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(external_message_pump)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).windowless_rendering_enabled) as usize - ptr as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(windowless_rendering_enabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).command_line_args_disabled) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(command_line_args_disabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cache_path) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(cache_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).root_cache_path) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(root_cache_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).persist_session_cookies) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(persist_session_cookies)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).persist_user_preferences) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(persist_user_preferences)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user_agent) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(user_agent)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).user_agent_product) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(user_agent_product)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locale) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(locale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log_file) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(log_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log_severity) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(log_severity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).javascript_flags) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(javascript_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resources_dir_path) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(resources_dir_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locales_dir_path) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(locales_dir_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pack_loading_disabled) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(pack_loading_disabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remote_debugging_port) as usize - ptr as usize },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(remote_debugging_port)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).uncaught_exception_stack_size) as usize - ptr as usize
        },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(uncaught_exception_stack_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).background_color) as usize - ptr as usize },
        356usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(background_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accept_language_list) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(accept_language_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cookieable_schemes_list) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(cookieable_schemes_list)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).cookieable_schemes_exclude_defaults) as usize - ptr as usize
        },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_settings_t),
            "::",
            stringify!(cookieable_schemes_exclude_defaults)
        )
    );
}
#[doc = "\n Initialization settings. Specify NULL or 0 to get the recommended default\n values. Many of these and other settings can also configured using command-\n line switches.\n"]
pub type cef_settings_t = _cef_settings_t;
#[doc = "\n Request context initialization settings. Specify NULL or 0 to get the\n recommended default values.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_request_context_settings_t {
    #[doc = "\n Size of this structure.\n"]
    pub size: usize,
    #[doc = "\n The location where cache data for this request context will be stored on\n disk. If this value is non-empty then it must be an absolute path that is\n either equal to or a child directory of CefSettings.root_cache_path. If\n this value is empty then browsers will be created in \"incognito mode\"\n where in-memory caches are used for storage and no data is persisted to\n disk. HTML5 databases such as localStorage will only persist across\n sessions if a cache path is specified. To share the global browser cache\n and related configuration set this value to match the\n CefSettings.cache_path value.\n"]
    pub cache_path: cef_string_t,
    #[doc = "\n To persist session cookies (cookies without an expiry date or validity\n interval) by default when using the global cookie manager set this value\n to true (1). Session cookies are generally intended to be transient and\n most Web browsers do not persist them. Can be set globally using the\n CefSettings.persist_session_cookies value. This value will be ignored if\n |cache_path| is empty or if it matches the CefSettings.cache_path value.\n"]
    pub persist_session_cookies: ::std::os::raw::c_int,
    #[doc = "\n To persist user preferences as a JSON file in the cache path directory set\n this value to true (1). Can be set globally using the\n CefSettings.persist_user_preferences value. This value will be ignored if\n |cache_path| is empty or if it matches the CefSettings.cache_path value.\n"]
    pub persist_user_preferences: ::std::os::raw::c_int,
    #[doc = "\n Comma delimited ordered list of language codes without any whitespace that\n will be used in the \"Accept-Language\" HTTP header. Can be set globally\n using the CefSettings.accept_language_list value or overridden on a per-\n browser basis using the CefBrowserSettings.accept_language_list value. If\n all values are empty then \"en-US,en\" will be used. This value will be\n ignored if |cache_path| matches the CefSettings.cache_path value.\n"]
    pub accept_language_list: cef_string_t,
    #[doc = "\n Comma delimited list of schemes supported by the associated\n CefCookieManager. If |cookieable_schemes_exclude_defaults| is false (0)\n the default schemes (\"http\", \"https\", \"ws\" and \"wss\") will also be\n supported. Not specifying a |cookieable_schemes_list| value and setting\n |cookieable_schemes_exclude_defaults| to true (1) will disable all loading\n and saving of cookies. These values will be ignored if |cache_path|\n matches the CefSettings.cache_path value.\n"]
    pub cookieable_schemes_list: cef_string_t,
    pub cookieable_schemes_exclude_defaults: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_request_context_settings_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_request_context_settings_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_request_context_settings_t>(),
        96usize,
        concat!("Size of: ", stringify!(_cef_request_context_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_request_context_settings_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_request_context_settings_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cache_path) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(cache_path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).persist_session_cookies) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(persist_session_cookies)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).persist_user_preferences) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(persist_user_preferences)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accept_language_list) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(accept_language_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cookieable_schemes_list) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(cookieable_schemes_list)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).cookieable_schemes_exclude_defaults) as usize - ptr as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_request_context_settings_t),
            "::",
            stringify!(cookieable_schemes_exclude_defaults)
        )
    );
}
#[doc = "\n Request context initialization settings. Specify NULL or 0 to get the\n recommended default values.\n"]
pub type cef_request_context_settings_t = _cef_request_context_settings_t;
#[doc = "\n Browser initialization settings. Specify NULL or 0 to get the recommended\n default values. The consequences of using custom values may not be well\n tested. Many of these and other settings can also configured using command-\n line switches.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_browser_settings_t {
    #[doc = "\n Size of this structure.\n"]
    pub size: usize,
    #[doc = "\n The maximum rate in frames per second (fps) that CefRenderHandler::OnPaint\n will be called for a windowless browser. The actual fps may be lower if\n the browser cannot generate frames at the requested rate. The minimum\n value is 1 and the maximum value is 60 (default 30). This value can also\n be changed dynamically via CefBrowserHost::SetWindowlessFrameRate.\n"]
    pub windowless_frame_rate: ::std::os::raw::c_int,
    #[doc = "\n Font settings.\n"]
    pub standard_font_family: cef_string_t,
    pub fixed_font_family: cef_string_t,
    pub serif_font_family: cef_string_t,
    pub sans_serif_font_family: cef_string_t,
    pub cursive_font_family: cef_string_t,
    pub fantasy_font_family: cef_string_t,
    pub default_font_size: ::std::os::raw::c_int,
    pub default_fixed_font_size: ::std::os::raw::c_int,
    pub minimum_font_size: ::std::os::raw::c_int,
    pub minimum_logical_font_size: ::std::os::raw::c_int,
    #[doc = "\n Default encoding for Web content. If empty \"ISO-8859-1\" will be used. Also\n configurable using the \"default-encoding\" command-line switch.\n"]
    pub default_encoding: cef_string_t,
    #[doc = "\n Controls the loading of fonts from remote sources. Also configurable using\n the \"disable-remote-fonts\" command-line switch.\n"]
    pub remote_fonts: cef_state_t,
    #[doc = "\n Controls whether JavaScript can be executed. Also configurable using the\n \"disable-javascript\" command-line switch.\n"]
    pub javascript: cef_state_t,
    #[doc = "\n Controls whether JavaScript can be used to close windows that were not\n opened via JavaScript. JavaScript can still be used to close windows that\n were opened via JavaScript or that have no back/forward history. Also\n configurable using the \"disable-javascript-close-windows\" command-line\n switch.\n"]
    pub javascript_close_windows: cef_state_t,
    #[doc = "\n Controls whether JavaScript can access the clipboard. Also configurable\n using the \"disable-javascript-access-clipboard\" command-line switch.\n"]
    pub javascript_access_clipboard: cef_state_t,
    #[doc = "\n Controls whether DOM pasting is supported in the editor via\n execCommand(\"paste\"). The |javascript_access_clipboard| setting must also\n be enabled. Also configurable using the \"disable-javascript-dom-paste\"\n command-line switch.\n"]
    pub javascript_dom_paste: cef_state_t,
    #[doc = "\n Controls whether image URLs will be loaded from the network. A cached\n image will still be rendered if requested. Also configurable using the\n \"disable-image-loading\" command-line switch.\n"]
    pub image_loading: cef_state_t,
    #[doc = "\n Controls whether standalone images will be shrunk to fit the page. Also\n configurable using the \"image-shrink-standalone-to-fit\" command-line\n switch.\n"]
    pub image_shrink_standalone_to_fit: cef_state_t,
    #[doc = "\n Controls whether text areas can be resized. Also configurable using the\n \"disable-text-area-resize\" command-line switch.\n"]
    pub text_area_resize: cef_state_t,
    #[doc = "\n Controls whether the tab key can advance focus to links. Also configurable\n using the \"disable-tab-to-links\" command-line switch.\n"]
    pub tab_to_links: cef_state_t,
    #[doc = "\n Controls whether local storage can be used. Also configurable using the\n \"disable-local-storage\" command-line switch.\n"]
    pub local_storage: cef_state_t,
    #[doc = "\n Controls whether databases can be used. Also configurable using the\n \"disable-databases\" command-line switch.\n"]
    pub databases: cef_state_t,
    #[doc = "\n Controls whether WebGL can be used. Note that WebGL requires hardware\n support and may not work on all systems even when enabled. Also\n configurable using the \"disable-webgl\" command-line switch.\n"]
    pub webgl: cef_state_t,
    #[doc = "\n Background color used for the browser before a document is loaded and when\n no document color is specified. The alpha component must be either fully\n opaque (0xFF) or fully transparent (0x00). If the alpha component is fully\n opaque then the RGB components will be used as the background color. If\n the alpha component is fully transparent for a windowed browser then the\n CefSettings.background_color value will be used. If the alpha component is\n fully transparent for a windowless (off-screen) browser then transparent\n painting will be enabled.\n"]
    pub background_color: cef_color_t,
    #[doc = "\n Comma delimited ordered list of language codes without any whitespace that\n will be used in the \"Accept-Language\" HTTP header. May be set globally\n using the CefSettings.accept_language_list value. If both values are\n empty then \"en-US,en\" will be used.\n"]
    pub accept_language_list: cef_string_t,
    #[doc = "\n Controls whether the Chrome status bubble will be used. Only supported\n with the Chrome runtime. For details about the status bubble see\n https://www.chromium.org/user-experience/status-bubble/\n"]
    pub chrome_status_bubble: cef_state_t,
}
#[test]
fn bindgen_test_layout__cef_browser_settings_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_browser_settings_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_browser_settings_t>(),
        288usize,
        concat!("Size of: ", stringify!(_cef_browser_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_browser_settings_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_browser_settings_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).windowless_frame_rate) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(windowless_frame_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).standard_font_family) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(standard_font_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fixed_font_family) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(fixed_font_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).serif_font_family) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(serif_font_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sans_serif_font_family) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(sans_serif_font_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cursive_font_family) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(cursive_font_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fantasy_font_family) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(fantasy_font_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_font_size) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(default_font_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_fixed_font_size) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(default_fixed_font_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minimum_font_size) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(minimum_font_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minimum_logical_font_size) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(minimum_logical_font_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_encoding) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(default_encoding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remote_fonts) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(remote_fonts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).javascript) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(javascript)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).javascript_close_windows) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(javascript_close_windows)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).javascript_access_clipboard) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(javascript_access_clipboard)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).javascript_dom_paste) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(javascript_dom_paste)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).image_loading) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(image_loading)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).image_shrink_standalone_to_fit) as usize - ptr as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(image_shrink_standalone_to_fit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text_area_resize) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(text_area_resize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tab_to_links) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(tab_to_links)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).local_storage) as usize - ptr as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(local_storage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).databases) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(databases)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).webgl) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(webgl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).background_color) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(background_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accept_language_list) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(accept_language_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chrome_status_bubble) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_browser_settings_t),
            "::",
            stringify!(chrome_status_bubble)
        )
    );
}
#[doc = "\n Browser initialization settings. Specify NULL or 0 to get the recommended\n default values. The consequences of using custom values may not be well\n tested. Many of these and other settings can also configured using command-\n line switches.\n"]
pub type cef_browser_settings_t = _cef_browser_settings_t;
#[doc = "\n Cancel immediately.\n"]
pub const cef_return_value_t_RV_CANCEL: cef_return_value_t = 0;
#[doc = "\n Continue immediately.\n"]
pub const cef_return_value_t_RV_CONTINUE: cef_return_value_t = 1;
#[doc = "\n Continue asynchronously (usually via a callback).\n"]
pub const cef_return_value_t_RV_CONTINUE_ASYNC: cef_return_value_t = 2;
#[doc = "\n Return value types.\n"]
pub type cef_return_value_t = ::std::os::raw::c_uint;
#[doc = "\n URL component parts.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_urlparts_t {
    #[doc = "\n The complete URL specification.\n"]
    pub spec: cef_string_t,
    #[doc = "\n Scheme component not including the colon (e.g., \"http\").\n"]
    pub scheme: cef_string_t,
    #[doc = "\n User name component.\n"]
    pub username: cef_string_t,
    #[doc = "\n Password component.\n"]
    pub password: cef_string_t,
    #[doc = "\n Host component. This may be a hostname, an IPv4 address or an IPv6 literal\n surrounded by square brackets (e.g., \"[2001:db8::1]\").\n"]
    pub host: cef_string_t,
    #[doc = "\n Port number component.\n"]
    pub port: cef_string_t,
    #[doc = "\n Origin contains just the scheme, host, and port from a URL. Equivalent to\n clearing any username and password, replacing the path with a slash, and\n clearing everything after that. This value will be empty for non-standard\n URLs.\n"]
    pub origin: cef_string_t,
    #[doc = "\n Path component including the first slash following the host.\n"]
    pub path: cef_string_t,
    #[doc = "\n Query string component (i.e., everything following the '?').\n"]
    pub query: cef_string_t,
    #[doc = "\n Fragment (hash) identifier component (i.e., the string following the '#').\n"]
    pub fragment: cef_string_t,
}
#[test]
fn bindgen_test_layout__cef_urlparts_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_urlparts_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_urlparts_t>(),
        240usize,
        concat!("Size of: ", stringify!(_cef_urlparts_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_urlparts_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_urlparts_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(spec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scheme) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(scheme)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).username) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(username)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).password) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(password)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).host) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(host)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).origin) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(origin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).query) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(query)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fragment) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_urlparts_t),
            "::",
            stringify!(fragment)
        )
    );
}
#[doc = "\n URL component parts.\n"]
pub type cef_urlparts_t = _cef_urlparts_t;
pub const cef_cookie_priority_t_CEF_COOKIE_PRIORITY_LOW: cef_cookie_priority_t = -1;
pub const cef_cookie_priority_t_CEF_COOKIE_PRIORITY_MEDIUM: cef_cookie_priority_t = 0;
pub const cef_cookie_priority_t_CEF_COOKIE_PRIORITY_HIGH: cef_cookie_priority_t = 1;
#[doc = "\n Cookie priority values.\n"]
pub type cef_cookie_priority_t = ::std::os::raw::c_int;
pub const cef_cookie_same_site_t_CEF_COOKIE_SAME_SITE_UNSPECIFIED: cef_cookie_same_site_t = 0;
pub const cef_cookie_same_site_t_CEF_COOKIE_SAME_SITE_NO_RESTRICTION: cef_cookie_same_site_t = 1;
pub const cef_cookie_same_site_t_CEF_COOKIE_SAME_SITE_LAX_MODE: cef_cookie_same_site_t = 2;
pub const cef_cookie_same_site_t_CEF_COOKIE_SAME_SITE_STRICT_MODE: cef_cookie_same_site_t = 3;
#[doc = "\n Cookie same site values.\n"]
pub type cef_cookie_same_site_t = ::std::os::raw::c_uint;
#[doc = "\n Cookie information.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_cookie_t {
    #[doc = "\n The cookie name.\n"]
    pub name: cef_string_t,
    #[doc = "\n The cookie value.\n"]
    pub value: cef_string_t,
    #[doc = "\n If |domain| is empty a host cookie will be created instead of a domain\n cookie. Domain cookies are stored with a leading \".\" and are visible to\n sub-domains whereas host cookies are not.\n"]
    pub domain: cef_string_t,
    #[doc = "\n If |path| is non-empty only URLs at or below the path will get the cookie\n value.\n"]
    pub path: cef_string_t,
    #[doc = "\n If |secure| is true the cookie will only be sent for HTTPS requests.\n"]
    pub secure: ::std::os::raw::c_int,
    #[doc = "\n If |httponly| is true the cookie will only be sent for HTTP requests.\n"]
    pub httponly: ::std::os::raw::c_int,
    #[doc = "\n The cookie creation date. This is automatically populated by the system on\n cookie creation.\n"]
    pub creation: cef_basetime_t,
    #[doc = "\n The cookie last access date. This is automatically populated by the system\n on access.\n"]
    pub last_access: cef_basetime_t,
    #[doc = "\n The cookie expiration date is only valid if |has_expires| is true.\n"]
    pub has_expires: ::std::os::raw::c_int,
    pub expires: cef_basetime_t,
    #[doc = "\n Same site.\n"]
    pub same_site: cef_cookie_same_site_t,
    #[doc = "\n Priority.\n"]
    pub priority: cef_cookie_priority_t,
}
#[test]
fn bindgen_test_layout__cef_cookie_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_cookie_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_cookie_t>(),
        144usize,
        concat!("Size of: ", stringify!(_cef_cookie_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_cookie_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_cookie_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domain) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(domain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).secure) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(secure)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).httponly) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(httponly)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).creation) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(creation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_access) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(last_access)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_expires) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(has_expires)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).expires) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(expires)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).same_site) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(same_site)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cookie_t),
            "::",
            stringify!(priority)
        )
    );
}
#[doc = "\n Cookie information.\n"]
pub type cef_cookie_t = _cef_cookie_t;
#[doc = "\n Non-zero exit status.\n"]
pub const cef_termination_status_t_TS_ABNORMAL_TERMINATION: cef_termination_status_t = 0;
#[doc = "\n SIGKILL or task manager kill.\n"]
pub const cef_termination_status_t_TS_PROCESS_WAS_KILLED: cef_termination_status_t = 1;
#[doc = "\n Segmentation fault.\n"]
pub const cef_termination_status_t_TS_PROCESS_CRASHED: cef_termination_status_t = 2;
#[doc = "\n Out of memory. Some platforms may use TS_PROCESS_CRASHED instead.\n"]
pub const cef_termination_status_t_TS_PROCESS_OOM: cef_termination_status_t = 3;
#[doc = "\n Process termination status values.\n"]
pub type cef_termination_status_t = ::std::os::raw::c_uint;
#[doc = "\n Current directory.\n"]
pub const cef_path_key_t_PK_DIR_CURRENT: cef_path_key_t = 0;
#[doc = "\n Directory containing PK_FILE_EXE.\n"]
pub const cef_path_key_t_PK_DIR_EXE: cef_path_key_t = 1;
#[doc = "\n Directory containing PK_FILE_MODULE.\n"]
pub const cef_path_key_t_PK_DIR_MODULE: cef_path_key_t = 2;
#[doc = "\n Temporary directory.\n"]
pub const cef_path_key_t_PK_DIR_TEMP: cef_path_key_t = 3;
#[doc = "\n Path and filename of the current executable.\n"]
pub const cef_path_key_t_PK_FILE_EXE: cef_path_key_t = 4;
#[doc = "\n Path and filename of the module containing the CEF code (usually the\n libcef module).\n"]
pub const cef_path_key_t_PK_FILE_MODULE: cef_path_key_t = 5;
#[doc = "\n \"Local Settings\\Application Data\" directory under the user profile\n directory on Windows.\n"]
pub const cef_path_key_t_PK_LOCAL_APP_DATA: cef_path_key_t = 6;
#[doc = "\n \"Application Data\" directory under the user profile directory on Windows\n and \"~/Library/Application Support\" directory on MacOS.\n"]
pub const cef_path_key_t_PK_USER_DATA: cef_path_key_t = 7;
#[doc = "\n Directory containing application resources. Can be configured via\n CefSettings.resources_dir_path.\n"]
pub const cef_path_key_t_PK_DIR_RESOURCES: cef_path_key_t = 8;
#[doc = "\n Path key values.\n"]
pub type cef_path_key_t = ::std::os::raw::c_uint;
pub const cef_storage_type_t_ST_LOCALSTORAGE: cef_storage_type_t = 0;
pub const cef_storage_type_t_ST_SESSIONSTORAGE: cef_storage_type_t = 1;
#[doc = "\n Storage types.\n"]
pub type cef_storage_type_t = ::std::os::raw::c_uint;
pub const cef_errorcode_t_ERR_NONE: cef_errorcode_t = 0;
pub const cef_errorcode_t_ERR_IO_PENDING: cef_errorcode_t = -1;
pub const cef_errorcode_t_ERR_FAILED: cef_errorcode_t = -2;
pub const cef_errorcode_t_ERR_ABORTED: cef_errorcode_t = -3;
pub const cef_errorcode_t_ERR_INVALID_ARGUMENT: cef_errorcode_t = -4;
pub const cef_errorcode_t_ERR_INVALID_HANDLE: cef_errorcode_t = -5;
pub const cef_errorcode_t_ERR_FILE_NOT_FOUND: cef_errorcode_t = -6;
pub const cef_errorcode_t_ERR_TIMED_OUT: cef_errorcode_t = -7;
pub const cef_errorcode_t_ERR_FILE_TOO_BIG: cef_errorcode_t = -8;
pub const cef_errorcode_t_ERR_UNEXPECTED: cef_errorcode_t = -9;
pub const cef_errorcode_t_ERR_ACCESS_DENIED: cef_errorcode_t = -10;
pub const cef_errorcode_t_ERR_NOT_IMPLEMENTED: cef_errorcode_t = -11;
pub const cef_errorcode_t_ERR_INSUFFICIENT_RESOURCES: cef_errorcode_t = -12;
pub const cef_errorcode_t_ERR_OUT_OF_MEMORY: cef_errorcode_t = -13;
pub const cef_errorcode_t_ERR_UPLOAD_FILE_CHANGED: cef_errorcode_t = -14;
pub const cef_errorcode_t_ERR_SOCKET_NOT_CONNECTED: cef_errorcode_t = -15;
pub const cef_errorcode_t_ERR_FILE_EXISTS: cef_errorcode_t = -16;
pub const cef_errorcode_t_ERR_FILE_PATH_TOO_LONG: cef_errorcode_t = -17;
pub const cef_errorcode_t_ERR_FILE_NO_SPACE: cef_errorcode_t = -18;
pub const cef_errorcode_t_ERR_FILE_VIRUS_INFECTED: cef_errorcode_t = -19;
pub const cef_errorcode_t_ERR_BLOCKED_BY_CLIENT: cef_errorcode_t = -20;
pub const cef_errorcode_t_ERR_NETWORK_CHANGED: cef_errorcode_t = -21;
pub const cef_errorcode_t_ERR_BLOCKED_BY_ADMINISTRATOR: cef_errorcode_t = -22;
pub const cef_errorcode_t_ERR_SOCKET_IS_CONNECTED: cef_errorcode_t = -23;
pub const cef_errorcode_t_ERR_UPLOAD_STREAM_REWIND_NOT_SUPPORTED: cef_errorcode_t = -25;
pub const cef_errorcode_t_ERR_CONTEXT_SHUT_DOWN: cef_errorcode_t = -26;
pub const cef_errorcode_t_ERR_BLOCKED_BY_RESPONSE: cef_errorcode_t = -27;
pub const cef_errorcode_t_ERR_CLEARTEXT_NOT_PERMITTED: cef_errorcode_t = -29;
pub const cef_errorcode_t_ERR_BLOCKED_BY_CSP: cef_errorcode_t = -30;
pub const cef_errorcode_t_ERR_H2_OR_QUIC_REQUIRED: cef_errorcode_t = -31;
pub const cef_errorcode_t_ERR_BLOCKED_BY_ORB: cef_errorcode_t = -32;
pub const cef_errorcode_t_ERR_CONNECTION_CLOSED: cef_errorcode_t = -100;
pub const cef_errorcode_t_ERR_CONNECTION_RESET: cef_errorcode_t = -101;
pub const cef_errorcode_t_ERR_CONNECTION_REFUSED: cef_errorcode_t = -102;
pub const cef_errorcode_t_ERR_CONNECTION_ABORTED: cef_errorcode_t = -103;
pub const cef_errorcode_t_ERR_CONNECTION_FAILED: cef_errorcode_t = -104;
pub const cef_errorcode_t_ERR_NAME_NOT_RESOLVED: cef_errorcode_t = -105;
pub const cef_errorcode_t_ERR_INTERNET_DISCONNECTED: cef_errorcode_t = -106;
pub const cef_errorcode_t_ERR_SSL_PROTOCOL_ERROR: cef_errorcode_t = -107;
pub const cef_errorcode_t_ERR_ADDRESS_INVALID: cef_errorcode_t = -108;
pub const cef_errorcode_t_ERR_ADDRESS_UNREACHABLE: cef_errorcode_t = -109;
pub const cef_errorcode_t_ERR_SSL_CLIENT_AUTH_CERT_NEEDED: cef_errorcode_t = -110;
pub const cef_errorcode_t_ERR_TUNNEL_CONNECTION_FAILED: cef_errorcode_t = -111;
pub const cef_errorcode_t_ERR_NO_SSL_VERSIONS_ENABLED: cef_errorcode_t = -112;
pub const cef_errorcode_t_ERR_SSL_VERSION_OR_CIPHER_MISMATCH: cef_errorcode_t = -113;
pub const cef_errorcode_t_ERR_SSL_RENEGOTIATION_REQUESTED: cef_errorcode_t = -114;
pub const cef_errorcode_t_ERR_PROXY_AUTH_UNSUPPORTED: cef_errorcode_t = -115;
pub const cef_errorcode_t_ERR_BAD_SSL_CLIENT_AUTH_CERT: cef_errorcode_t = -117;
pub const cef_errorcode_t_ERR_CONNECTION_TIMED_OUT: cef_errorcode_t = -118;
pub const cef_errorcode_t_ERR_HOST_RESOLVER_QUEUE_TOO_LARGE: cef_errorcode_t = -119;
pub const cef_errorcode_t_ERR_SOCKS_CONNECTION_FAILED: cef_errorcode_t = -120;
pub const cef_errorcode_t_ERR_SOCKS_CONNECTION_HOST_UNREACHABLE: cef_errorcode_t = -121;
pub const cef_errorcode_t_ERR_ALPN_NEGOTIATION_FAILED: cef_errorcode_t = -122;
pub const cef_errorcode_t_ERR_SSL_NO_RENEGOTIATION: cef_errorcode_t = -123;
pub const cef_errorcode_t_ERR_WINSOCK_UNEXPECTED_WRITTEN_BYTES: cef_errorcode_t = -124;
pub const cef_errorcode_t_ERR_SSL_DECOMPRESSION_FAILURE_ALERT: cef_errorcode_t = -125;
pub const cef_errorcode_t_ERR_SSL_BAD_RECORD_MAC_ALERT: cef_errorcode_t = -126;
pub const cef_errorcode_t_ERR_PROXY_AUTH_REQUESTED: cef_errorcode_t = -127;
pub const cef_errorcode_t_ERR_PROXY_CONNECTION_FAILED: cef_errorcode_t = -130;
pub const cef_errorcode_t_ERR_MANDATORY_PROXY_CONFIGURATION_FAILED: cef_errorcode_t = -131;
pub const cef_errorcode_t_ERR_PRECONNECT_MAX_SOCKET_LIMIT: cef_errorcode_t = -133;
pub const cef_errorcode_t_ERR_SSL_CLIENT_AUTH_PRIVATE_KEY_ACCESS_DENIED: cef_errorcode_t = -134;
pub const cef_errorcode_t_ERR_SSL_CLIENT_AUTH_CERT_NO_PRIVATE_KEY: cef_errorcode_t = -135;
pub const cef_errorcode_t_ERR_PROXY_CERTIFICATE_INVALID: cef_errorcode_t = -136;
pub const cef_errorcode_t_ERR_NAME_RESOLUTION_FAILED: cef_errorcode_t = -137;
pub const cef_errorcode_t_ERR_NETWORK_ACCESS_DENIED: cef_errorcode_t = -138;
pub const cef_errorcode_t_ERR_TEMPORARILY_THROTTLED: cef_errorcode_t = -139;
pub const cef_errorcode_t_ERR_HTTPS_PROXY_TUNNEL_RESPONSE_REDIRECT: cef_errorcode_t = -140;
pub const cef_errorcode_t_ERR_SSL_CLIENT_AUTH_SIGNATURE_FAILED: cef_errorcode_t = -141;
pub const cef_errorcode_t_ERR_MSG_TOO_BIG: cef_errorcode_t = -142;
pub const cef_errorcode_t_ERR_WS_PROTOCOL_ERROR: cef_errorcode_t = -145;
pub const cef_errorcode_t_ERR_ADDRESS_IN_USE: cef_errorcode_t = -147;
pub const cef_errorcode_t_ERR_SSL_HANDSHAKE_NOT_COMPLETED: cef_errorcode_t = -148;
pub const cef_errorcode_t_ERR_SSL_BAD_PEER_PUBLIC_KEY: cef_errorcode_t = -149;
pub const cef_errorcode_t_ERR_SSL_PINNED_KEY_NOT_IN_CERT_CHAIN: cef_errorcode_t = -150;
pub const cef_errorcode_t_ERR_CLIENT_AUTH_CERT_TYPE_UNSUPPORTED: cef_errorcode_t = -151;
pub const cef_errorcode_t_ERR_SSL_DECRYPT_ERROR_ALERT: cef_errorcode_t = -153;
pub const cef_errorcode_t_ERR_WS_THROTTLE_QUEUE_TOO_LARGE: cef_errorcode_t = -154;
pub const cef_errorcode_t_ERR_SSL_SERVER_CERT_CHANGED: cef_errorcode_t = -156;
pub const cef_errorcode_t_ERR_SSL_UNRECOGNIZED_NAME_ALERT: cef_errorcode_t = -159;
pub const cef_errorcode_t_ERR_SOCKET_SET_RECEIVE_BUFFER_SIZE_ERROR: cef_errorcode_t = -160;
pub const cef_errorcode_t_ERR_SOCKET_SET_SEND_BUFFER_SIZE_ERROR: cef_errorcode_t = -161;
pub const cef_errorcode_t_ERR_SOCKET_RECEIVE_BUFFER_SIZE_UNCHANGEABLE: cef_errorcode_t = -162;
pub const cef_errorcode_t_ERR_SOCKET_SEND_BUFFER_SIZE_UNCHANGEABLE: cef_errorcode_t = -163;
pub const cef_errorcode_t_ERR_SSL_CLIENT_AUTH_CERT_BAD_FORMAT: cef_errorcode_t = -164;
pub const cef_errorcode_t_ERR_ICANN_NAME_COLLISION: cef_errorcode_t = -166;
pub const cef_errorcode_t_ERR_SSL_SERVER_CERT_BAD_FORMAT: cef_errorcode_t = -167;
pub const cef_errorcode_t_ERR_CT_STH_PARSING_FAILED: cef_errorcode_t = -168;
pub const cef_errorcode_t_ERR_CT_STH_INCOMPLETE: cef_errorcode_t = -169;
pub const cef_errorcode_t_ERR_UNABLE_TO_REUSE_CONNECTION_FOR_PROXY_AUTH: cef_errorcode_t = -170;
pub const cef_errorcode_t_ERR_CT_CONSISTENCY_PROOF_PARSING_FAILED: cef_errorcode_t = -171;
pub const cef_errorcode_t_ERR_SSL_OBSOLETE_CIPHER: cef_errorcode_t = -172;
pub const cef_errorcode_t_ERR_WS_UPGRADE: cef_errorcode_t = -173;
pub const cef_errorcode_t_ERR_READ_IF_READY_NOT_IMPLEMENTED: cef_errorcode_t = -174;
pub const cef_errorcode_t_ERR_NO_BUFFER_SPACE: cef_errorcode_t = -176;
pub const cef_errorcode_t_ERR_SSL_CLIENT_AUTH_NO_COMMON_ALGORITHMS: cef_errorcode_t = -177;
pub const cef_errorcode_t_ERR_EARLY_DATA_REJECTED: cef_errorcode_t = -178;
pub const cef_errorcode_t_ERR_WRONG_VERSION_ON_EARLY_DATA: cef_errorcode_t = -179;
pub const cef_errorcode_t_ERR_TLS13_DOWNGRADE_DETECTED: cef_errorcode_t = -180;
pub const cef_errorcode_t_ERR_SSL_KEY_USAGE_INCOMPATIBLE: cef_errorcode_t = -181;
pub const cef_errorcode_t_ERR_INVALID_ECH_CONFIG_LIST: cef_errorcode_t = -182;
pub const cef_errorcode_t_ERR_ECH_NOT_NEGOTIATED: cef_errorcode_t = -183;
pub const cef_errorcode_t_ERR_ECH_FALLBACK_CERTIFICATE_INVALID: cef_errorcode_t = -184;
pub const cef_errorcode_t_ERR_CERT_COMMON_NAME_INVALID: cef_errorcode_t = -200;
pub const cef_errorcode_t_ERR_CERT_DATE_INVALID: cef_errorcode_t = -201;
pub const cef_errorcode_t_ERR_CERT_AUTHORITY_INVALID: cef_errorcode_t = -202;
pub const cef_errorcode_t_ERR_CERT_CONTAINS_ERRORS: cef_errorcode_t = -203;
pub const cef_errorcode_t_ERR_CERT_NO_REVOCATION_MECHANISM: cef_errorcode_t = -204;
pub const cef_errorcode_t_ERR_CERT_UNABLE_TO_CHECK_REVOCATION: cef_errorcode_t = -205;
pub const cef_errorcode_t_ERR_CERT_REVOKED: cef_errorcode_t = -206;
pub const cef_errorcode_t_ERR_CERT_INVALID: cef_errorcode_t = -207;
pub const cef_errorcode_t_ERR_CERT_WEAK_SIGNATURE_ALGORITHM: cef_errorcode_t = -208;
pub const cef_errorcode_t_ERR_CERT_NON_UNIQUE_NAME: cef_errorcode_t = -210;
pub const cef_errorcode_t_ERR_CERT_WEAK_KEY: cef_errorcode_t = -211;
pub const cef_errorcode_t_ERR_CERT_NAME_CONSTRAINT_VIOLATION: cef_errorcode_t = -212;
pub const cef_errorcode_t_ERR_CERT_VALIDITY_TOO_LONG: cef_errorcode_t = -213;
pub const cef_errorcode_t_ERR_CERTIFICATE_TRANSPARENCY_REQUIRED: cef_errorcode_t = -214;
pub const cef_errorcode_t_ERR_CERT_SYMANTEC_LEGACY: cef_errorcode_t = -215;
pub const cef_errorcode_t_ERR_CERT_KNOWN_INTERCEPTION_BLOCKED: cef_errorcode_t = -217;
pub const cef_errorcode_t_ERR_CERT_END: cef_errorcode_t = -219;
pub const cef_errorcode_t_ERR_INVALID_URL: cef_errorcode_t = -300;
pub const cef_errorcode_t_ERR_DISALLOWED_URL_SCHEME: cef_errorcode_t = -301;
pub const cef_errorcode_t_ERR_UNKNOWN_URL_SCHEME: cef_errorcode_t = -302;
pub const cef_errorcode_t_ERR_INVALID_REDIRECT: cef_errorcode_t = -303;
pub const cef_errorcode_t_ERR_TOO_MANY_REDIRECTS: cef_errorcode_t = -310;
pub const cef_errorcode_t_ERR_UNSAFE_REDIRECT: cef_errorcode_t = -311;
pub const cef_errorcode_t_ERR_UNSAFE_PORT: cef_errorcode_t = -312;
pub const cef_errorcode_t_ERR_INVALID_RESPONSE: cef_errorcode_t = -320;
pub const cef_errorcode_t_ERR_INVALID_CHUNKED_ENCODING: cef_errorcode_t = -321;
pub const cef_errorcode_t_ERR_METHOD_NOT_SUPPORTED: cef_errorcode_t = -322;
pub const cef_errorcode_t_ERR_UNEXPECTED_PROXY_AUTH: cef_errorcode_t = -323;
pub const cef_errorcode_t_ERR_EMPTY_RESPONSE: cef_errorcode_t = -324;
pub const cef_errorcode_t_ERR_RESPONSE_HEADERS_TOO_BIG: cef_errorcode_t = -325;
pub const cef_errorcode_t_ERR_PAC_SCRIPT_FAILED: cef_errorcode_t = -327;
pub const cef_errorcode_t_ERR_REQUEST_RANGE_NOT_SATISFIABLE: cef_errorcode_t = -328;
pub const cef_errorcode_t_ERR_MALFORMED_IDENTITY: cef_errorcode_t = -329;
pub const cef_errorcode_t_ERR_CONTENT_DECODING_FAILED: cef_errorcode_t = -330;
pub const cef_errorcode_t_ERR_NETWORK_IO_SUSPENDED: cef_errorcode_t = -331;
pub const cef_errorcode_t_ERR_SYN_REPLY_NOT_RECEIVED: cef_errorcode_t = -332;
pub const cef_errorcode_t_ERR_ENCODING_CONVERSION_FAILED: cef_errorcode_t = -333;
pub const cef_errorcode_t_ERR_UNRECOGNIZED_FTP_DIRECTORY_LISTING_FORMAT: cef_errorcode_t = -334;
pub const cef_errorcode_t_ERR_NO_SUPPORTED_PROXIES: cef_errorcode_t = -336;
pub const cef_errorcode_t_ERR_HTTP2_PROTOCOL_ERROR: cef_errorcode_t = -337;
pub const cef_errorcode_t_ERR_INVALID_AUTH_CREDENTIALS: cef_errorcode_t = -338;
pub const cef_errorcode_t_ERR_UNSUPPORTED_AUTH_SCHEME: cef_errorcode_t = -339;
pub const cef_errorcode_t_ERR_ENCODING_DETECTION_FAILED: cef_errorcode_t = -340;
pub const cef_errorcode_t_ERR_MISSING_AUTH_CREDENTIALS: cef_errorcode_t = -341;
pub const cef_errorcode_t_ERR_UNEXPECTED_SECURITY_LIBRARY_STATUS: cef_errorcode_t = -342;
pub const cef_errorcode_t_ERR_MISCONFIGURED_AUTH_ENVIRONMENT: cef_errorcode_t = -343;
pub const cef_errorcode_t_ERR_UNDOCUMENTED_SECURITY_LIBRARY_STATUS: cef_errorcode_t = -344;
pub const cef_errorcode_t_ERR_RESPONSE_BODY_TOO_BIG_TO_DRAIN: cef_errorcode_t = -345;
pub const cef_errorcode_t_ERR_RESPONSE_HEADERS_MULTIPLE_CONTENT_LENGTH: cef_errorcode_t = -346;
pub const cef_errorcode_t_ERR_INCOMPLETE_HTTP2_HEADERS: cef_errorcode_t = -347;
pub const cef_errorcode_t_ERR_PAC_NOT_IN_DHCP: cef_errorcode_t = -348;
pub const cef_errorcode_t_ERR_RESPONSE_HEADERS_MULTIPLE_CONTENT_DISPOSITION: cef_errorcode_t = -349;
pub const cef_errorcode_t_ERR_RESPONSE_HEADERS_MULTIPLE_LOCATION: cef_errorcode_t = -350;
pub const cef_errorcode_t_ERR_HTTP2_SERVER_REFUSED_STREAM: cef_errorcode_t = -351;
pub const cef_errorcode_t_ERR_HTTP2_PING_FAILED: cef_errorcode_t = -352;
pub const cef_errorcode_t_ERR_CONTENT_LENGTH_MISMATCH: cef_errorcode_t = -354;
pub const cef_errorcode_t_ERR_INCOMPLETE_CHUNKED_ENCODING: cef_errorcode_t = -355;
pub const cef_errorcode_t_ERR_QUIC_PROTOCOL_ERROR: cef_errorcode_t = -356;
pub const cef_errorcode_t_ERR_RESPONSE_HEADERS_TRUNCATED: cef_errorcode_t = -357;
pub const cef_errorcode_t_ERR_QUIC_HANDSHAKE_FAILED: cef_errorcode_t = -358;
pub const cef_errorcode_t_ERR_HTTP2_INADEQUATE_TRANSPORT_SECURITY: cef_errorcode_t = -360;
pub const cef_errorcode_t_ERR_HTTP2_FLOW_CONTROL_ERROR: cef_errorcode_t = -361;
pub const cef_errorcode_t_ERR_HTTP2_FRAME_SIZE_ERROR: cef_errorcode_t = -362;
pub const cef_errorcode_t_ERR_HTTP2_COMPRESSION_ERROR: cef_errorcode_t = -363;
pub const cef_errorcode_t_ERR_PROXY_AUTH_REQUESTED_WITH_NO_CONNECTION: cef_errorcode_t = -364;
pub const cef_errorcode_t_ERR_HTTP_1_1_REQUIRED: cef_errorcode_t = -365;
pub const cef_errorcode_t_ERR_PROXY_HTTP_1_1_REQUIRED: cef_errorcode_t = -366;
pub const cef_errorcode_t_ERR_PAC_SCRIPT_TERMINATED: cef_errorcode_t = -367;
pub const cef_errorcode_t_ERR_INVALID_HTTP_RESPONSE: cef_errorcode_t = -370;
pub const cef_errorcode_t_ERR_CONTENT_DECODING_INIT_FAILED: cef_errorcode_t = -371;
pub const cef_errorcode_t_ERR_HTTP2_RST_STREAM_NO_ERROR_RECEIVED: cef_errorcode_t = -372;
pub const cef_errorcode_t_ERR_HTTP2_PUSHED_STREAM_NOT_AVAILABLE: cef_errorcode_t = -373;
pub const cef_errorcode_t_ERR_HTTP2_CLAIMED_PUSHED_STREAM_RESET_BY_SERVER: cef_errorcode_t = -374;
pub const cef_errorcode_t_ERR_TOO_MANY_RETRIES: cef_errorcode_t = -375;
pub const cef_errorcode_t_ERR_HTTP2_STREAM_CLOSED: cef_errorcode_t = -376;
pub const cef_errorcode_t_ERR_HTTP2_CLIENT_REFUSED_STREAM: cef_errorcode_t = -377;
pub const cef_errorcode_t_ERR_HTTP2_PUSHED_RESPONSE_DOES_NOT_MATCH: cef_errorcode_t = -378;
pub const cef_errorcode_t_ERR_HTTP_RESPONSE_CODE_FAILURE: cef_errorcode_t = -379;
pub const cef_errorcode_t_ERR_QUIC_CERT_ROOT_NOT_KNOWN: cef_errorcode_t = -380;
pub const cef_errorcode_t_ERR_QUIC_GOAWAY_REQUEST_CAN_BE_RETRIED: cef_errorcode_t = -381;
pub const cef_errorcode_t_ERR_TOO_MANY_ACCEPT_CH_RESTARTS: cef_errorcode_t = -382;
pub const cef_errorcode_t_ERR_INCONSISTENT_IP_ADDRESS_SPACE: cef_errorcode_t = -383;
pub const cef_errorcode_t_ERR_CACHED_IP_ADDRESS_SPACE_BLOCKED_BY_LOCAL_NETWORK_ACCESS_POLICY:
    cef_errorcode_t = -384;
pub const cef_errorcode_t_ERR_CACHE_MISS: cef_errorcode_t = -400;
pub const cef_errorcode_t_ERR_CACHE_READ_FAILURE: cef_errorcode_t = -401;
pub const cef_errorcode_t_ERR_CACHE_WRITE_FAILURE: cef_errorcode_t = -402;
pub const cef_errorcode_t_ERR_CACHE_OPERATION_NOT_SUPPORTED: cef_errorcode_t = -403;
pub const cef_errorcode_t_ERR_CACHE_OPEN_FAILURE: cef_errorcode_t = -404;
pub const cef_errorcode_t_ERR_CACHE_CREATE_FAILURE: cef_errorcode_t = -405;
pub const cef_errorcode_t_ERR_CACHE_RACE: cef_errorcode_t = -406;
pub const cef_errorcode_t_ERR_CACHE_CHECKSUM_READ_FAILURE: cef_errorcode_t = -407;
pub const cef_errorcode_t_ERR_CACHE_CHECKSUM_MISMATCH: cef_errorcode_t = -408;
pub const cef_errorcode_t_ERR_CACHE_LOCK_TIMEOUT: cef_errorcode_t = -409;
pub const cef_errorcode_t_ERR_CACHE_AUTH_FAILURE_AFTER_READ: cef_errorcode_t = -410;
pub const cef_errorcode_t_ERR_CACHE_ENTRY_NOT_SUITABLE: cef_errorcode_t = -411;
pub const cef_errorcode_t_ERR_CACHE_DOOM_FAILURE: cef_errorcode_t = -412;
pub const cef_errorcode_t_ERR_CACHE_OPEN_OR_CREATE_FAILURE: cef_errorcode_t = -413;
pub const cef_errorcode_t_ERR_INSECURE_RESPONSE: cef_errorcode_t = -501;
pub const cef_errorcode_t_ERR_NO_PRIVATE_KEY_FOR_CERT: cef_errorcode_t = -502;
pub const cef_errorcode_t_ERR_ADD_USER_CERT_FAILED: cef_errorcode_t = -503;
pub const cef_errorcode_t_ERR_INVALID_SIGNED_EXCHANGE: cef_errorcode_t = -504;
pub const cef_errorcode_t_ERR_INVALID_WEB_BUNDLE: cef_errorcode_t = -505;
pub const cef_errorcode_t_ERR_TRUST_TOKEN_OPERATION_FAILED: cef_errorcode_t = -506;
pub const cef_errorcode_t_ERR_TRUST_TOKEN_OPERATION_SUCCESS_WITHOUT_SENDING_REQUEST:
    cef_errorcode_t = -507;
pub const cef_errorcode_t_ERR_FTP_FAILED: cef_errorcode_t = -601;
pub const cef_errorcode_t_ERR_FTP_SERVICE_UNAVAILABLE: cef_errorcode_t = -602;
pub const cef_errorcode_t_ERR_FTP_TRANSFER_ABORTED: cef_errorcode_t = -603;
pub const cef_errorcode_t_ERR_FTP_FILE_BUSY: cef_errorcode_t = -604;
pub const cef_errorcode_t_ERR_FTP_SYNTAX_ERROR: cef_errorcode_t = -605;
pub const cef_errorcode_t_ERR_FTP_COMMAND_NOT_SUPPORTED: cef_errorcode_t = -606;
pub const cef_errorcode_t_ERR_FTP_BAD_COMMAND_SEQUENCE: cef_errorcode_t = -607;
pub const cef_errorcode_t_ERR_PKCS12_IMPORT_BAD_PASSWORD: cef_errorcode_t = -701;
pub const cef_errorcode_t_ERR_PKCS12_IMPORT_FAILED: cef_errorcode_t = -702;
pub const cef_errorcode_t_ERR_IMPORT_CA_CERT_NOT_CA: cef_errorcode_t = -703;
pub const cef_errorcode_t_ERR_IMPORT_CERT_ALREADY_EXISTS: cef_errorcode_t = -704;
pub const cef_errorcode_t_ERR_IMPORT_CA_CERT_FAILED: cef_errorcode_t = -705;
pub const cef_errorcode_t_ERR_IMPORT_SERVER_CERT_FAILED: cef_errorcode_t = -706;
pub const cef_errorcode_t_ERR_PKCS12_IMPORT_INVALID_MAC: cef_errorcode_t = -707;
pub const cef_errorcode_t_ERR_PKCS12_IMPORT_INVALID_FILE: cef_errorcode_t = -708;
pub const cef_errorcode_t_ERR_PKCS12_IMPORT_UNSUPPORTED: cef_errorcode_t = -709;
pub const cef_errorcode_t_ERR_KEY_GENERATION_FAILED: cef_errorcode_t = -710;
pub const cef_errorcode_t_ERR_PRIVATE_KEY_EXPORT_FAILED: cef_errorcode_t = -712;
pub const cef_errorcode_t_ERR_SELF_SIGNED_CERT_GENERATION_FAILED: cef_errorcode_t = -713;
pub const cef_errorcode_t_ERR_CERT_DATABASE_CHANGED: cef_errorcode_t = -714;
pub const cef_errorcode_t_ERR_CERT_VERIFIER_CHANGED: cef_errorcode_t = -716;
pub const cef_errorcode_t_ERR_DNS_MALFORMED_RESPONSE: cef_errorcode_t = -800;
pub const cef_errorcode_t_ERR_DNS_SERVER_REQUIRES_TCP: cef_errorcode_t = -801;
pub const cef_errorcode_t_ERR_DNS_SERVER_FAILED: cef_errorcode_t = -802;
pub const cef_errorcode_t_ERR_DNS_TIMED_OUT: cef_errorcode_t = -803;
pub const cef_errorcode_t_ERR_DNS_CACHE_MISS: cef_errorcode_t = -804;
pub const cef_errorcode_t_ERR_DNS_SEARCH_EMPTY: cef_errorcode_t = -805;
pub const cef_errorcode_t_ERR_DNS_SORT_ERROR: cef_errorcode_t = -806;
pub const cef_errorcode_t_ERR_DNS_SECURE_RESOLVER_HOSTNAME_RESOLUTION_FAILED: cef_errorcode_t =
    -808;
pub const cef_errorcode_t_ERR_DNS_NAME_HTTPS_ONLY: cef_errorcode_t = -809;
pub const cef_errorcode_t_ERR_DNS_REQUEST_CANCELLED: cef_errorcode_t = -810;
pub const cef_errorcode_t_ERR_DNS_NO_MATCHING_SUPPORTED_ALPN: cef_errorcode_t = -811;
#[doc = "\n Supported error code values. For the complete list of error values see\n \"include/base/internal/cef_net_error_list.h\".\n"]
pub type cef_errorcode_t = ::std::os::raw::c_int;
pub const cef_cert_status_t_CERT_STATUS_NONE: cef_cert_status_t = 0;
pub const cef_cert_status_t_CERT_STATUS_COMMON_NAME_INVALID: cef_cert_status_t = 1;
pub const cef_cert_status_t_CERT_STATUS_DATE_INVALID: cef_cert_status_t = 2;
pub const cef_cert_status_t_CERT_STATUS_AUTHORITY_INVALID: cef_cert_status_t = 4;
pub const cef_cert_status_t_CERT_STATUS_NO_REVOCATION_MECHANISM: cef_cert_status_t = 16;
pub const cef_cert_status_t_CERT_STATUS_UNABLE_TO_CHECK_REVOCATION: cef_cert_status_t = 32;
pub const cef_cert_status_t_CERT_STATUS_REVOKED: cef_cert_status_t = 64;
pub const cef_cert_status_t_CERT_STATUS_INVALID: cef_cert_status_t = 128;
pub const cef_cert_status_t_CERT_STATUS_WEAK_SIGNATURE_ALGORITHM: cef_cert_status_t = 256;
pub const cef_cert_status_t_CERT_STATUS_NON_UNIQUE_NAME: cef_cert_status_t = 1024;
pub const cef_cert_status_t_CERT_STATUS_WEAK_KEY: cef_cert_status_t = 2048;
pub const cef_cert_status_t_CERT_STATUS_PINNED_KEY_MISSING: cef_cert_status_t = 8192;
pub const cef_cert_status_t_CERT_STATUS_NAME_CONSTRAINT_VIOLATION: cef_cert_status_t = 16384;
pub const cef_cert_status_t_CERT_STATUS_VALIDITY_TOO_LONG: cef_cert_status_t = 32768;
pub const cef_cert_status_t_CERT_STATUS_IS_EV: cef_cert_status_t = 65536;
pub const cef_cert_status_t_CERT_STATUS_REV_CHECKING_ENABLED: cef_cert_status_t = 131072;
pub const cef_cert_status_t_CERT_STATUS_SHA1_SIGNATURE_PRESENT: cef_cert_status_t = 524288;
pub const cef_cert_status_t_CERT_STATUS_CT_COMPLIANCE_FAILED: cef_cert_status_t = 1048576;
#[doc = "\n Supported certificate status code values. See net\\cert\\cert_status_flags.h\n for more information. CERT_STATUS_NONE is new in CEF because we use an\n enum while cert_status_flags.h uses a typedef and static const variables.\n"]
pub type cef_cert_status_t = ::std::os::raw::c_uint;
pub const cef_window_open_disposition_t_WOD_UNKNOWN: cef_window_open_disposition_t = 0;
#[doc = "\n Current tab. This is the default in most cases.\n"]
pub const cef_window_open_disposition_t_WOD_CURRENT_TAB: cef_window_open_disposition_t = 1;
#[doc = "\n Indicates that only one tab with the url should exist in the same window.\n"]
pub const cef_window_open_disposition_t_WOD_SINGLETON_TAB: cef_window_open_disposition_t = 2;
#[doc = "\n Shift key + Middle mouse button or meta/ctrl key while clicking.\n"]
pub const cef_window_open_disposition_t_WOD_NEW_FOREGROUND_TAB: cef_window_open_disposition_t = 3;
#[doc = "\n Middle mouse button or meta/ctrl key while clicking.\n"]
pub const cef_window_open_disposition_t_WOD_NEW_BACKGROUND_TAB: cef_window_open_disposition_t = 4;
#[doc = "\n New popup window.\n"]
pub const cef_window_open_disposition_t_WOD_NEW_POPUP: cef_window_open_disposition_t = 5;
#[doc = "\n Shift key while clicking.\n"]
pub const cef_window_open_disposition_t_WOD_NEW_WINDOW: cef_window_open_disposition_t = 6;
#[doc = "\n Alt key while clicking.\n"]
pub const cef_window_open_disposition_t_WOD_SAVE_TO_DISK: cef_window_open_disposition_t = 7;
#[doc = "\n New off-the-record (incognito) window.\n"]
pub const cef_window_open_disposition_t_WOD_OFF_THE_RECORD: cef_window_open_disposition_t = 8;
#[doc = "\n Special case error condition from the renderer.\n"]
pub const cef_window_open_disposition_t_WOD_IGNORE_ACTION: cef_window_open_disposition_t = 9;
#[doc = "\n Activates an existing tab containing the url, rather than navigating.\n This is similar to SINGLETON_TAB, but searches across all windows from\n the current profile and anonymity (instead of just the current one);\n closes the current tab on switching if the current tab was the NTP with\n no session history; and behaves like CURRENT_TAB instead of\n NEW_FOREGROUND_TAB when no existing tab is found.\n"]
pub const cef_window_open_disposition_t_WOD_SWITCH_TO_TAB: cef_window_open_disposition_t = 10;
#[doc = "\n Creates a new document picture-in-picture window showing a child WebView.\n"]
pub const cef_window_open_disposition_t_WOD_NEW_PICTURE_IN_PICTURE: cef_window_open_disposition_t =
    11;
#[doc = "\n The manner in which a link click should be opened. These constants match\n their equivalents in Chromium's window_open_disposition.h and should not be\n renumbered.\n"]
pub type cef_window_open_disposition_t = ::std::os::raw::c_uint;
pub const cef_drag_operations_mask_t_DRAG_OPERATION_NONE: cef_drag_operations_mask_t = 0;
pub const cef_drag_operations_mask_t_DRAG_OPERATION_COPY: cef_drag_operations_mask_t = 1;
pub const cef_drag_operations_mask_t_DRAG_OPERATION_LINK: cef_drag_operations_mask_t = 2;
pub const cef_drag_operations_mask_t_DRAG_OPERATION_GENERIC: cef_drag_operations_mask_t = 4;
pub const cef_drag_operations_mask_t_DRAG_OPERATION_PRIVATE: cef_drag_operations_mask_t = 8;
pub const cef_drag_operations_mask_t_DRAG_OPERATION_MOVE: cef_drag_operations_mask_t = 16;
pub const cef_drag_operations_mask_t_DRAG_OPERATION_DELETE: cef_drag_operations_mask_t = 32;
pub const cef_drag_operations_mask_t_DRAG_OPERATION_EVERY: cef_drag_operations_mask_t = 4294967295;
#[doc = "\n \"Verb\" of a drag-and-drop operation as negotiated between the source and\n destination. These constants match their equivalents in WebCore's\n DragActions.h and should not be renumbered.\n"]
pub type cef_drag_operations_mask_t = ::std::os::raw::c_uint;
pub const cef_text_input_mode_t_CEF_TEXT_INPUT_MODE_DEFAULT: cef_text_input_mode_t = 0;
pub const cef_text_input_mode_t_CEF_TEXT_INPUT_MODE_NONE: cef_text_input_mode_t = 1;
pub const cef_text_input_mode_t_CEF_TEXT_INPUT_MODE_TEXT: cef_text_input_mode_t = 2;
pub const cef_text_input_mode_t_CEF_TEXT_INPUT_MODE_TEL: cef_text_input_mode_t = 3;
pub const cef_text_input_mode_t_CEF_TEXT_INPUT_MODE_URL: cef_text_input_mode_t = 4;
pub const cef_text_input_mode_t_CEF_TEXT_INPUT_MODE_EMAIL: cef_text_input_mode_t = 5;
pub const cef_text_input_mode_t_CEF_TEXT_INPUT_MODE_NUMERIC: cef_text_input_mode_t = 6;
pub const cef_text_input_mode_t_CEF_TEXT_INPUT_MODE_DECIMAL: cef_text_input_mode_t = 7;
pub const cef_text_input_mode_t_CEF_TEXT_INPUT_MODE_SEARCH: cef_text_input_mode_t = 8;
pub const cef_text_input_mode_t_CEF_TEXT_INPUT_MODE_MAX: cef_text_input_mode_t = 8;
#[doc = "\n Input mode of a virtual keyboard. These constants match their equivalents\n in Chromium's text_input_mode.h and should not be renumbered.\n See https://html.spec.whatwg.org/#input-modalities:-the-inputmode-attribute\n"]
pub type cef_text_input_mode_t = ::std::os::raw::c_uint;
pub const cef_v8_accesscontrol_t_V8_ACCESS_CONTROL_DEFAULT: cef_v8_accesscontrol_t = 0;
pub const cef_v8_accesscontrol_t_V8_ACCESS_CONTROL_ALL_CAN_READ: cef_v8_accesscontrol_t = 1;
pub const cef_v8_accesscontrol_t_V8_ACCESS_CONTROL_ALL_CAN_WRITE: cef_v8_accesscontrol_t = 2;
pub const cef_v8_accesscontrol_t_V8_ACCESS_CONTROL_PROHIBITS_OVERWRITING: cef_v8_accesscontrol_t =
    4;
#[doc = "\n V8 access control values.\n"]
pub type cef_v8_accesscontrol_t = ::std::os::raw::c_uint;
#[doc = "\n Writeable, Enumerable, Configurable\n"]
pub const cef_v8_propertyattribute_t_V8_PROPERTY_ATTRIBUTE_NONE: cef_v8_propertyattribute_t = 0;
#[doc = "\n Not writeable\n"]
pub const cef_v8_propertyattribute_t_V8_PROPERTY_ATTRIBUTE_READONLY: cef_v8_propertyattribute_t = 1;
#[doc = "\n Not enumerable\n"]
pub const cef_v8_propertyattribute_t_V8_PROPERTY_ATTRIBUTE_DONTENUM: cef_v8_propertyattribute_t = 2;
#[doc = "\n Not configurable\n"]
pub const cef_v8_propertyattribute_t_V8_PROPERTY_ATTRIBUTE_DONTDELETE: cef_v8_propertyattribute_t =
    4;
#[doc = "\n V8 property attribute values.\n"]
pub type cef_v8_propertyattribute_t = ::std::os::raw::c_uint;
pub const cef_postdataelement_type_t_PDE_TYPE_EMPTY: cef_postdataelement_type_t = 0;
pub const cef_postdataelement_type_t_PDE_TYPE_BYTES: cef_postdataelement_type_t = 1;
pub const cef_postdataelement_type_t_PDE_TYPE_FILE: cef_postdataelement_type_t = 2;
#[doc = "\n Post data elements may represent either bytes or files.\n"]
pub type cef_postdataelement_type_t = ::std::os::raw::c_uint;
#[doc = "\n Top level page.\n"]
pub const cef_resource_type_t_RT_MAIN_FRAME: cef_resource_type_t = 0;
#[doc = "\n Frame or iframe.\n"]
pub const cef_resource_type_t_RT_SUB_FRAME: cef_resource_type_t = 1;
#[doc = "\n CSS stylesheet.\n"]
pub const cef_resource_type_t_RT_STYLESHEET: cef_resource_type_t = 2;
#[doc = "\n External script.\n"]
pub const cef_resource_type_t_RT_SCRIPT: cef_resource_type_t = 3;
#[doc = "\n Image (jpg/gif/png/etc).\n"]
pub const cef_resource_type_t_RT_IMAGE: cef_resource_type_t = 4;
#[doc = "\n Font.\n"]
pub const cef_resource_type_t_RT_FONT_RESOURCE: cef_resource_type_t = 5;
#[doc = "\n Some other subresource. This is the default type if the actual type is\n unknown.\n"]
pub const cef_resource_type_t_RT_SUB_RESOURCE: cef_resource_type_t = 6;
#[doc = "\n Object (or embed) tag for a plugin, or a resource that a plugin requested.\n"]
pub const cef_resource_type_t_RT_OBJECT: cef_resource_type_t = 7;
#[doc = "\n Media resource.\n"]
pub const cef_resource_type_t_RT_MEDIA: cef_resource_type_t = 8;
#[doc = "\n Main resource of a dedicated worker.\n"]
pub const cef_resource_type_t_RT_WORKER: cef_resource_type_t = 9;
#[doc = "\n Main resource of a shared worker.\n"]
pub const cef_resource_type_t_RT_SHARED_WORKER: cef_resource_type_t = 10;
#[doc = "\n Explicitly requested prefetch.\n"]
pub const cef_resource_type_t_RT_PREFETCH: cef_resource_type_t = 11;
#[doc = "\n Favicon.\n"]
pub const cef_resource_type_t_RT_FAVICON: cef_resource_type_t = 12;
#[doc = "\n XMLHttpRequest.\n"]
pub const cef_resource_type_t_RT_XHR: cef_resource_type_t = 13;
#[doc = "\n A request for a \"<ping>\".\n"]
pub const cef_resource_type_t_RT_PING: cef_resource_type_t = 14;
#[doc = "\n Main resource of a service worker.\n"]
pub const cef_resource_type_t_RT_SERVICE_WORKER: cef_resource_type_t = 15;
#[doc = "\n A report of Content Security Policy violations.\n"]
pub const cef_resource_type_t_RT_CSP_REPORT: cef_resource_type_t = 16;
#[doc = "\n A resource that a plugin requested.\n"]
pub const cef_resource_type_t_RT_PLUGIN_RESOURCE: cef_resource_type_t = 17;
#[doc = "\n A main-frame service worker navigation preload request.\n"]
pub const cef_resource_type_t_RT_NAVIGATION_PRELOAD_MAIN_FRAME: cef_resource_type_t = 19;
#[doc = "\n A sub-frame service worker navigation preload request.\n"]
pub const cef_resource_type_t_RT_NAVIGATION_PRELOAD_SUB_FRAME: cef_resource_type_t = 20;
#[doc = "\n Resource type for a request. These constants match their equivalents in\n Chromium's ResourceType and should not be renumbered.\n"]
pub type cef_resource_type_t = ::std::os::raw::c_uint;
#[doc = "\n Source is a link click or the JavaScript window.open function. This is\n also the default value for requests like sub-resource loads that are not\n navigations.\n"]
pub const cef_transition_type_t_TT_LINK: cef_transition_type_t = 0;
#[doc = "\n Source is some other \"explicit\" navigation. This is the default value for\n navigations where the actual type is unknown. See also\n TT_DIRECT_LOAD_FLAG.\n"]
pub const cef_transition_type_t_TT_EXPLICIT: cef_transition_type_t = 1;
#[doc = "\n User got to this page through a suggestion in the UI (for example, via the\n destinations page). Chrome runtime only.\n"]
pub const cef_transition_type_t_TT_AUTO_BOOKMARK: cef_transition_type_t = 2;
#[doc = "\n Source is a subframe navigation. This is any content that is automatically\n loaded in a non-toplevel frame. For example, if a page consists of several\n frames containing ads, those ad URLs will have this transition type.\n The user may not even realize the content in these pages is a separate\n frame, so may not care about the URL.\n"]
pub const cef_transition_type_t_TT_AUTO_SUBFRAME: cef_transition_type_t = 3;
#[doc = "\n Source is a subframe navigation explicitly requested by the user that will\n generate new navigation entries in the back/forward list. These are\n probably more important than frames that were automatically loaded in\n the background because the user probably cares about the fact that this\n link was loaded.\n"]
pub const cef_transition_type_t_TT_MANUAL_SUBFRAME: cef_transition_type_t = 4;
#[doc = "\n User got to this page by typing in the URL bar and selecting an entry\n that did not look like a URL.  For example, a match might have the URL\n of a Google search result page, but appear like \"Search Google for ...\".\n These are not quite the same as EXPLICIT navigations because the user\n didn't type or see the destination URL. Chrome runtime only.\n See also TT_KEYWORD.\n"]
pub const cef_transition_type_t_TT_GENERATED: cef_transition_type_t = 5;
#[doc = "\n This is a toplevel navigation. This is any content that is automatically\n loaded in a toplevel frame.  For example, opening a tab to show the ASH\n screen saver, opening the devtools window, opening the NTP after the safe\n browsing warning, opening web-based dialog boxes are examples of\n AUTO_TOPLEVEL navigations. Chrome runtime only.\n"]
pub const cef_transition_type_t_TT_AUTO_TOPLEVEL: cef_transition_type_t = 6;
#[doc = "\n Source is a form submission by the user. NOTE: In some situations\n submitting a form does not result in this transition type. This can happen\n if the form uses a script to submit the contents.\n"]
pub const cef_transition_type_t_TT_FORM_SUBMIT: cef_transition_type_t = 7;
#[doc = "\n Source is a \"reload\" of the page via the Reload function or by re-visiting\n the same URL. NOTE: This is distinct from the concept of whether a\n particular load uses \"reload semantics\" (i.e. bypasses cached data).\n"]
pub const cef_transition_type_t_TT_RELOAD: cef_transition_type_t = 8;
#[doc = "\n The url was generated from a replaceable keyword other than the default\n search provider. If the user types a keyword (which also applies to\n tab-to-search) in the omnibox this qualifier is applied to the transition\n type of the generated url. TemplateURLModel then may generate an\n additional visit with a transition type of TT_KEYWORD_GENERATED against\n the url 'http://' + keyword. For example, if you do a tab-to-search\n against wikipedia the generated url has a transition qualifer of\n TT_KEYWORD, and TemplateURLModel generates a visit for 'wikipedia.org'\n with a transition type of TT_KEYWORD_GENERATED. Chrome runtime only.\n"]
pub const cef_transition_type_t_TT_KEYWORD: cef_transition_type_t = 9;
#[doc = "\n Corresponds to a visit generated for a keyword. See description of\n TT_KEYWORD for more details. Chrome runtime only.\n"]
pub const cef_transition_type_t_TT_KEYWORD_GENERATED: cef_transition_type_t = 10;
#[doc = "\n General mask defining the bits used for the source values.\n"]
pub const cef_transition_type_t_TT_SOURCE_MASK: cef_transition_type_t = 255;
#[doc = "\n Attempted to visit a URL but was blocked.\n"]
pub const cef_transition_type_t_TT_BLOCKED_FLAG: cef_transition_type_t = 8388608;
#[doc = "\n Used the Forward or Back function to navigate among browsing history.\n Will be ORed to the transition type for the original load.\n"]
pub const cef_transition_type_t_TT_FORWARD_BACK_FLAG: cef_transition_type_t = 16777216;
#[doc = "\n Loaded a URL directly via CreateBrowser, LoadURL or LoadRequest.\n"]
pub const cef_transition_type_t_TT_DIRECT_LOAD_FLAG: cef_transition_type_t = 33554432;
#[doc = "\n User is navigating to the home page. Chrome runtime only.\n"]
pub const cef_transition_type_t_TT_HOME_PAGE_FLAG: cef_transition_type_t = 67108864;
#[doc = "\n The transition originated from an external application; the exact\n definition of this is embedder dependent. Chrome runtime and\n extension system only.\n"]
pub const cef_transition_type_t_TT_FROM_API_FLAG: cef_transition_type_t = 134217728;
#[doc = "\n The beginning of a navigation chain.\n"]
pub const cef_transition_type_t_TT_CHAIN_START_FLAG: cef_transition_type_t = 268435456;
#[doc = "\n The last transition in a redirect chain.\n"]
pub const cef_transition_type_t_TT_CHAIN_END_FLAG: cef_transition_type_t = 536870912;
#[doc = "\n Redirects caused by JavaScript or a meta refresh tag on the page.\n"]
pub const cef_transition_type_t_TT_CLIENT_REDIRECT_FLAG: cef_transition_type_t = 1073741824;
#[doc = "\n Redirects sent from the server by HTTP headers.\n"]
pub const cef_transition_type_t_TT_SERVER_REDIRECT_FLAG: cef_transition_type_t = 2147483648;
#[doc = "\n Used to test whether a transition involves a redirect.\n"]
pub const cef_transition_type_t_TT_IS_REDIRECT_MASK: cef_transition_type_t = 3221225472;
#[doc = "\n General mask defining the bits used for the qualifiers.\n"]
pub const cef_transition_type_t_TT_QUALIFIER_MASK: cef_transition_type_t = 4294967040;
#[doc = "\n Transition type for a request. Made up of one source value and 0 or more\n qualifiers.\n"]
pub type cef_transition_type_t = ::std::os::raw::c_uint;
#[doc = "\n Default behavior.\n"]
pub const cef_urlrequest_flags_t_UR_FLAG_NONE: cef_urlrequest_flags_t = 0;
#[doc = "\n If set the cache will be skipped when handling the request. Setting this\n value is equivalent to specifying the \"Cache-Control: no-cache\" request\n header. Setting this value in combination with UR_FLAG_ONLY_FROM_CACHE\n will cause the request to fail.\n"]
pub const cef_urlrequest_flags_t_UR_FLAG_SKIP_CACHE: cef_urlrequest_flags_t = 1;
#[doc = "\n If set the request will fail if it cannot be served from the cache (or\n some equivalent local store). Setting this value is equivalent to\n specifying the \"Cache-Control: only-if-cached\" request header. Setting\n this value in combination with UR_FLAG_SKIP_CACHE or UR_FLAG_DISABLE_CACHE\n will cause the request to fail.\n"]
pub const cef_urlrequest_flags_t_UR_FLAG_ONLY_FROM_CACHE: cef_urlrequest_flags_t = 2;
#[doc = "\n If set the cache will not be used at all. Setting this value is equivalent\n to specifying the \"Cache-Control: no-store\" request header. Setting this\n value in combination with UR_FLAG_ONLY_FROM_CACHE will cause the request\n to fail.\n"]
pub const cef_urlrequest_flags_t_UR_FLAG_DISABLE_CACHE: cef_urlrequest_flags_t = 4;
#[doc = "\n If set user name, password, and cookies may be sent with the request, and\n cookies may be saved from the response.\n"]
pub const cef_urlrequest_flags_t_UR_FLAG_ALLOW_STORED_CREDENTIALS: cef_urlrequest_flags_t = 8;
#[doc = "\n If set upload progress events will be generated when a request has a body.\n"]
pub const cef_urlrequest_flags_t_UR_FLAG_REPORT_UPLOAD_PROGRESS: cef_urlrequest_flags_t = 16;
#[doc = "\n If set the CefURLRequestClient::OnDownloadData method will not be called.\n"]
pub const cef_urlrequest_flags_t_UR_FLAG_NO_DOWNLOAD_DATA: cef_urlrequest_flags_t = 32;
#[doc = "\n If set 5XX redirect errors will be propagated to the observer instead of\n automatically re-tried. This currently only applies for requests\n originated in the browser process.\n"]
pub const cef_urlrequest_flags_t_UR_FLAG_NO_RETRY_ON_5XX: cef_urlrequest_flags_t = 64;
#[doc = "\n If set 3XX responses will cause the fetch to halt immediately rather than\n continue through the redirect.\n"]
pub const cef_urlrequest_flags_t_UR_FLAG_STOP_ON_REDIRECT: cef_urlrequest_flags_t = 128;
#[doc = "\n Flags used to customize the behavior of CefURLRequest.\n"]
pub type cef_urlrequest_flags_t = ::std::os::raw::c_uint;
#[doc = "\n Unknown status.\n"]
pub const cef_urlrequest_status_t_UR_UNKNOWN: cef_urlrequest_status_t = 0;
#[doc = "\n Request succeeded.\n"]
pub const cef_urlrequest_status_t_UR_SUCCESS: cef_urlrequest_status_t = 1;
#[doc = "\n An IO request is pending, and the caller will be informed when it is\n completed.\n"]
pub const cef_urlrequest_status_t_UR_IO_PENDING: cef_urlrequest_status_t = 2;
#[doc = "\n Request was canceled programatically.\n"]
pub const cef_urlrequest_status_t_UR_CANCELED: cef_urlrequest_status_t = 3;
#[doc = "\n Request failed for some reason.\n"]
pub const cef_urlrequest_status_t_UR_FAILED: cef_urlrequest_status_t = 4;
#[doc = "\n Flags that represent CefURLRequest status.\n"]
pub type cef_urlrequest_status_t = ::std::os::raw::c_uint;
#[doc = " Structure representing a draggable region.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_draggable_region_t {
    #[doc = "\n Bounds of the region.\n"]
    pub bounds: cef_rect_t,
    #[doc = "\n True (1) this this region is draggable and false (0) otherwise.\n"]
    pub draggable: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_draggable_region_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_draggable_region_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_draggable_region_t>(),
        20usize,
        concat!("Size of: ", stringify!(_cef_draggable_region_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_draggable_region_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_draggable_region_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bounds) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_draggable_region_t),
            "::",
            stringify!(bounds)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).draggable) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_draggable_region_t),
            "::",
            stringify!(draggable)
        )
    );
}
#[doc = " Structure representing a draggable region.\n"]
pub type cef_draggable_region_t = _cef_draggable_region_t;
#[doc = "\n Browser process.\n"]
pub const cef_process_id_t_PID_BROWSER: cef_process_id_t = 0;
#[doc = "\n Renderer process.\n"]
pub const cef_process_id_t_PID_RENDERER: cef_process_id_t = 1;
#[doc = "\n Existing process IDs.\n"]
pub type cef_process_id_t = ::std::os::raw::c_uint;
#[doc = "\n The main thread in the browser. This will be the same as the main\n application thread if CefInitialize() is called with a\n CefSettings.multi_threaded_message_loop value of false. Do not perform\n blocking tasks on this thread. All tasks posted after\n CefBrowserProcessHandler::OnContextInitialized() and before CefShutdown()\n are guaranteed to run. This thread will outlive all other CEF threads.\n"]
pub const cef_thread_id_t_TID_UI: cef_thread_id_t = 0;
#[doc = "\n Used for blocking tasks like file system access where the user won't\n notice if the task takes an arbitrarily long time to complete. All tasks\n posted after CefBrowserProcessHandler::OnContextInitialized() and before\n CefShutdown() are guaranteed to run.\n"]
pub const cef_thread_id_t_TID_FILE_BACKGROUND: cef_thread_id_t = 1;
#[doc = "\n Used for blocking tasks like file system access that affect UI or\n responsiveness of future user interactions. Do not use if an immediate\n response to a user interaction is expected. All tasks posted after\n CefBrowserProcessHandler::OnContextInitialized() and before CefShutdown()\n are guaranteed to run.\n Examples:\n - Updating the UI to reflect progress on a long task.\n - Loading data that might be shown in the UI after a future user\n   interaction.\n"]
pub const cef_thread_id_t_TID_FILE_USER_VISIBLE: cef_thread_id_t = 2;
#[doc = "\n Used for blocking tasks like file system access that affect UI\n immediately after a user interaction. All tasks posted after\n CefBrowserProcessHandler::OnContextInitialized() and before CefShutdown()\n are guaranteed to run.\n Example: Generating data shown in the UI immediately after a click.\n"]
pub const cef_thread_id_t_TID_FILE_USER_BLOCKING: cef_thread_id_t = 3;
#[doc = "\n Used to launch and terminate browser processes.\n"]
pub const cef_thread_id_t_TID_PROCESS_LAUNCHER: cef_thread_id_t = 4;
#[doc = "\n Used to process IPC and network messages. Do not perform blocking tasks on\n this thread. All tasks posted after\n CefBrowserProcessHandler::OnContextInitialized() and before CefShutdown()\n are guaranteed to run.\n"]
pub const cef_thread_id_t_TID_IO: cef_thread_id_t = 5;
#[doc = "\n The main thread in the renderer. Used for all WebKit and V8 interaction.\n Tasks may be posted to this thread after\n CefRenderProcessHandler::OnWebKitInitialized but are not guaranteed to\n run before sub-process termination (sub-processes may be killed at any\n time without warning).\n"]
pub const cef_thread_id_t_TID_RENDERER: cef_thread_id_t = 6;
#[doc = "\n Existing thread IDs.\n"]
pub type cef_thread_id_t = ::std::os::raw::c_uint;
#[doc = "\n Suitable for threads that shouldn't disrupt high priority work.\n"]
pub const cef_thread_priority_t_TP_BACKGROUND: cef_thread_priority_t = 0;
#[doc = "\n Default priority level.\n"]
pub const cef_thread_priority_t_TP_NORMAL: cef_thread_priority_t = 1;
#[doc = "\n Suitable for threads which generate data for the display (at ~60Hz).\n"]
pub const cef_thread_priority_t_TP_DISPLAY: cef_thread_priority_t = 2;
#[doc = "\n Suitable for low-latency, glitch-resistant audio.\n"]
pub const cef_thread_priority_t_TP_REALTIME_AUDIO: cef_thread_priority_t = 3;
#[doc = "\n Thread priority values listed in increasing order of importance.\n"]
pub type cef_thread_priority_t = ::std::os::raw::c_uint;
#[doc = "\n Supports tasks and timers.\n"]
pub const cef_message_loop_type_t_ML_TYPE_DEFAULT: cef_message_loop_type_t = 0;
#[doc = "\n Supports tasks, timers and native UI events (e.g. Windows messages).\n"]
pub const cef_message_loop_type_t_ML_TYPE_UI: cef_message_loop_type_t = 1;
#[doc = "\n Supports tasks, timers and asynchronous IO events.\n"]
pub const cef_message_loop_type_t_ML_TYPE_IO: cef_message_loop_type_t = 2;
#[doc = "\n Message loop types. Indicates the set of asynchronous events that a message\n loop can process.\n"]
pub type cef_message_loop_type_t = ::std::os::raw::c_uint;
#[doc = "\n No COM initialization.\n"]
pub const cef_com_init_mode_t_COM_INIT_MODE_NONE: cef_com_init_mode_t = 0;
#[doc = "\n Initialize COM using single-threaded apartments.\n"]
pub const cef_com_init_mode_t_COM_INIT_MODE_STA: cef_com_init_mode_t = 1;
#[doc = "\n Initialize COM using multi-threaded apartments.\n"]
pub const cef_com_init_mode_t_COM_INIT_MODE_MTA: cef_com_init_mode_t = 2;
#[doc = "\n Windows COM initialization mode. Specifies how COM will be initialized for a\n new thread.\n"]
pub type cef_com_init_mode_t = ::std::os::raw::c_uint;
pub const cef_value_type_t_VTYPE_INVALID: cef_value_type_t = 0;
pub const cef_value_type_t_VTYPE_NULL: cef_value_type_t = 1;
pub const cef_value_type_t_VTYPE_BOOL: cef_value_type_t = 2;
pub const cef_value_type_t_VTYPE_INT: cef_value_type_t = 3;
pub const cef_value_type_t_VTYPE_DOUBLE: cef_value_type_t = 4;
pub const cef_value_type_t_VTYPE_STRING: cef_value_type_t = 5;
pub const cef_value_type_t_VTYPE_BINARY: cef_value_type_t = 6;
pub const cef_value_type_t_VTYPE_DICTIONARY: cef_value_type_t = 7;
pub const cef_value_type_t_VTYPE_LIST: cef_value_type_t = 8;
#[doc = "\n Supported value types.\n"]
pub type cef_value_type_t = ::std::os::raw::c_uint;
pub const cef_jsdialog_type_t_JSDIALOGTYPE_ALERT: cef_jsdialog_type_t = 0;
pub const cef_jsdialog_type_t_JSDIALOGTYPE_CONFIRM: cef_jsdialog_type_t = 1;
pub const cef_jsdialog_type_t_JSDIALOGTYPE_PROMPT: cef_jsdialog_type_t = 2;
#[doc = "\n Supported JavaScript dialog types.\n"]
pub type cef_jsdialog_type_t = ::std::os::raw::c_uint;
#[doc = "\n Screen information used when window rendering is disabled. This structure is\n passed as a parameter to CefRenderHandler::GetScreenInfo and should be\n filled in by the client.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_screen_info_t {
    #[doc = "\n Device scale factor. Specifies the ratio between physical and logical\n pixels.\n"]
    pub device_scale_factor: f32,
    #[doc = "\n The screen depth in bits per pixel.\n"]
    pub depth: ::std::os::raw::c_int,
    #[doc = "\n The bits per color component. This assumes that the colors are balanced\n equally.\n"]
    pub depth_per_component: ::std::os::raw::c_int,
    #[doc = "\n This can be true for black and white printers.\n"]
    pub is_monochrome: ::std::os::raw::c_int,
    #[doc = " The |rect| and |available_rect| properties are used to determine the\n available surface for rendering popup views.\n"]
    pub rect: cef_rect_t,
    #[doc = " The |rect| and |available_rect| properties are used to determine the\n available surface for rendering popup views.\n"]
    pub available_rect: cef_rect_t,
}
#[test]
fn bindgen_test_layout__cef_screen_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_screen_info_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_screen_info_t>(),
        48usize,
        concat!("Size of: ", stringify!(_cef_screen_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_screen_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_screen_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device_scale_factor) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(device_scale_factor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depth_per_component) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(depth_per_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_monochrome) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(is_monochrome)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rect) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(rect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).available_rect) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_screen_info_t),
            "::",
            stringify!(available_rect)
        )
    );
}
#[doc = "\n Screen information used when window rendering is disabled. This structure is\n passed as a parameter to CefRenderHandler::GetScreenInfo and should be\n filled in by the client.\n"]
pub type cef_screen_info_t = _cef_screen_info_t;
pub const cef_menu_id_t_MENU_ID_BACK: cef_menu_id_t = 100;
pub const cef_menu_id_t_MENU_ID_FORWARD: cef_menu_id_t = 101;
pub const cef_menu_id_t_MENU_ID_RELOAD: cef_menu_id_t = 102;
pub const cef_menu_id_t_MENU_ID_RELOAD_NOCACHE: cef_menu_id_t = 103;
pub const cef_menu_id_t_MENU_ID_STOPLOAD: cef_menu_id_t = 104;
pub const cef_menu_id_t_MENU_ID_UNDO: cef_menu_id_t = 110;
pub const cef_menu_id_t_MENU_ID_REDO: cef_menu_id_t = 111;
pub const cef_menu_id_t_MENU_ID_CUT: cef_menu_id_t = 112;
pub const cef_menu_id_t_MENU_ID_COPY: cef_menu_id_t = 113;
pub const cef_menu_id_t_MENU_ID_PASTE: cef_menu_id_t = 114;
pub const cef_menu_id_t_MENU_ID_DELETE: cef_menu_id_t = 115;
pub const cef_menu_id_t_MENU_ID_SELECT_ALL: cef_menu_id_t = 116;
pub const cef_menu_id_t_MENU_ID_FIND: cef_menu_id_t = 130;
pub const cef_menu_id_t_MENU_ID_PRINT: cef_menu_id_t = 131;
pub const cef_menu_id_t_MENU_ID_VIEW_SOURCE: cef_menu_id_t = 132;
pub const cef_menu_id_t_MENU_ID_SPELLCHECK_SUGGESTION_0: cef_menu_id_t = 200;
pub const cef_menu_id_t_MENU_ID_SPELLCHECK_SUGGESTION_1: cef_menu_id_t = 201;
pub const cef_menu_id_t_MENU_ID_SPELLCHECK_SUGGESTION_2: cef_menu_id_t = 202;
pub const cef_menu_id_t_MENU_ID_SPELLCHECK_SUGGESTION_3: cef_menu_id_t = 203;
pub const cef_menu_id_t_MENU_ID_SPELLCHECK_SUGGESTION_4: cef_menu_id_t = 204;
pub const cef_menu_id_t_MENU_ID_SPELLCHECK_SUGGESTION_LAST: cef_menu_id_t = 204;
pub const cef_menu_id_t_MENU_ID_NO_SPELLING_SUGGESTIONS: cef_menu_id_t = 205;
pub const cef_menu_id_t_MENU_ID_ADD_TO_DICTIONARY: cef_menu_id_t = 206;
pub const cef_menu_id_t_MENU_ID_CUSTOM_FIRST: cef_menu_id_t = 220;
pub const cef_menu_id_t_MENU_ID_CUSTOM_LAST: cef_menu_id_t = 250;
pub const cef_menu_id_t_MENU_ID_USER_FIRST: cef_menu_id_t = 26500;
pub const cef_menu_id_t_MENU_ID_USER_LAST: cef_menu_id_t = 28500;
#[doc = "\n Supported menu IDs. Non-English translations can be provided for the\n IDS_MENU_* strings in CefResourceBundleHandler::GetLocalizedString().\n"]
pub type cef_menu_id_t = ::std::os::raw::c_uint;
pub const cef_mouse_button_type_t_MBT_LEFT: cef_mouse_button_type_t = 0;
pub const cef_mouse_button_type_t_MBT_MIDDLE: cef_mouse_button_type_t = 1;
pub const cef_mouse_button_type_t_MBT_RIGHT: cef_mouse_button_type_t = 2;
#[doc = "\n Mouse button types.\n"]
pub type cef_mouse_button_type_t = ::std::os::raw::c_uint;
#[doc = "\n Structure representing mouse event information.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_mouse_event_t {
    #[doc = "\n X coordinate relative to the left side of the view.\n"]
    pub x: ::std::os::raw::c_int,
    #[doc = "\n Y coordinate relative to the top side of the view.\n"]
    pub y: ::std::os::raw::c_int,
    #[doc = "\n Bit flags describing any pressed modifier keys. See\n cef_event_flags_t for values.\n"]
    pub modifiers: u32,
}
#[test]
fn bindgen_test_layout__cef_mouse_event_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_mouse_event_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_mouse_event_t>(),
        12usize,
        concat!("Size of: ", stringify!(_cef_mouse_event_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_mouse_event_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_mouse_event_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_mouse_event_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_mouse_event_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modifiers) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_mouse_event_t),
            "::",
            stringify!(modifiers)
        )
    );
}
#[doc = "\n Structure representing mouse event information.\n"]
pub type cef_mouse_event_t = _cef_mouse_event_t;
pub const cef_touch_event_type_t_CEF_TET_RELEASED: cef_touch_event_type_t = 0;
pub const cef_touch_event_type_t_CEF_TET_PRESSED: cef_touch_event_type_t = 1;
pub const cef_touch_event_type_t_CEF_TET_MOVED: cef_touch_event_type_t = 2;
pub const cef_touch_event_type_t_CEF_TET_CANCELLED: cef_touch_event_type_t = 3;
#[doc = "\n Touch points states types.\n"]
pub type cef_touch_event_type_t = ::std::os::raw::c_uint;
pub const cef_pointer_type_t_CEF_POINTER_TYPE_TOUCH: cef_pointer_type_t = 0;
pub const cef_pointer_type_t_CEF_POINTER_TYPE_MOUSE: cef_pointer_type_t = 1;
pub const cef_pointer_type_t_CEF_POINTER_TYPE_PEN: cef_pointer_type_t = 2;
pub const cef_pointer_type_t_CEF_POINTER_TYPE_ERASER: cef_pointer_type_t = 3;
pub const cef_pointer_type_t_CEF_POINTER_TYPE_UNKNOWN: cef_pointer_type_t = 4;
#[doc = "\n The device type that caused the event.\n"]
pub type cef_pointer_type_t = ::std::os::raw::c_uint;
#[doc = "\n Structure representing touch event information.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_touch_event_t {
    #[doc = "\n Id of a touch point. Must be unique per touch, can be any number except\n -1. Note that a maximum of 16 concurrent touches will be tracked; touches\n beyond that will be ignored.\n"]
    pub id: ::std::os::raw::c_int,
    #[doc = "\n X coordinate relative to the left side of the view.\n"]
    pub x: f32,
    #[doc = "\n Y coordinate relative to the top side of the view.\n"]
    pub y: f32,
    #[doc = "\n X radius in pixels. Set to 0 if not applicable.\n"]
    pub radius_x: f32,
    #[doc = "\n Y radius in pixels. Set to 0 if not applicable.\n"]
    pub radius_y: f32,
    #[doc = "\n Rotation angle in radians. Set to 0 if not applicable.\n"]
    pub rotation_angle: f32,
    #[doc = "\n The normalized pressure of the pointer input in the range of [0,1].\n Set to 0 if not applicable.\n"]
    pub pressure: f32,
    #[doc = "\n The state of the touch point. Touches begin with one CEF_TET_PRESSED event\n followed by zero or more CEF_TET_MOVED events and finally one\n CEF_TET_RELEASED or CEF_TET_CANCELLED event. Events not respecting this\n order will be ignored.\n"]
    pub type_: cef_touch_event_type_t,
    #[doc = "\n Bit flags describing any pressed modifier keys. See\n cef_event_flags_t for values.\n"]
    pub modifiers: u32,
    #[doc = "\n The device type that caused the event.\n"]
    pub pointer_type: cef_pointer_type_t,
}
#[test]
fn bindgen_test_layout__cef_touch_event_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_touch_event_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_touch_event_t>(),
        40usize,
        concat!("Size of: ", stringify!(_cef_touch_event_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_touch_event_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_touch_event_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).radius_x) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(radius_x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).radius_y) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(radius_y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotation_angle) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(rotation_angle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pressure) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(pressure)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modifiers) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(modifiers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pointer_type) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_event_t),
            "::",
            stringify!(pointer_type)
        )
    );
}
#[doc = "\n Structure representing touch event information.\n"]
pub type cef_touch_event_t = _cef_touch_event_t;
pub const cef_paint_element_type_t_PET_VIEW: cef_paint_element_type_t = 0;
pub const cef_paint_element_type_t_PET_POPUP: cef_paint_element_type_t = 1;
#[doc = "\n Paint element types.\n"]
pub type cef_paint_element_type_t = ::std::os::raw::c_uint;
pub const cef_event_flags_t_EVENTFLAG_NONE: cef_event_flags_t = 0;
pub const cef_event_flags_t_EVENTFLAG_CAPS_LOCK_ON: cef_event_flags_t = 1;
pub const cef_event_flags_t_EVENTFLAG_SHIFT_DOWN: cef_event_flags_t = 2;
pub const cef_event_flags_t_EVENTFLAG_CONTROL_DOWN: cef_event_flags_t = 4;
pub const cef_event_flags_t_EVENTFLAG_ALT_DOWN: cef_event_flags_t = 8;
pub const cef_event_flags_t_EVENTFLAG_LEFT_MOUSE_BUTTON: cef_event_flags_t = 16;
pub const cef_event_flags_t_EVENTFLAG_MIDDLE_MOUSE_BUTTON: cef_event_flags_t = 32;
pub const cef_event_flags_t_EVENTFLAG_RIGHT_MOUSE_BUTTON: cef_event_flags_t = 64;
#[doc = " Mac OS-X command key."]
pub const cef_event_flags_t_EVENTFLAG_COMMAND_DOWN: cef_event_flags_t = 128;
#[doc = " Mac OS-X command key."]
pub const cef_event_flags_t_EVENTFLAG_NUM_LOCK_ON: cef_event_flags_t = 256;
#[doc = " Mac OS-X command key."]
pub const cef_event_flags_t_EVENTFLAG_IS_KEY_PAD: cef_event_flags_t = 512;
#[doc = " Mac OS-X command key."]
pub const cef_event_flags_t_EVENTFLAG_IS_LEFT: cef_event_flags_t = 1024;
#[doc = " Mac OS-X command key."]
pub const cef_event_flags_t_EVENTFLAG_IS_RIGHT: cef_event_flags_t = 2048;
#[doc = " Mac OS-X command key."]
pub const cef_event_flags_t_EVENTFLAG_ALTGR_DOWN: cef_event_flags_t = 4096;
#[doc = " Mac OS-X command key."]
pub const cef_event_flags_t_EVENTFLAG_IS_REPEAT: cef_event_flags_t = 8192;
#[doc = "\n Supported event bit flags.\n"]
pub type cef_event_flags_t = ::std::os::raw::c_uint;
pub const cef_menu_item_type_t_MENUITEMTYPE_NONE: cef_menu_item_type_t = 0;
pub const cef_menu_item_type_t_MENUITEMTYPE_COMMAND: cef_menu_item_type_t = 1;
pub const cef_menu_item_type_t_MENUITEMTYPE_CHECK: cef_menu_item_type_t = 2;
pub const cef_menu_item_type_t_MENUITEMTYPE_RADIO: cef_menu_item_type_t = 3;
pub const cef_menu_item_type_t_MENUITEMTYPE_SEPARATOR: cef_menu_item_type_t = 4;
pub const cef_menu_item_type_t_MENUITEMTYPE_SUBMENU: cef_menu_item_type_t = 5;
#[doc = "\n Supported menu item types.\n"]
pub type cef_menu_item_type_t = ::std::os::raw::c_uint;
#[doc = "\n No node is selected.\n"]
pub const cef_context_menu_type_flags_t_CM_TYPEFLAG_NONE: cef_context_menu_type_flags_t = 0;
#[doc = "\n The top page is selected.\n"]
pub const cef_context_menu_type_flags_t_CM_TYPEFLAG_PAGE: cef_context_menu_type_flags_t = 1;
#[doc = "\n A subframe page is selected.\n"]
pub const cef_context_menu_type_flags_t_CM_TYPEFLAG_FRAME: cef_context_menu_type_flags_t = 2;
#[doc = "\n A link is selected.\n"]
pub const cef_context_menu_type_flags_t_CM_TYPEFLAG_LINK: cef_context_menu_type_flags_t = 4;
#[doc = "\n A media node is selected.\n"]
pub const cef_context_menu_type_flags_t_CM_TYPEFLAG_MEDIA: cef_context_menu_type_flags_t = 8;
#[doc = "\n There is a textual or mixed selection that is selected.\n"]
pub const cef_context_menu_type_flags_t_CM_TYPEFLAG_SELECTION: cef_context_menu_type_flags_t = 16;
#[doc = "\n An editable element is selected.\n"]
pub const cef_context_menu_type_flags_t_CM_TYPEFLAG_EDITABLE: cef_context_menu_type_flags_t = 32;
#[doc = "\n Supported context menu type flags.\n"]
pub type cef_context_menu_type_flags_t = ::std::os::raw::c_uint;
#[doc = "\n No special node is in context.\n"]
pub const cef_context_menu_media_type_t_CM_MEDIATYPE_NONE: cef_context_menu_media_type_t = 0;
#[doc = "\n An image node is selected.\n"]
pub const cef_context_menu_media_type_t_CM_MEDIATYPE_IMAGE: cef_context_menu_media_type_t = 1;
#[doc = "\n A video node is selected.\n"]
pub const cef_context_menu_media_type_t_CM_MEDIATYPE_VIDEO: cef_context_menu_media_type_t = 2;
#[doc = "\n An audio node is selected.\n"]
pub const cef_context_menu_media_type_t_CM_MEDIATYPE_AUDIO: cef_context_menu_media_type_t = 3;
#[doc = "\n An canvas node is selected.\n"]
pub const cef_context_menu_media_type_t_CM_MEDIATYPE_CANVAS: cef_context_menu_media_type_t = 4;
#[doc = "\n A file node is selected.\n"]
pub const cef_context_menu_media_type_t_CM_MEDIATYPE_FILE: cef_context_menu_media_type_t = 5;
#[doc = "\n A plugin node is selected.\n"]
pub const cef_context_menu_media_type_t_CM_MEDIATYPE_PLUGIN: cef_context_menu_media_type_t = 6;
#[doc = "\n Supported context menu media types. These constants match their equivalents\n in Chromium's ContextMenuDataMediaType and should not be renumbered.\n"]
pub type cef_context_menu_media_type_t = ::std::os::raw::c_uint;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_NONE:
    cef_context_menu_media_state_flags_t = 0;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_IN_ERROR:
    cef_context_menu_media_state_flags_t = 1;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_PAUSED:
    cef_context_menu_media_state_flags_t = 2;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_MUTED:
    cef_context_menu_media_state_flags_t = 4;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_LOOP:
    cef_context_menu_media_state_flags_t = 8;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_CAN_SAVE:
    cef_context_menu_media_state_flags_t = 16;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_HAS_AUDIO:
    cef_context_menu_media_state_flags_t = 32;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_CAN_TOGGLE_CONTROLS:
    cef_context_menu_media_state_flags_t = 64;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_CONTROLS:
    cef_context_menu_media_state_flags_t = 128;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_CAN_PRINT:
    cef_context_menu_media_state_flags_t = 256;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_CAN_ROTATE:
    cef_context_menu_media_state_flags_t = 512;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_CAN_PICTURE_IN_PICTURE:
    cef_context_menu_media_state_flags_t = 1024;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_PICTURE_IN_PICTURE:
    cef_context_menu_media_state_flags_t = 2048;
pub const cef_context_menu_media_state_flags_t_CM_MEDIAFLAG_CAN_LOOP:
    cef_context_menu_media_state_flags_t = 4096;
#[doc = "\n Supported context menu media state bit flags. These constants match their\n equivalents in Chromium's ContextMenuData::MediaFlags and should not be\n renumbered.\n"]
pub type cef_context_menu_media_state_flags_t = ::std::os::raw::c_uint;
pub const cef_context_menu_edit_state_flags_t_CM_EDITFLAG_NONE:
    cef_context_menu_edit_state_flags_t = 0;
pub const cef_context_menu_edit_state_flags_t_CM_EDITFLAG_CAN_UNDO:
    cef_context_menu_edit_state_flags_t = 1;
pub const cef_context_menu_edit_state_flags_t_CM_EDITFLAG_CAN_REDO:
    cef_context_menu_edit_state_flags_t = 2;
pub const cef_context_menu_edit_state_flags_t_CM_EDITFLAG_CAN_CUT:
    cef_context_menu_edit_state_flags_t = 4;
pub const cef_context_menu_edit_state_flags_t_CM_EDITFLAG_CAN_COPY:
    cef_context_menu_edit_state_flags_t = 8;
pub const cef_context_menu_edit_state_flags_t_CM_EDITFLAG_CAN_PASTE:
    cef_context_menu_edit_state_flags_t = 16;
pub const cef_context_menu_edit_state_flags_t_CM_EDITFLAG_CAN_DELETE:
    cef_context_menu_edit_state_flags_t = 32;
pub const cef_context_menu_edit_state_flags_t_CM_EDITFLAG_CAN_SELECT_ALL:
    cef_context_menu_edit_state_flags_t = 64;
pub const cef_context_menu_edit_state_flags_t_CM_EDITFLAG_CAN_TRANSLATE:
    cef_context_menu_edit_state_flags_t = 128;
pub const cef_context_menu_edit_state_flags_t_CM_EDITFLAG_CAN_EDIT_RICHLY:
    cef_context_menu_edit_state_flags_t = 256;
#[doc = "\n Supported context menu edit state bit flags. These constants match their\n equivalents in Chromium's ContextMenuDataEditFlags and should not be\n renumbered.\n"]
pub type cef_context_menu_edit_state_flags_t = ::std::os::raw::c_uint;
pub const cef_quick_menu_edit_state_flags_t_QM_EDITFLAG_NONE: cef_quick_menu_edit_state_flags_t = 0;
pub const cef_quick_menu_edit_state_flags_t_QM_EDITFLAG_CAN_ELLIPSIS:
    cef_quick_menu_edit_state_flags_t = 1;
pub const cef_quick_menu_edit_state_flags_t_QM_EDITFLAG_CAN_CUT: cef_quick_menu_edit_state_flags_t =
    2;
pub const cef_quick_menu_edit_state_flags_t_QM_EDITFLAG_CAN_COPY:
    cef_quick_menu_edit_state_flags_t = 4;
pub const cef_quick_menu_edit_state_flags_t_QM_EDITFLAG_CAN_PASTE:
    cef_quick_menu_edit_state_flags_t = 8;
#[doc = "\n Supported quick menu state bit flags.\n"]
pub type cef_quick_menu_edit_state_flags_t = ::std::os::raw::c_uint;
#[doc = "\n Notification that a key transitioned from \"up\" to \"down\".\n"]
pub const cef_key_event_type_t_KEYEVENT_RAWKEYDOWN: cef_key_event_type_t = 0;
#[doc = "\n Notification that a key was pressed. This does not necessarily correspond\n to a character depending on the key and language. Use KEYEVENT_CHAR for\n character input.\n"]
pub const cef_key_event_type_t_KEYEVENT_KEYDOWN: cef_key_event_type_t = 1;
#[doc = "\n Notification that a key was released.\n"]
pub const cef_key_event_type_t_KEYEVENT_KEYUP: cef_key_event_type_t = 2;
#[doc = "\n Notification that a character was typed. Use this for text input. Key\n down events may generate 0, 1, or more than one character event depending\n on the key, locale, and operating system.\n"]
pub const cef_key_event_type_t_KEYEVENT_CHAR: cef_key_event_type_t = 3;
#[doc = "\n Key event types.\n"]
pub type cef_key_event_type_t = ::std::os::raw::c_uint;
#[doc = "\n Structure representing keyboard event information.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_key_event_t {
    #[doc = "\n The type of keyboard event.\n"]
    pub type_: cef_key_event_type_t,
    #[doc = "\n Bit flags describing any pressed modifier keys. See\n cef_event_flags_t for values.\n"]
    pub modifiers: u32,
    #[doc = "\n The Windows key code for the key event. This value is used by the DOM\n specification. Sometimes it comes directly from the event (i.e. on\n Windows) and sometimes it's determined using a mapping function. See\n WebCore/platform/chromium/KeyboardCodes.h for the list of values.\n"]
    pub windows_key_code: ::std::os::raw::c_int,
    #[doc = "\n The actual key code genenerated by the platform.\n"]
    pub native_key_code: ::std::os::raw::c_int,
    #[doc = "\n Indicates whether the event is considered a \"system key\" event (see\n http://msdn.microsoft.com/en-us/library/ms646286(VS.85).aspx for details).\n This value will always be false on non-Windows platforms.\n"]
    pub is_system_key: ::std::os::raw::c_int,
    #[doc = "\n The character generated by the keystroke.\n"]
    pub character: char16_t,
    #[doc = "\n Same as |character| but unmodified by any concurrently-held modifiers\n (except shift). This is useful for working out shortcut keys.\n"]
    pub unmodified_character: char16_t,
    #[doc = "\n True if the focus is currently on an editable field on the page. This is\n useful for determining if standard key events should be intercepted.\n"]
    pub focus_on_editable_field: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_key_event_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_key_event_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_key_event_t>(),
        28usize,
        concat!("Size of: ", stringify!(_cef_key_event_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_key_event_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_key_event_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).modifiers) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(modifiers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).windows_key_code) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(windows_key_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).native_key_code) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(native_key_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_system_key) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(is_system_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).character) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(character)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unmodified_character) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(unmodified_character)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).focus_on_editable_field) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_key_event_t),
            "::",
            stringify!(focus_on_editable_field)
        )
    );
}
#[doc = "\n Structure representing keyboard event information.\n"]
pub type cef_key_event_t = _cef_key_event_t;
#[doc = "\n The source is explicit navigation via the API (LoadURL(), etc).\n"]
pub const cef_focus_source_t_FOCUS_SOURCE_NAVIGATION: cef_focus_source_t = 0;
#[doc = "\n The source is a system-generated focus event.\n"]
pub const cef_focus_source_t_FOCUS_SOURCE_SYSTEM: cef_focus_source_t = 1;
#[doc = "\n Focus sources.\n"]
pub type cef_focus_source_t = ::std::os::raw::c_uint;
pub const cef_navigation_type_t_NAVIGATION_LINK_CLICKED: cef_navigation_type_t = 0;
pub const cef_navigation_type_t_NAVIGATION_FORM_SUBMITTED: cef_navigation_type_t = 1;
pub const cef_navigation_type_t_NAVIGATION_BACK_FORWARD: cef_navigation_type_t = 2;
pub const cef_navigation_type_t_NAVIGATION_RELOAD: cef_navigation_type_t = 3;
pub const cef_navigation_type_t_NAVIGATION_FORM_RESUBMITTED: cef_navigation_type_t = 4;
pub const cef_navigation_type_t_NAVIGATION_OTHER: cef_navigation_type_t = 5;
#[doc = "\n Navigation types.\n"]
pub type cef_navigation_type_t = ::std::os::raw::c_uint;
pub const cef_xml_encoding_type_t_XML_ENCODING_NONE: cef_xml_encoding_type_t = 0;
pub const cef_xml_encoding_type_t_XML_ENCODING_UTF8: cef_xml_encoding_type_t = 1;
pub const cef_xml_encoding_type_t_XML_ENCODING_UTF16LE: cef_xml_encoding_type_t = 2;
pub const cef_xml_encoding_type_t_XML_ENCODING_UTF16BE: cef_xml_encoding_type_t = 3;
pub const cef_xml_encoding_type_t_XML_ENCODING_ASCII: cef_xml_encoding_type_t = 4;
#[doc = "\n Supported XML encoding types. The parser supports ASCII, ISO-8859-1, and\n UTF16 (LE and BE) by default. All other types must be translated to UTF8\n before being passed to the parser. If a BOM is detected and the correct\n decoder is available then that decoder will be used automatically.\n"]
pub type cef_xml_encoding_type_t = ::std::os::raw::c_uint;
pub const cef_xml_node_type_t_XML_NODE_UNSUPPORTED: cef_xml_node_type_t = 0;
pub const cef_xml_node_type_t_XML_NODE_PROCESSING_INSTRUCTION: cef_xml_node_type_t = 1;
pub const cef_xml_node_type_t_XML_NODE_DOCUMENT_TYPE: cef_xml_node_type_t = 2;
pub const cef_xml_node_type_t_XML_NODE_ELEMENT_START: cef_xml_node_type_t = 3;
pub const cef_xml_node_type_t_XML_NODE_ELEMENT_END: cef_xml_node_type_t = 4;
pub const cef_xml_node_type_t_XML_NODE_ATTRIBUTE: cef_xml_node_type_t = 5;
pub const cef_xml_node_type_t_XML_NODE_TEXT: cef_xml_node_type_t = 6;
pub const cef_xml_node_type_t_XML_NODE_CDATA: cef_xml_node_type_t = 7;
pub const cef_xml_node_type_t_XML_NODE_ENTITY_REFERENCE: cef_xml_node_type_t = 8;
pub const cef_xml_node_type_t_XML_NODE_WHITESPACE: cef_xml_node_type_t = 9;
pub const cef_xml_node_type_t_XML_NODE_COMMENT: cef_xml_node_type_t = 10;
#[doc = "\n XML node types.\n"]
pub type cef_xml_node_type_t = ::std::os::raw::c_uint;
#[doc = "\n Popup window features.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_popup_features_t {
    pub x: ::std::os::raw::c_int,
    pub xSet: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub ySet: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub widthSet: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub heightSet: ::std::os::raw::c_int,
    #[doc = " True (1) if browser interface elements should be hidden."]
    pub isPopup: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_popup_features_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_popup_features_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_popup_features_t>(),
        36usize,
        concat!("Size of: ", stringify!(_cef_popup_features_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_popup_features_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_popup_features_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xSet) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(xSet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ySet) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(ySet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).widthSet) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(widthSet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).heightSet) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(heightSet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isPopup) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_popup_features_t),
            "::",
            stringify!(isPopup)
        )
    );
}
#[doc = "\n Popup window features.\n"]
pub type cef_popup_features_t = _cef_popup_features_t;
pub const cef_dom_document_type_t_DOM_DOCUMENT_TYPE_UNKNOWN: cef_dom_document_type_t = 0;
pub const cef_dom_document_type_t_DOM_DOCUMENT_TYPE_HTML: cef_dom_document_type_t = 1;
pub const cef_dom_document_type_t_DOM_DOCUMENT_TYPE_XHTML: cef_dom_document_type_t = 2;
pub const cef_dom_document_type_t_DOM_DOCUMENT_TYPE_PLUGIN: cef_dom_document_type_t = 3;
#[doc = "\n DOM document types.\n"]
pub type cef_dom_document_type_t = ::std::os::raw::c_uint;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_UNKNOWN: cef_dom_event_category_t = 0;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_UI: cef_dom_event_category_t = 1;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_MOUSE: cef_dom_event_category_t = 2;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_MUTATION: cef_dom_event_category_t = 4;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_KEYBOARD: cef_dom_event_category_t = 8;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_TEXT: cef_dom_event_category_t = 16;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_COMPOSITION: cef_dom_event_category_t = 32;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_DRAG: cef_dom_event_category_t = 64;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_CLIPBOARD: cef_dom_event_category_t = 128;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_MESSAGE: cef_dom_event_category_t = 256;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_WHEEL: cef_dom_event_category_t = 512;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_BEFORE_TEXT_INSERTED:
    cef_dom_event_category_t = 1024;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_OVERFLOW: cef_dom_event_category_t = 2048;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_PAGE_TRANSITION: cef_dom_event_category_t =
    4096;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_POPSTATE: cef_dom_event_category_t = 8192;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_PROGRESS: cef_dom_event_category_t = 16384;
pub const cef_dom_event_category_t_DOM_EVENT_CATEGORY_XMLHTTPREQUEST_PROGRESS:
    cef_dom_event_category_t = 32768;
#[doc = "\n DOM event category flags.\n"]
pub type cef_dom_event_category_t = ::std::os::raw::c_uint;
pub const cef_dom_event_phase_t_DOM_EVENT_PHASE_UNKNOWN: cef_dom_event_phase_t = 0;
pub const cef_dom_event_phase_t_DOM_EVENT_PHASE_CAPTURING: cef_dom_event_phase_t = 1;
pub const cef_dom_event_phase_t_DOM_EVENT_PHASE_AT_TARGET: cef_dom_event_phase_t = 2;
pub const cef_dom_event_phase_t_DOM_EVENT_PHASE_BUBBLING: cef_dom_event_phase_t = 3;
#[doc = "\n DOM event processing phases.\n"]
pub type cef_dom_event_phase_t = ::std::os::raw::c_uint;
pub const cef_dom_node_type_t_DOM_NODE_TYPE_UNSUPPORTED: cef_dom_node_type_t = 0;
pub const cef_dom_node_type_t_DOM_NODE_TYPE_ELEMENT: cef_dom_node_type_t = 1;
pub const cef_dom_node_type_t_DOM_NODE_TYPE_ATTRIBUTE: cef_dom_node_type_t = 2;
pub const cef_dom_node_type_t_DOM_NODE_TYPE_TEXT: cef_dom_node_type_t = 3;
pub const cef_dom_node_type_t_DOM_NODE_TYPE_CDATA_SECTION: cef_dom_node_type_t = 4;
pub const cef_dom_node_type_t_DOM_NODE_TYPE_PROCESSING_INSTRUCTIONS: cef_dom_node_type_t = 5;
pub const cef_dom_node_type_t_DOM_NODE_TYPE_COMMENT: cef_dom_node_type_t = 6;
pub const cef_dom_node_type_t_DOM_NODE_TYPE_DOCUMENT: cef_dom_node_type_t = 7;
pub const cef_dom_node_type_t_DOM_NODE_TYPE_DOCUMENT_TYPE: cef_dom_node_type_t = 8;
pub const cef_dom_node_type_t_DOM_NODE_TYPE_DOCUMENT_FRAGMENT: cef_dom_node_type_t = 9;
#[doc = "\n DOM node types.\n"]
pub type cef_dom_node_type_t = ::std::os::raw::c_uint;
#[doc = "\n Requires that the file exists before allowing the user to pick it.\n"]
pub const cef_file_dialog_mode_t_FILE_DIALOG_OPEN: cef_file_dialog_mode_t = 0;
#[doc = "\n Like Open, but allows picking multiple files to open.\n"]
pub const cef_file_dialog_mode_t_FILE_DIALOG_OPEN_MULTIPLE: cef_file_dialog_mode_t = 1;
#[doc = "\n Like Open, but selects a folder to open.\n"]
pub const cef_file_dialog_mode_t_FILE_DIALOG_OPEN_FOLDER: cef_file_dialog_mode_t = 2;
#[doc = "\n Allows picking a nonexistent file, and prompts to overwrite if the file\n already exists.\n"]
pub const cef_file_dialog_mode_t_FILE_DIALOG_SAVE: cef_file_dialog_mode_t = 3;
#[doc = "\n Supported file dialog modes.\n"]
pub type cef_file_dialog_mode_t = ::std::os::raw::c_uint;
pub const cef_color_model_t_COLOR_MODEL_UNKNOWN: cef_color_model_t = 0;
pub const cef_color_model_t_COLOR_MODEL_GRAY: cef_color_model_t = 1;
pub const cef_color_model_t_COLOR_MODEL_COLOR: cef_color_model_t = 2;
pub const cef_color_model_t_COLOR_MODEL_CMYK: cef_color_model_t = 3;
pub const cef_color_model_t_COLOR_MODEL_CMY: cef_color_model_t = 4;
pub const cef_color_model_t_COLOR_MODEL_KCMY: cef_color_model_t = 5;
pub const cef_color_model_t_COLOR_MODEL_CMY_K: cef_color_model_t = 6;
pub const cef_color_model_t_COLOR_MODEL_BLACK: cef_color_model_t = 7;
pub const cef_color_model_t_COLOR_MODEL_GRAYSCALE: cef_color_model_t = 8;
pub const cef_color_model_t_COLOR_MODEL_RGB: cef_color_model_t = 9;
pub const cef_color_model_t_COLOR_MODEL_RGB16: cef_color_model_t = 10;
pub const cef_color_model_t_COLOR_MODEL_RGBA: cef_color_model_t = 11;
pub const cef_color_model_t_COLOR_MODEL_COLORMODE_COLOR: cef_color_model_t = 12;
pub const cef_color_model_t_COLOR_MODEL_COLORMODE_MONOCHROME: cef_color_model_t = 13;
pub const cef_color_model_t_COLOR_MODEL_HP_COLOR_COLOR: cef_color_model_t = 14;
pub const cef_color_model_t_COLOR_MODEL_HP_COLOR_BLACK: cef_color_model_t = 15;
pub const cef_color_model_t_COLOR_MODEL_PRINTOUTMODE_NORMAL: cef_color_model_t = 16;
pub const cef_color_model_t_COLOR_MODEL_PRINTOUTMODE_NORMAL_GRAY: cef_color_model_t = 17;
pub const cef_color_model_t_COLOR_MODEL_PROCESSCOLORMODEL_CMYK: cef_color_model_t = 18;
pub const cef_color_model_t_COLOR_MODEL_PROCESSCOLORMODEL_GREYSCALE: cef_color_model_t = 19;
pub const cef_color_model_t_COLOR_MODEL_PROCESSCOLORMODEL_RGB: cef_color_model_t = 20;
#[doc = "\n Print job color mode values.\n"]
pub type cef_color_model_t = ::std::os::raw::c_uint;
pub const cef_duplex_mode_t_DUPLEX_MODE_UNKNOWN: cef_duplex_mode_t = -1;
pub const cef_duplex_mode_t_DUPLEX_MODE_SIMPLEX: cef_duplex_mode_t = 0;
pub const cef_duplex_mode_t_DUPLEX_MODE_LONG_EDGE: cef_duplex_mode_t = 1;
pub const cef_duplex_mode_t_DUPLEX_MODE_SHORT_EDGE: cef_duplex_mode_t = 2;
#[doc = "\n Print job duplex mode values.\n"]
pub type cef_duplex_mode_t = ::std::os::raw::c_int;
pub const cef_cursor_type_t_CT_POINTER: cef_cursor_type_t = 0;
pub const cef_cursor_type_t_CT_CROSS: cef_cursor_type_t = 1;
pub const cef_cursor_type_t_CT_HAND: cef_cursor_type_t = 2;
pub const cef_cursor_type_t_CT_IBEAM: cef_cursor_type_t = 3;
pub const cef_cursor_type_t_CT_WAIT: cef_cursor_type_t = 4;
pub const cef_cursor_type_t_CT_HELP: cef_cursor_type_t = 5;
pub const cef_cursor_type_t_CT_EASTRESIZE: cef_cursor_type_t = 6;
pub const cef_cursor_type_t_CT_NORTHRESIZE: cef_cursor_type_t = 7;
pub const cef_cursor_type_t_CT_NORTHEASTRESIZE: cef_cursor_type_t = 8;
pub const cef_cursor_type_t_CT_NORTHWESTRESIZE: cef_cursor_type_t = 9;
pub const cef_cursor_type_t_CT_SOUTHRESIZE: cef_cursor_type_t = 10;
pub const cef_cursor_type_t_CT_SOUTHEASTRESIZE: cef_cursor_type_t = 11;
pub const cef_cursor_type_t_CT_SOUTHWESTRESIZE: cef_cursor_type_t = 12;
pub const cef_cursor_type_t_CT_WESTRESIZE: cef_cursor_type_t = 13;
pub const cef_cursor_type_t_CT_NORTHSOUTHRESIZE: cef_cursor_type_t = 14;
pub const cef_cursor_type_t_CT_EASTWESTRESIZE: cef_cursor_type_t = 15;
pub const cef_cursor_type_t_CT_NORTHEASTSOUTHWESTRESIZE: cef_cursor_type_t = 16;
pub const cef_cursor_type_t_CT_NORTHWESTSOUTHEASTRESIZE: cef_cursor_type_t = 17;
pub const cef_cursor_type_t_CT_COLUMNRESIZE: cef_cursor_type_t = 18;
pub const cef_cursor_type_t_CT_ROWRESIZE: cef_cursor_type_t = 19;
pub const cef_cursor_type_t_CT_MIDDLEPANNING: cef_cursor_type_t = 20;
pub const cef_cursor_type_t_CT_EASTPANNING: cef_cursor_type_t = 21;
pub const cef_cursor_type_t_CT_NORTHPANNING: cef_cursor_type_t = 22;
pub const cef_cursor_type_t_CT_NORTHEASTPANNING: cef_cursor_type_t = 23;
pub const cef_cursor_type_t_CT_NORTHWESTPANNING: cef_cursor_type_t = 24;
pub const cef_cursor_type_t_CT_SOUTHPANNING: cef_cursor_type_t = 25;
pub const cef_cursor_type_t_CT_SOUTHEASTPANNING: cef_cursor_type_t = 26;
pub const cef_cursor_type_t_CT_SOUTHWESTPANNING: cef_cursor_type_t = 27;
pub const cef_cursor_type_t_CT_WESTPANNING: cef_cursor_type_t = 28;
pub const cef_cursor_type_t_CT_MOVE: cef_cursor_type_t = 29;
pub const cef_cursor_type_t_CT_VERTICALTEXT: cef_cursor_type_t = 30;
pub const cef_cursor_type_t_CT_CELL: cef_cursor_type_t = 31;
pub const cef_cursor_type_t_CT_CONTEXTMENU: cef_cursor_type_t = 32;
pub const cef_cursor_type_t_CT_ALIAS: cef_cursor_type_t = 33;
pub const cef_cursor_type_t_CT_PROGRESS: cef_cursor_type_t = 34;
pub const cef_cursor_type_t_CT_NODROP: cef_cursor_type_t = 35;
pub const cef_cursor_type_t_CT_COPY: cef_cursor_type_t = 36;
pub const cef_cursor_type_t_CT_NONE: cef_cursor_type_t = 37;
pub const cef_cursor_type_t_CT_NOTALLOWED: cef_cursor_type_t = 38;
pub const cef_cursor_type_t_CT_ZOOMIN: cef_cursor_type_t = 39;
pub const cef_cursor_type_t_CT_ZOOMOUT: cef_cursor_type_t = 40;
pub const cef_cursor_type_t_CT_GRAB: cef_cursor_type_t = 41;
pub const cef_cursor_type_t_CT_GRABBING: cef_cursor_type_t = 42;
pub const cef_cursor_type_t_CT_MIDDLE_PANNING_VERTICAL: cef_cursor_type_t = 43;
pub const cef_cursor_type_t_CT_MIDDLE_PANNING_HORIZONTAL: cef_cursor_type_t = 44;
pub const cef_cursor_type_t_CT_CUSTOM: cef_cursor_type_t = 45;
pub const cef_cursor_type_t_CT_DND_NONE: cef_cursor_type_t = 46;
pub const cef_cursor_type_t_CT_DND_MOVE: cef_cursor_type_t = 47;
pub const cef_cursor_type_t_CT_DND_COPY: cef_cursor_type_t = 48;
pub const cef_cursor_type_t_CT_DND_LINK: cef_cursor_type_t = 49;
#[doc = "\n Cursor type values.\n"]
pub type cef_cursor_type_t = ::std::os::raw::c_uint;
#[doc = "\n Structure representing cursor information. |buffer| will be\n |size.width|*|size.height|*4 bytes in size and represents a BGRA image with\n an upper-left origin.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_cursor_info_t {
    pub hotspot: cef_point_t,
    pub image_scale_factor: f32,
    pub buffer: *mut ::std::os::raw::c_void,
    pub size: cef_size_t,
}
#[test]
fn bindgen_test_layout__cef_cursor_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_cursor_info_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_cursor_info_t>(),
        32usize,
        concat!("Size of: ", stringify!(_cef_cursor_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_cursor_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_cursor_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hotspot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cursor_info_t),
            "::",
            stringify!(hotspot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).image_scale_factor) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cursor_info_t),
            "::",
            stringify!(image_scale_factor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cursor_info_t),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_cursor_info_t),
            "::",
            stringify!(size)
        )
    );
}
#[doc = "\n Structure representing cursor information. |buffer| will be\n |size.width|*|size.height|*4 bytes in size and represents a BGRA image with\n an upper-left origin.\n"]
pub type cef_cursor_info_t = _cef_cursor_info_t;
#[doc = "\n Don't unescape anything at all.\n"]
pub const cef_uri_unescape_rule_t_UU_NONE: cef_uri_unescape_rule_t = 0;
#[doc = "\n Don't unescape anything special, but all normal unescaping will happen.\n This is a placeholder and can't be combined with other flags (since it's\n just the absence of them). All other unescape rules imply \"normal\" in\n addition to their special meaning. Things like escaped letters, digits,\n and most symbols will get unescaped with this mode.\n"]
pub const cef_uri_unescape_rule_t_UU_NORMAL: cef_uri_unescape_rule_t = 1;
#[doc = "\n Convert %20 to spaces. In some places where we're showing URLs, we may\n want this. In places where the URL may be copied and pasted out, then\n you wouldn't want this since it might not be interpreted in one piece\n by other applications.\n"]
pub const cef_uri_unescape_rule_t_UU_SPACES: cef_uri_unescape_rule_t = 2;
#[doc = "\n Unescapes '/' and '\\\\'. If these characters were unescaped, the resulting\n URL won't be the same as the source one. Moreover, they are dangerous to\n unescape in strings that will be used as file paths or names. This value\n should only be used when slashes don't have special meaning, like data\n URLs.\n"]
pub const cef_uri_unescape_rule_t_UU_PATH_SEPARATORS: cef_uri_unescape_rule_t = 4;
#[doc = "\n Unescapes various characters that will change the meaning of URLs,\n including '%', '+', '&', '#'. Does not unescape path separators.\n If these characters were unescaped, the resulting URL won't be the same\n as the source one. This flag is used when generating final output like\n filenames for URLs where we won't be interpreting as a URL and want to do\n as much unescaping as possible.\n"]
pub const cef_uri_unescape_rule_t_UU_URL_SPECIAL_CHARS_EXCEPT_PATH_SEPARATORS:
    cef_uri_unescape_rule_t = 8;
#[doc = "\n URL queries use \"+\" for space. This flag controls that replacement.\n"]
pub const cef_uri_unescape_rule_t_UU_REPLACE_PLUS_WITH_SPACE: cef_uri_unescape_rule_t = 16;
#[doc = "\n URI unescape rules passed to CefURIDecode().\n"]
pub type cef_uri_unescape_rule_t = ::std::os::raw::c_uint;
#[doc = "\n Parses the input strictly according to RFC 4627. See comments in\n Chromium's base/json/json_reader.h file for known limitations/\n deviations from the RFC.\n"]
pub const cef_json_parser_options_t_JSON_PARSER_RFC: cef_json_parser_options_t = 0;
#[doc = "\n Allows commas to exist after the last element in structures.\n"]
pub const cef_json_parser_options_t_JSON_PARSER_ALLOW_TRAILING_COMMAS: cef_json_parser_options_t =
    1;
#[doc = "\n Options that can be passed to CefParseJSON.\n"]
pub type cef_json_parser_options_t = ::std::os::raw::c_uint;
#[doc = "\n Default behavior.\n"]
pub const cef_json_writer_options_t_JSON_WRITER_DEFAULT: cef_json_writer_options_t = 0;
#[doc = "\n This option instructs the writer that if a Binary value is encountered,\n the value (and key if within a dictionary) will be omitted from the\n output, and success will be returned. Otherwise, if a binary value is\n encountered, failure will be returned.\n"]
pub const cef_json_writer_options_t_JSON_WRITER_OMIT_BINARY_VALUES: cef_json_writer_options_t = 1;
#[doc = "\n This option instructs the writer to write doubles that have no fractional\n part as a normal integer (i.e., without using exponential notation\n or appending a '.0') as long as the value is within the range of a\n 64-bit int.\n"]
pub const cef_json_writer_options_t_JSON_WRITER_OMIT_DOUBLE_TYPE_PRESERVATION:
    cef_json_writer_options_t = 2;
#[doc = "\n Return a slightly nicer formatted json string (pads with whitespace to\n help with readability).\n"]
pub const cef_json_writer_options_t_JSON_WRITER_PRETTY_PRINT: cef_json_writer_options_t = 4;
#[doc = "\n Options that can be passed to CefWriteJSON.\n"]
pub type cef_json_writer_options_t = ::std::os::raw::c_uint;
#[doc = "\n Default margins of 1cm (~0.4 inches).\n"]
pub const cef_pdf_print_margin_type_t_PDF_PRINT_MARGIN_DEFAULT: cef_pdf_print_margin_type_t = 0;
#[doc = "\n No margins.\n"]
pub const cef_pdf_print_margin_type_t_PDF_PRINT_MARGIN_NONE: cef_pdf_print_margin_type_t = 1;
#[doc = "\n Custom margins using the |margin_*| values from cef_pdf_print_settings_t.\n"]
pub const cef_pdf_print_margin_type_t_PDF_PRINT_MARGIN_CUSTOM: cef_pdf_print_margin_type_t = 2;
#[doc = "\n Margin type for PDF printing.\n"]
pub type cef_pdf_print_margin_type_t = ::std::os::raw::c_uint;
#[doc = "\n Structure representing PDF print settings. These values match the parameters\n supported by the DevTools Page.printToPDF function. See\n https://chromedevtools.github.io/devtools-protocol/tot/Page/#method-printToPDF\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_pdf_print_settings_t {
    #[doc = "\n Set to true (1) for landscape mode or false (0) for portrait mode.\n"]
    pub landscape: ::std::os::raw::c_int,
    #[doc = "\n Set to true (1) to print background graphics.\n"]
    pub print_background: ::std::os::raw::c_int,
    #[doc = "\n The percentage to scale the PDF by before printing (e.g. .5 is 50%).\n If this value is less than or equal to zero the default value of 1.0\n will be used.\n"]
    pub scale: f64,
    #[doc = "\n Output paper size in inches. If either of these values is less than or\n equal to zero then the default paper size (letter, 8.5 x 11 inches) will\n be used.\n"]
    pub paper_width: f64,
    pub paper_height: f64,
    #[doc = "\n Set to true (1) to prefer page size as defined by css. Defaults to false\n (0), in which case the content will be scaled to fit the paper size.\n"]
    pub prefer_css_page_size: ::std::os::raw::c_int,
    #[doc = "\n Margin type.\n"]
    pub margin_type: cef_pdf_print_margin_type_t,
    #[doc = "\n Margins in inches. Only used if |margin_type| is set to\n PDF_PRINT_MARGIN_CUSTOM.\n"]
    pub margin_top: f64,
    pub margin_right: f64,
    pub margin_bottom: f64,
    pub margin_left: f64,
    #[doc = "\n Paper ranges to print, one based, e.g., '1-5, 8, 11-13'. Pages are printed\n in the document order, not in the order specified, and no more than once.\n Defaults to empty string, which implies the entire document is printed.\n The page numbers are quietly capped to actual page count of the document,\n and ranges beyond the end of the document are ignored. If this results in\n no pages to print, an error is reported. It is an error to specify a range\n with start greater than end.\n"]
    pub page_ranges: cef_string_t,
    #[doc = "\n Set to true (1) to display the header and/or footer. Modify\n |header_template| and/or |footer_template| to customize the display.\n"]
    pub display_header_footer: ::std::os::raw::c_int,
    #[doc = "\n HTML template for the print header. Only displayed if\n |display_header_footer| is true (1). Should be valid HTML markup with\n the following classes used to inject printing values into them:\n\n - date: formatted print date\n - title: document title\n - url: document location\n - pageNumber: current page number\n - totalPages: total pages in the document\n\n For example, \"<span class=title></span>\" would generate a span containing\n the title.\n"]
    pub header_template: cef_string_t,
    #[doc = "\n HTML template for the print footer. Only displayed if\n |display_header_footer| is true (1). Uses the same format as\n |header_template|.\n"]
    pub footer_template: cef_string_t,
}
#[test]
fn bindgen_test_layout__cef_pdf_print_settings_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_pdf_print_settings_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_pdf_print_settings_t>(),
        152usize,
        concat!("Size of: ", stringify!(_cef_pdf_print_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_pdf_print_settings_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_pdf_print_settings_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).landscape) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(landscape)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).print_background) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(print_background)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paper_width) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(paper_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).paper_height) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(paper_height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prefer_css_page_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(prefer_css_page_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).margin_type) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(margin_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).margin_top) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(margin_top)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).margin_right) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(margin_right)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).margin_bottom) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(margin_bottom)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).margin_left) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(margin_left)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).page_ranges) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(page_ranges)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).display_header_footer) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(display_header_footer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).header_template) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(header_template)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).footer_template) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_pdf_print_settings_t),
            "::",
            stringify!(footer_template)
        )
    );
}
#[doc = "\n Structure representing PDF print settings. These values match the parameters\n supported by the DevTools Page.printToPDF function. See\n https://chromedevtools.github.io/devtools-protocol/tot/Page/#method-printToPDF\n"]
pub type cef_pdf_print_settings_t = _cef_pdf_print_settings_t;
pub const cef_scale_factor_t_SCALE_FACTOR_NONE: cef_scale_factor_t = 0;
pub const cef_scale_factor_t_SCALE_FACTOR_100P: cef_scale_factor_t = 1;
pub const cef_scale_factor_t_SCALE_FACTOR_125P: cef_scale_factor_t = 2;
pub const cef_scale_factor_t_SCALE_FACTOR_133P: cef_scale_factor_t = 3;
pub const cef_scale_factor_t_SCALE_FACTOR_140P: cef_scale_factor_t = 4;
pub const cef_scale_factor_t_SCALE_FACTOR_150P: cef_scale_factor_t = 5;
pub const cef_scale_factor_t_SCALE_FACTOR_180P: cef_scale_factor_t = 6;
pub const cef_scale_factor_t_SCALE_FACTOR_200P: cef_scale_factor_t = 7;
pub const cef_scale_factor_t_SCALE_FACTOR_250P: cef_scale_factor_t = 8;
pub const cef_scale_factor_t_SCALE_FACTOR_300P: cef_scale_factor_t = 9;
#[doc = "\n Supported UI scale factors for the platform. SCALE_FACTOR_NONE is used for\n density independent resources such as string, html/js files or an image that\n can be used for any scale factors (such as wallpapers).\n"]
pub type cef_scale_factor_t = ::std::os::raw::c_uint;
#[doc = "\n Clear the referrer header if the header value is HTTPS but the request\n destination is HTTP. This is the default behavior.\n"]
pub const cef_referrer_policy_t_REFERRER_POLICY_CLEAR_REFERRER_ON_TRANSITION_FROM_SECURE_TO_INSECURE : cef_referrer_policy_t = 0 ;
#[doc = "\n Clear the referrer header if the header value is HTTPS but the request\n destination is HTTP. This is the default behavior.\n"]
pub const cef_referrer_policy_t_REFERRER_POLICY_DEFAULT: cef_referrer_policy_t = 0;
#[doc = "\n A slight variant on CLEAR_REFERRER_ON_TRANSITION_FROM_SECURE_TO_INSECURE:\n If the request destination is HTTP, an HTTPS referrer will be cleared. If\n the request's destination is cross-origin with the referrer (but does not\n downgrade), the referrer's granularity will be stripped down to an origin\n rather than a full URL. Same-origin requests will send the full referrer.\n"]
pub const cef_referrer_policy_t_REFERRER_POLICY_REDUCE_REFERRER_GRANULARITY_ON_TRANSITION_CROSS_ORIGIN : cef_referrer_policy_t = 1 ;
#[doc = "\n Strip the referrer down to an origin when the origin of the referrer is\n different from the destination's origin.\n"]
pub const cef_referrer_policy_t_REFERRER_POLICY_ORIGIN_ONLY_ON_TRANSITION_CROSS_ORIGIN:
    cef_referrer_policy_t = 2;
#[doc = "\n Never change the referrer.\n"]
pub const cef_referrer_policy_t_REFERRER_POLICY_NEVER_CLEAR_REFERRER: cef_referrer_policy_t = 3;
#[doc = "\n Strip the referrer down to the origin regardless of the redirect location.\n"]
pub const cef_referrer_policy_t_REFERRER_POLICY_ORIGIN: cef_referrer_policy_t = 4;
#[doc = "\n Clear the referrer when the request's referrer is cross-origin with the\n request's destination.\n"]
pub const cef_referrer_policy_t_REFERRER_POLICY_CLEAR_REFERRER_ON_TRANSITION_CROSS_ORIGIN:
    cef_referrer_policy_t = 5;
#[doc = "\n Strip the referrer down to the origin, but clear it entirely if the\n referrer value is HTTPS and the destination is HTTP.\n"]
pub const cef_referrer_policy_t_REFERRER_POLICY_ORIGIN_CLEAR_ON_TRANSITION_FROM_SECURE_TO_INSECURE : cef_referrer_policy_t = 6 ;
#[doc = "\n Always clear the referrer regardless of the request destination.\n"]
pub const cef_referrer_policy_t_REFERRER_POLICY_NO_REFERRER: cef_referrer_policy_t = 7;
#[doc = " Always the last value in this enumeration."]
pub const cef_referrer_policy_t_REFERRER_POLICY_LAST_VALUE: cef_referrer_policy_t = 7;
#[doc = "\n Policy for how the Referrer HTTP header value will be sent during\n navigation. If the `--no-referrers` command-line flag is specified then the\n policy value will be ignored and the Referrer value will never be sent. Must\n be kept synchronized with net::URLRequest::ReferrerPolicy from Chromium.\n"]
pub type cef_referrer_policy_t = ::std::os::raw::c_uint;
#[doc = "\n Some or all of the pre-filter data was read successfully but more data is\n needed in order to continue filtering (filtered output is pending).\n"]
pub const cef_response_filter_status_t_RESPONSE_FILTER_NEED_MORE_DATA:
    cef_response_filter_status_t = 0;
#[doc = "\n Some or all of the pre-filter data was read successfully and all available\n filtered output has been written.\n"]
pub const cef_response_filter_status_t_RESPONSE_FILTER_DONE: cef_response_filter_status_t = 1;
#[doc = "\n An error occurred during filtering.\n"]
pub const cef_response_filter_status_t_RESPONSE_FILTER_ERROR: cef_response_filter_status_t = 2;
#[doc = "\n Return values for CefResponseFilter::Filter().\n"]
pub type cef_response_filter_status_t = ::std::os::raw::c_uint;
#[doc = "\n RGBA with 8 bits per pixel (32bits total).\n"]
pub const cef_color_type_t_CEF_COLOR_TYPE_RGBA_8888: cef_color_type_t = 0;
#[doc = "\n BGRA with 8 bits per pixel (32bits total).\n"]
pub const cef_color_type_t_CEF_COLOR_TYPE_BGRA_8888: cef_color_type_t = 1;
#[doc = "\n Describes how to interpret the components of a pixel.\n"]
pub type cef_color_type_t = ::std::os::raw::c_uint;
#[doc = "\n No transparency. The alpha component is ignored.\n"]
pub const cef_alpha_type_t_CEF_ALPHA_TYPE_OPAQUE: cef_alpha_type_t = 0;
#[doc = "\n Transparency with pre-multiplied alpha component.\n"]
pub const cef_alpha_type_t_CEF_ALPHA_TYPE_PREMULTIPLIED: cef_alpha_type_t = 1;
#[doc = "\n Transparency with post-multiplied alpha component.\n"]
pub const cef_alpha_type_t_CEF_ALPHA_TYPE_POSTMULTIPLIED: cef_alpha_type_t = 2;
#[doc = "\n Describes how to interpret the alpha component of a pixel.\n"]
pub type cef_alpha_type_t = ::std::os::raw::c_uint;
pub const cef_text_style_t_CEF_TEXT_STYLE_BOLD: cef_text_style_t = 0;
pub const cef_text_style_t_CEF_TEXT_STYLE_ITALIC: cef_text_style_t = 1;
pub const cef_text_style_t_CEF_TEXT_STYLE_STRIKE: cef_text_style_t = 2;
pub const cef_text_style_t_CEF_TEXT_STYLE_DIAGONAL_STRIKE: cef_text_style_t = 3;
pub const cef_text_style_t_CEF_TEXT_STYLE_UNDERLINE: cef_text_style_t = 4;
#[doc = "\n Text style types. Should be kepy in sync with gfx::TextStyle.\n"]
pub type cef_text_style_t = ::std::os::raw::c_uint;
#[doc = "\n Child views will be left-aligned.\n"]
pub const cef_main_axis_alignment_t_CEF_MAIN_AXIS_ALIGNMENT_START: cef_main_axis_alignment_t = 0;
#[doc = "\n Child views will be center-aligned.\n"]
pub const cef_main_axis_alignment_t_CEF_MAIN_AXIS_ALIGNMENT_CENTER: cef_main_axis_alignment_t = 1;
#[doc = "\n Child views will be right-aligned.\n"]
pub const cef_main_axis_alignment_t_CEF_MAIN_AXIS_ALIGNMENT_END: cef_main_axis_alignment_t = 2;
#[doc = "\n Specifies where along the main axis the CefBoxLayout child views should be\n laid out.\n"]
pub type cef_main_axis_alignment_t = ::std::os::raw::c_uint;
#[doc = "\n Child views will be stretched to fit.\n"]
pub const cef_cross_axis_alignment_t_CEF_CROSS_AXIS_ALIGNMENT_STRETCH: cef_cross_axis_alignment_t =
    0;
#[doc = "\n Child views will be left-aligned.\n"]
pub const cef_cross_axis_alignment_t_CEF_CROSS_AXIS_ALIGNMENT_START: cef_cross_axis_alignment_t = 1;
#[doc = "\n Child views will be center-aligned.\n"]
pub const cef_cross_axis_alignment_t_CEF_CROSS_AXIS_ALIGNMENT_CENTER: cef_cross_axis_alignment_t =
    2;
#[doc = "\n Child views will be right-aligned.\n"]
pub const cef_cross_axis_alignment_t_CEF_CROSS_AXIS_ALIGNMENT_END: cef_cross_axis_alignment_t = 3;
#[doc = "\n Specifies where along the cross axis the CefBoxLayout child views should be\n laid out.\n"]
pub type cef_cross_axis_alignment_t = ::std::os::raw::c_uint;
#[doc = "\n Settings used when initializing a CefBoxLayout.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_box_layout_settings_t {
    #[doc = "\n If true (1) the layout will be horizontal, otherwise the layout will be\n vertical.\n"]
    pub horizontal: ::std::os::raw::c_int,
    #[doc = "\n Adds additional horizontal space between the child view area and the host\n view border.\n"]
    pub inside_border_horizontal_spacing: ::std::os::raw::c_int,
    #[doc = "\n Adds additional vertical space between the child view area and the host\n view border.\n"]
    pub inside_border_vertical_spacing: ::std::os::raw::c_int,
    #[doc = "\n Adds additional space around the child view area.\n"]
    pub inside_border_insets: cef_insets_t,
    #[doc = "\n Adds additional space between child views.\n"]
    pub between_child_spacing: ::std::os::raw::c_int,
    #[doc = "\n Specifies where along the main axis the child views should be laid out.\n"]
    pub main_axis_alignment: cef_main_axis_alignment_t,
    #[doc = "\n Specifies where along the cross axis the child views should be laid out.\n"]
    pub cross_axis_alignment: cef_cross_axis_alignment_t,
    #[doc = "\n Minimum cross axis size.\n"]
    pub minimum_cross_axis_size: ::std::os::raw::c_int,
    #[doc = "\n Default flex for views when none is specified via CefBoxLayout methods.\n Using the preferred size as the basis, free space along the main axis is\n distributed to views in the ratio of their flex weights. Similarly, if the\n views will overflow the parent, space is subtracted in these ratios. A\n flex of 0 means this view is not resized. Flex values must not be\n negative.\n"]
    pub default_flex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_box_layout_settings_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_box_layout_settings_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_box_layout_settings_t>(),
        48usize,
        concat!("Size of: ", stringify!(_cef_box_layout_settings_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_box_layout_settings_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_box_layout_settings_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).horizontal) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(horizontal)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).inside_border_horizontal_spacing) as usize - ptr as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(inside_border_horizontal_spacing)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).inside_border_vertical_spacing) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(inside_border_vertical_spacing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).inside_border_insets) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(inside_border_insets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).between_child_spacing) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(between_child_spacing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).main_axis_alignment) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(main_axis_alignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cross_axis_alignment) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(cross_axis_alignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minimum_cross_axis_size) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(minimum_cross_axis_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_flex) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_box_layout_settings_t),
            "::",
            stringify!(default_flex)
        )
    );
}
#[doc = "\n Settings used when initializing a CefBoxLayout.\n"]
pub type cef_box_layout_settings_t = _cef_box_layout_settings_t;
pub const cef_button_state_t_CEF_BUTTON_STATE_NORMAL: cef_button_state_t = 0;
pub const cef_button_state_t_CEF_BUTTON_STATE_HOVERED: cef_button_state_t = 1;
pub const cef_button_state_t_CEF_BUTTON_STATE_PRESSED: cef_button_state_t = 2;
pub const cef_button_state_t_CEF_BUTTON_STATE_DISABLED: cef_button_state_t = 3;
#[doc = "\n Specifies the button display state.\n"]
pub type cef_button_state_t = ::std::os::raw::c_uint;
#[doc = "\n Align the text's left edge with that of its display area.\n"]
pub const cef_horizontal_alignment_t_CEF_HORIZONTAL_ALIGNMENT_LEFT: cef_horizontal_alignment_t = 0;
#[doc = "\n Align the text's center with that of its display area.\n"]
pub const cef_horizontal_alignment_t_CEF_HORIZONTAL_ALIGNMENT_CENTER: cef_horizontal_alignment_t =
    1;
#[doc = "\n Align the text's right edge with that of its display area.\n"]
pub const cef_horizontal_alignment_t_CEF_HORIZONTAL_ALIGNMENT_RIGHT: cef_horizontal_alignment_t = 2;
#[doc = "\n Specifies the horizontal text alignment mode.\n"]
pub type cef_horizontal_alignment_t = ::std::os::raw::c_uint;
pub const cef_menu_anchor_position_t_CEF_MENU_ANCHOR_TOPLEFT: cef_menu_anchor_position_t = 0;
pub const cef_menu_anchor_position_t_CEF_MENU_ANCHOR_TOPRIGHT: cef_menu_anchor_position_t = 1;
pub const cef_menu_anchor_position_t_CEF_MENU_ANCHOR_BOTTOMCENTER: cef_menu_anchor_position_t = 2;
#[doc = "\n Specifies how a menu will be anchored for non-RTL languages. The opposite\n position will be used for RTL languages.\n"]
pub type cef_menu_anchor_position_t = ::std::os::raw::c_uint;
pub const cef_menu_color_type_t_CEF_MENU_COLOR_TEXT: cef_menu_color_type_t = 0;
pub const cef_menu_color_type_t_CEF_MENU_COLOR_TEXT_HOVERED: cef_menu_color_type_t = 1;
pub const cef_menu_color_type_t_CEF_MENU_COLOR_TEXT_ACCELERATOR: cef_menu_color_type_t = 2;
pub const cef_menu_color_type_t_CEF_MENU_COLOR_TEXT_ACCELERATOR_HOVERED: cef_menu_color_type_t = 3;
pub const cef_menu_color_type_t_CEF_MENU_COLOR_BACKGROUND: cef_menu_color_type_t = 4;
pub const cef_menu_color_type_t_CEF_MENU_COLOR_BACKGROUND_HOVERED: cef_menu_color_type_t = 5;
pub const cef_menu_color_type_t_CEF_MENU_COLOR_COUNT: cef_menu_color_type_t = 6;
#[doc = "\n Supported color types for menu items.\n"]
pub type cef_menu_color_type_t = ::std::os::raw::c_uint;
pub const cef_ssl_version_t_SSL_CONNECTION_VERSION_UNKNOWN: cef_ssl_version_t = 0;
pub const cef_ssl_version_t_SSL_CONNECTION_VERSION_SSL2: cef_ssl_version_t = 1;
pub const cef_ssl_version_t_SSL_CONNECTION_VERSION_SSL3: cef_ssl_version_t = 2;
pub const cef_ssl_version_t_SSL_CONNECTION_VERSION_TLS1: cef_ssl_version_t = 3;
pub const cef_ssl_version_t_SSL_CONNECTION_VERSION_TLS1_1: cef_ssl_version_t = 4;
pub const cef_ssl_version_t_SSL_CONNECTION_VERSION_TLS1_2: cef_ssl_version_t = 5;
pub const cef_ssl_version_t_SSL_CONNECTION_VERSION_TLS1_3: cef_ssl_version_t = 6;
pub const cef_ssl_version_t_SSL_CONNECTION_VERSION_QUIC: cef_ssl_version_t = 7;
#[doc = " Supported SSL version values. See net/ssl/ssl_connection_status_flags.h\n for more information."]
pub type cef_ssl_version_t = ::std::os::raw::c_uint;
pub const cef_ssl_content_status_t_SSL_CONTENT_NORMAL_CONTENT: cef_ssl_content_status_t = 0;
pub const cef_ssl_content_status_t_SSL_CONTENT_DISPLAYED_INSECURE_CONTENT:
    cef_ssl_content_status_t = 1;
pub const cef_ssl_content_status_t_SSL_CONTENT_RAN_INSECURE_CONTENT: cef_ssl_content_status_t = 2;
#[doc = " Supported SSL content status flags. See content/public/common/ssl_status.h\n for more information."]
pub type cef_ssl_content_status_t = ::std::os::raw::c_uint;
pub const cef_scheme_options_t_CEF_SCHEME_OPTION_NONE: cef_scheme_options_t = 0;
#[doc = " For non-standard scheme URLs only the \"scheme:\" component is parsed and\n canonicalized. The remainder of the URL will be passed to the handler as-\n is. For example, \"scheme:///some%20text\" will remain the same.\n Non-standard scheme URLs cannot be used as a target for form submission.\n"]
pub const cef_scheme_options_t_CEF_SCHEME_OPTION_STANDARD: cef_scheme_options_t = 1;
#[doc = "\n If CEF_SCHEME_OPTION_LOCAL is set the scheme will be treated with the same\n security rules as those applied to \"file\" URLs. Normal pages cannot link\n to or access local URLs. Also, by default, local URLs can only perform\n XMLHttpRequest calls to the same URL (origin + path) that originated the\n request. To allow XMLHttpRequest calls from a local URL to other URLs with\n the same origin set the CefSettings.file_access_from_file_urls_allowed\n value to true (1). To allow XMLHttpRequest calls from a local URL to all\n origins set the CefSettings.universal_access_from_file_urls_allowed value\n to true (1).\n"]
pub const cef_scheme_options_t_CEF_SCHEME_OPTION_LOCAL: cef_scheme_options_t = 2;
#[doc = "\n If CEF_SCHEME_OPTION_DISPLAY_ISOLATED is set the scheme can only be\n displayed from other content hosted with the same scheme. For example,\n pages in other origins cannot create iframes or hyperlinks to URLs with\n the scheme. For schemes that must be accessible from other schemes don't\n set this, set CEF_SCHEME_OPTION_CORS_ENABLED, and use CORS\n \"Access-Control-Allow-Origin\" headers to further restrict access.\n"]
pub const cef_scheme_options_t_CEF_SCHEME_OPTION_DISPLAY_ISOLATED: cef_scheme_options_t = 4;
#[doc = "\n If CEF_SCHEME_OPTION_SECURE is set the scheme will be treated with the\n same security rules as those applied to \"https\" URLs. For example, loading\n this scheme from other secure schemes will not trigger mixed content\n warnings.\n"]
pub const cef_scheme_options_t_CEF_SCHEME_OPTION_SECURE: cef_scheme_options_t = 8;
#[doc = "\n If CEF_SCHEME_OPTION_CORS_ENABLED is set the scheme can be sent CORS\n requests. This value should be set in most cases where\n CEF_SCHEME_OPTION_STANDARD is set.\n"]
pub const cef_scheme_options_t_CEF_SCHEME_OPTION_CORS_ENABLED: cef_scheme_options_t = 16;
#[doc = "\n If CEF_SCHEME_OPTION_CSP_BYPASSING is set the scheme can bypass Content-\n Security-Policy (CSP) checks. This value should not be set in most cases\n where CEF_SCHEME_OPTION_STANDARD is set.\n"]
pub const cef_scheme_options_t_CEF_SCHEME_OPTION_CSP_BYPASSING: cef_scheme_options_t = 32;
#[doc = "\n If CEF_SCHEME_OPTION_FETCH_ENABLED is set the scheme can perform Fetch API\n requests.\n"]
pub const cef_scheme_options_t_CEF_SCHEME_OPTION_FETCH_ENABLED: cef_scheme_options_t = 64;
#[doc = " Configuration options for registering a custom scheme.\n These values are used when calling AddCustomScheme."]
pub type cef_scheme_options_t = ::std::os::raw::c_uint;
#[doc = "\n Structure representing a range.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_range_t {
    pub from: u32,
    pub to: u32,
}
#[test]
fn bindgen_test_layout__cef_range_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_range_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_range_t>(),
        8usize,
        concat!("Size of: ", stringify!(_cef_range_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_range_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_range_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).from) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_range_t),
            "::",
            stringify!(from)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_range_t),
            "::",
            stringify!(to)
        )
    );
}
#[doc = "\n Structure representing a range.\n"]
pub type cef_range_t = _cef_range_t;
pub const cef_composition_underline_style_t_CEF_CUS_SOLID: cef_composition_underline_style_t = 0;
pub const cef_composition_underline_style_t_CEF_CUS_DOT: cef_composition_underline_style_t = 1;
pub const cef_composition_underline_style_t_CEF_CUS_DASH: cef_composition_underline_style_t = 2;
pub const cef_composition_underline_style_t_CEF_CUS_NONE: cef_composition_underline_style_t = 3;
#[doc = "\n Composition underline style.\n"]
pub type cef_composition_underline_style_t = ::std::os::raw::c_uint;
#[doc = "\n Structure representing IME composition underline information. This is a thin\n wrapper around Blink's WebCompositionUnderline class and should be kept in\n sync with that.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_composition_underline_t {
    #[doc = "\n Underline character range.\n"]
    pub range: cef_range_t,
    #[doc = "\n Text color.\n"]
    pub color: cef_color_t,
    #[doc = "\n Background color.\n"]
    pub background_color: cef_color_t,
    #[doc = "\n Set to true (1) for thick underline.\n"]
    pub thick: ::std::os::raw::c_int,
    #[doc = "\n Style.\n"]
    pub style: cef_composition_underline_style_t,
}
#[test]
fn bindgen_test_layout__cef_composition_underline_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_composition_underline_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_composition_underline_t>(),
        24usize,
        concat!("Size of: ", stringify!(_cef_composition_underline_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_composition_underline_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_composition_underline_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).range) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_composition_underline_t),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_composition_underline_t),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).background_color) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_composition_underline_t),
            "::",
            stringify!(background_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).thick) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_composition_underline_t),
            "::",
            stringify!(thick)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).style) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_composition_underline_t),
            "::",
            stringify!(style)
        )
    );
}
#[doc = "\n Structure representing IME composition underline information. This is a thin\n wrapper around Blink's WebCompositionUnderline class and should be kept in\n sync with that.\n"]
pub type cef_composition_underline_t = _cef_composition_underline_t;
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_NONE: cef_channel_layout_t = 0;
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_UNSUPPORTED: cef_channel_layout_t = 1;
#[doc = " Front C"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_MONO: cef_channel_layout_t = 2;
#[doc = " Front L, Front R"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_STEREO: cef_channel_layout_t = 3;
#[doc = " Front L, Front R, Back C"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_2_1: cef_channel_layout_t = 4;
#[doc = " Front L, Front R, Front C"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_SURROUND: cef_channel_layout_t = 5;
#[doc = " Front L, Front R, Front C, Back C"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_4_0: cef_channel_layout_t = 6;
#[doc = " Front L, Front R, Side L, Side R"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_2_2: cef_channel_layout_t = 7;
#[doc = " Front L, Front R, Back L, Back R"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_QUAD: cef_channel_layout_t = 8;
#[doc = " Front L, Front R, Front C, Side L, Side R"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_5_0: cef_channel_layout_t = 9;
#[doc = " Front L, Front R, Front C, LFE, Side L, Side R"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_5_1: cef_channel_layout_t = 10;
#[doc = " Front L, Front R, Front C, Back L, Back R"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_5_0_BACK: cef_channel_layout_t = 11;
#[doc = " Front L, Front R, Front C, LFE, Back L, Back R"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_5_1_BACK: cef_channel_layout_t = 12;
#[doc = " Front L, Front R, Front C, Side L, Side R, Back L, Back R"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_7_0: cef_channel_layout_t = 13;
#[doc = " Front L, Front R, Front C, LFE, Side L, Side R, Back L, Back R"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_7_1: cef_channel_layout_t = 14;
#[doc = " Front L, Front R, Front C, LFE, Side L, Side R, Front LofC, Front RofC"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_7_1_WIDE: cef_channel_layout_t = 15;
#[doc = " Stereo L, Stereo R"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_STEREO_DOWNMIX: cef_channel_layout_t = 16;
#[doc = " Stereo L, Stereo R, LFE"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_2POINT1: cef_channel_layout_t = 17;
#[doc = " Stereo L, Stereo R, Front C, LFE"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_3_1: cef_channel_layout_t = 18;
#[doc = " Stereo L, Stereo R, Front C, Rear C, LFE"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_4_1: cef_channel_layout_t = 19;
#[doc = " Stereo L, Stereo R, Front C, Side L, Side R, Back C"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_6_0: cef_channel_layout_t = 20;
#[doc = " Stereo L, Stereo R, Side L, Side R, Front LofC, Front RofC"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_6_0_FRONT: cef_channel_layout_t = 21;
#[doc = " Stereo L, Stereo R, Front C, Rear L, Rear R, Rear C"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_HEXAGONAL: cef_channel_layout_t = 22;
#[doc = " Stereo L, Stereo R, Front C, LFE, Side L, Side R, Rear Center"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_6_1: cef_channel_layout_t = 23;
#[doc = " Stereo L, Stereo R, Front C, LFE, Back L, Back R, Rear Center"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_6_1_BACK: cef_channel_layout_t = 24;
#[doc = " Stereo L, Stereo R, Side L, Side R, Front LofC, Front RofC, LFE"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_6_1_FRONT: cef_channel_layout_t = 25;
#[doc = " Front L, Front R, Front C, Side L, Side R, Front LofC, Front RofC"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_7_0_FRONT: cef_channel_layout_t = 26;
#[doc = " Front L, Front R, Front C, LFE, Back L, Back R, Front LofC, Front RofC"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_7_1_WIDE_BACK: cef_channel_layout_t = 27;
#[doc = " Front L, Front R, Front C, Side L, Side R, Rear L, Back R, Back C."]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_OCTAGONAL: cef_channel_layout_t = 28;
#[doc = " Channels are not explicitly mapped to speakers."]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_DISCRETE: cef_channel_layout_t = 29;
#[doc = " Front L, Front R, Front C. Front C contains the keyboard mic audio. This\n layout is only intended for input for WebRTC. The Front C channel\n is stripped away in the WebRTC audio input pipeline and never seen outside\n of that."]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_STEREO_AND_KEYBOARD_MIC: cef_channel_layout_t =
    30;
#[doc = " Front L, Front R, Side L, Side R, LFE"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_4_1_QUAD_SIDE: cef_channel_layout_t = 31;
#[doc = " Actual channel layout is specified in the bitstream and the actual channel\n count is unknown at Chromium media pipeline level (useful for audio\n pass-through mode)."]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_BITSTREAM: cef_channel_layout_t = 32;
#[doc = " Front L, Front R, Front C, LFE, Side L, Side R,\n Front Height L, Front Height R, Rear Height L, Rear Height R\n Will be represented as six channels (5.1) due to eight channel limit\n kMaxConcurrentChannels"]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_5_1_4_DOWNMIX: cef_channel_layout_t = 33;
#[doc = " Max value, must always equal the largest entry ever logged."]
pub const cef_channel_layout_t_CEF_CHANNEL_LAYOUT_MAX: cef_channel_layout_t = 33;
#[doc = "\n Enumerates the various representations of the ordering of audio channels.\n Must be kept synchronized with media::ChannelLayout from Chromium.\n See media\\base\\channel_layout.h\n"]
pub type cef_channel_layout_t = ::std::os::raw::c_uint;
#[doc = "\n Structure representing the audio parameters for setting up the audio\n handler.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_audio_parameters_t {
    #[doc = "\n Layout of the audio channels\n"]
    pub channel_layout: cef_channel_layout_t,
    #[doc = "\n Sample rate"]
    pub sample_rate: ::std::os::raw::c_int,
    #[doc = "\n Number of frames per buffer\n"]
    pub frames_per_buffer: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__cef_audio_parameters_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_audio_parameters_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_audio_parameters_t>(),
        12usize,
        concat!("Size of: ", stringify!(_cef_audio_parameters_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_audio_parameters_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_audio_parameters_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel_layout) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_audio_parameters_t),
            "::",
            stringify!(channel_layout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sample_rate) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_audio_parameters_t),
            "::",
            stringify!(sample_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frames_per_buffer) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_audio_parameters_t),
            "::",
            stringify!(frames_per_buffer)
        )
    );
}
#[doc = "\n Structure representing the audio parameters for setting up the audio\n handler.\n"]
pub type cef_audio_parameters_t = _cef_audio_parameters_t;
pub const cef_media_route_create_result_t_CEF_MRCR_UNKNOWN_ERROR: cef_media_route_create_result_t =
    0;
pub const cef_media_route_create_result_t_CEF_MRCR_OK: cef_media_route_create_result_t = 1;
pub const cef_media_route_create_result_t_CEF_MRCR_TIMED_OUT: cef_media_route_create_result_t = 2;
pub const cef_media_route_create_result_t_CEF_MRCR_ROUTE_NOT_FOUND:
    cef_media_route_create_result_t = 3;
pub const cef_media_route_create_result_t_CEF_MRCR_SINK_NOT_FOUND: cef_media_route_create_result_t =
    4;
pub const cef_media_route_create_result_t_CEF_MRCR_INVALID_ORIGIN: cef_media_route_create_result_t =
    5;
pub const cef_media_route_create_result_t_CEF_MRCR_NO_SUPPORTED_PROVIDER:
    cef_media_route_create_result_t = 7;
pub const cef_media_route_create_result_t_CEF_MRCR_CANCELLED: cef_media_route_create_result_t = 8;
pub const cef_media_route_create_result_t_CEF_MRCR_ROUTE_ALREADY_EXISTS:
    cef_media_route_create_result_t = 9;
pub const cef_media_route_create_result_t_CEF_MRCR_ROUTE_ALREADY_TERMINATED:
    cef_media_route_create_result_t = 11;
#[doc = "\n Result codes for CefMediaRouter::CreateRoute. Should be kept in sync with\n Chromium's media_router::mojom::RouteRequestResultCode type.\n"]
pub type cef_media_route_create_result_t = ::std::os::raw::c_uint;
pub const cef_media_route_connection_state_t_CEF_MRCS_UNKNOWN: cef_media_route_connection_state_t =
    0;
pub const cef_media_route_connection_state_t_CEF_MRCS_CONNECTING:
    cef_media_route_connection_state_t = 1;
pub const cef_media_route_connection_state_t_CEF_MRCS_CONNECTED:
    cef_media_route_connection_state_t = 2;
pub const cef_media_route_connection_state_t_CEF_MRCS_CLOSED: cef_media_route_connection_state_t =
    3;
pub const cef_media_route_connection_state_t_CEF_MRCS_TERMINATED:
    cef_media_route_connection_state_t = 4;
#[doc = "\n Connection state for a MediaRoute object.\n"]
pub type cef_media_route_connection_state_t = ::std::os::raw::c_uint;
pub const cef_media_sink_icon_type_t_CEF_MSIT_CAST: cef_media_sink_icon_type_t = 0;
pub const cef_media_sink_icon_type_t_CEF_MSIT_CAST_AUDIO_GROUP: cef_media_sink_icon_type_t = 1;
pub const cef_media_sink_icon_type_t_CEF_MSIT_CAST_AUDIO: cef_media_sink_icon_type_t = 2;
pub const cef_media_sink_icon_type_t_CEF_MSIT_MEETING: cef_media_sink_icon_type_t = 3;
pub const cef_media_sink_icon_type_t_CEF_MSIT_HANGOUT: cef_media_sink_icon_type_t = 4;
pub const cef_media_sink_icon_type_t_CEF_MSIT_EDUCATION: cef_media_sink_icon_type_t = 5;
pub const cef_media_sink_icon_type_t_CEF_MSIT_WIRED_DISPLAY: cef_media_sink_icon_type_t = 6;
pub const cef_media_sink_icon_type_t_CEF_MSIT_GENERIC: cef_media_sink_icon_type_t = 7;
pub const cef_media_sink_icon_type_t_CEF_MSIT_TOTAL_COUNT: cef_media_sink_icon_type_t = 8;
#[doc = "\n Icon types for a MediaSink object. Should be kept in sync with Chromium's\n media_router::SinkIconType type.\n"]
pub type cef_media_sink_icon_type_t = ::std::os::raw::c_uint;
#[doc = "\n Device information for a MediaSink object.\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_media_sink_device_info_t {
    pub ip_address: cef_string_t,
    pub port: ::std::os::raw::c_int,
    pub model_name: cef_string_t,
}
#[test]
fn bindgen_test_layout__cef_media_sink_device_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_media_sink_device_info_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_media_sink_device_info_t>(),
        56usize,
        concat!("Size of: ", stringify!(_cef_media_sink_device_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_media_sink_device_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_cef_media_sink_device_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip_address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_media_sink_device_info_t),
            "::",
            stringify!(ip_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_media_sink_device_info_t),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).model_name) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_media_sink_device_info_t),
            "::",
            stringify!(model_name)
        )
    );
}
#[doc = "\n Device information for a MediaSink object.\n"]
pub type cef_media_sink_device_info_t = _cef_media_sink_device_info_t;
pub const cef_text_field_commands_t_CEF_TFC_CUT: cef_text_field_commands_t = 1;
pub const cef_text_field_commands_t_CEF_TFC_COPY: cef_text_field_commands_t = 2;
pub const cef_text_field_commands_t_CEF_TFC_PASTE: cef_text_field_commands_t = 3;
pub const cef_text_field_commands_t_CEF_TFC_UNDO: cef_text_field_commands_t = 4;
pub const cef_text_field_commands_t_CEF_TFC_DELETE: cef_text_field_commands_t = 5;
pub const cef_text_field_commands_t_CEF_TFC_SELECT_ALL: cef_text_field_commands_t = 6;
#[doc = "\n Represents commands available to TextField.\n"]
pub type cef_text_field_commands_t = ::std::os::raw::c_uint;
pub const cef_chrome_toolbar_type_t_CEF_CTT_NONE: cef_chrome_toolbar_type_t = 1;
pub const cef_chrome_toolbar_type_t_CEF_CTT_NORMAL: cef_chrome_toolbar_type_t = 2;
pub const cef_chrome_toolbar_type_t_CEF_CTT_LOCATION: cef_chrome_toolbar_type_t = 3;
#[doc = "\n Chrome toolbar types.\n"]
pub type cef_chrome_toolbar_type_t = ::std::os::raw::c_uint;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_BOOKMARK_STAR:
    cef_chrome_page_action_icon_type_t = 0;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_CLICK_TO_CALL:
    cef_chrome_page_action_icon_type_t = 1;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_COOKIE_CONTROLS:
    cef_chrome_page_action_icon_type_t = 2;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_FILE_SYSTEM_ACCESS:
    cef_chrome_page_action_icon_type_t = 3;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_FIND: cef_chrome_page_action_icon_type_t = 4;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_HIGH_EFFICIENCY:
    cef_chrome_page_action_icon_type_t = 5;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_INTENT_PICKER:
    cef_chrome_page_action_icon_type_t = 6;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_LOCAL_CARD_MIGRATION:
    cef_chrome_page_action_icon_type_t = 7;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_MANAGE_PASSWORDS:
    cef_chrome_page_action_icon_type_t = 8;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_PAYMENTS_OFFER_NOTIFICATION:
    cef_chrome_page_action_icon_type_t = 9;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_PRICE_TRACKING:
    cef_chrome_page_action_icon_type_t = 10;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_PWA_INSTALL:
    cef_chrome_page_action_icon_type_t = 11;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_QR_CODE_GENERATOR:
    cef_chrome_page_action_icon_type_t = 12;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_READER_MODE:
    cef_chrome_page_action_icon_type_t = 13;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_SAVE_AUTOFILL_ADDRESS:
    cef_chrome_page_action_icon_type_t = 14;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_SAVE_CARD:
    cef_chrome_page_action_icon_type_t = 15;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_SEND_TAB_TO_SELF:
    cef_chrome_page_action_icon_type_t = 16;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_SHARING_HUB:
    cef_chrome_page_action_icon_type_t = 17;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_SIDE_SEARCH:
    cef_chrome_page_action_icon_type_t = 18;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_SMS_REMOTE_FETCHER:
    cef_chrome_page_action_icon_type_t = 19;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_TRANSLATE:
    cef_chrome_page_action_icon_type_t = 20;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_VIRTUAL_CARD_ENROLL:
    cef_chrome_page_action_icon_type_t = 21;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_VIRTUAL_CARD_MANUAL_FALLBACK:
    cef_chrome_page_action_icon_type_t = 22;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_ZOOM: cef_chrome_page_action_icon_type_t =
    23;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_SAVE_IBAN:
    cef_chrome_page_action_icon_type_t = 24;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_MANDATORY_REAUTH:
    cef_chrome_page_action_icon_type_t = 25;
pub const cef_chrome_page_action_icon_type_t_CEF_CPAIT_MAX_VALUE:
    cef_chrome_page_action_icon_type_t = 25;
#[doc = "\n Chrome page action icon types. Should be kept in sync with Chromium's\n PageActionIconType type.\n"]
pub type cef_chrome_page_action_icon_type_t = ::std::os::raw::c_uint;
pub const cef_chrome_toolbar_button_type_t_CEF_CTBT_CAST: cef_chrome_toolbar_button_type_t = 0;
pub const cef_chrome_toolbar_button_type_t_CEF_CTBT_DOWNLOAD: cef_chrome_toolbar_button_type_t = 1;
pub const cef_chrome_toolbar_button_type_t_CEF_CTBT_SEND_TAB_TO_SELF:
    cef_chrome_toolbar_button_type_t = 2;
pub const cef_chrome_toolbar_button_type_t_CEF_CTBT_SIDE_PANEL: cef_chrome_toolbar_button_type_t =
    3;
pub const cef_chrome_toolbar_button_type_t_CEF_CTBT_MAX_VALUE: cef_chrome_toolbar_button_type_t = 3;
#[doc = "\n Chrome toolbar button types. Should be kept in sync with CEF's internal\n ToolbarButtonType type.\n"]
pub type cef_chrome_toolbar_button_type_t = ::std::os::raw::c_uint;
pub const cef_docking_mode_t_CEF_DOCKING_MODE_TOP_LEFT: cef_docking_mode_t = 1;
pub const cef_docking_mode_t_CEF_DOCKING_MODE_TOP_RIGHT: cef_docking_mode_t = 2;
pub const cef_docking_mode_t_CEF_DOCKING_MODE_BOTTOM_LEFT: cef_docking_mode_t = 3;
pub const cef_docking_mode_t_CEF_DOCKING_MODE_BOTTOM_RIGHT: cef_docking_mode_t = 4;
pub const cef_docking_mode_t_CEF_DOCKING_MODE_CUSTOM: cef_docking_mode_t = 5;
#[doc = "\n Docking modes supported by CefWindow::AddOverlay.\n"]
pub type cef_docking_mode_t = ::std::os::raw::c_uint;
pub const cef_show_state_t_CEF_SHOW_STATE_NORMAL: cef_show_state_t = 1;
pub const cef_show_state_t_CEF_SHOW_STATE_MINIMIZED: cef_show_state_t = 2;
pub const cef_show_state_t_CEF_SHOW_STATE_MAXIMIZED: cef_show_state_t = 3;
pub const cef_show_state_t_CEF_SHOW_STATE_FULLSCREEN: cef_show_state_t = 4;
#[doc = "\n Show states supported by CefWindowDelegate::GetInitialShowState.\n"]
pub type cef_show_state_t = ::std::os::raw::c_uint;
pub const cef_touch_handle_state_flags_t_CEF_THS_FLAG_NONE: cef_touch_handle_state_flags_t = 0;
pub const cef_touch_handle_state_flags_t_CEF_THS_FLAG_ENABLED: cef_touch_handle_state_flags_t = 1;
pub const cef_touch_handle_state_flags_t_CEF_THS_FLAG_ORIENTATION: cef_touch_handle_state_flags_t =
    2;
pub const cef_touch_handle_state_flags_t_CEF_THS_FLAG_ORIGIN: cef_touch_handle_state_flags_t = 4;
pub const cef_touch_handle_state_flags_t_CEF_THS_FLAG_ALPHA: cef_touch_handle_state_flags_t = 8;
#[doc = "\n Values indicating what state of the touch handle is set.\n"]
pub type cef_touch_handle_state_flags_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cef_touch_handle_state_t {
    #[doc = "\n Touch handle id. Increments for each new touch handle.\n"]
    pub touch_handle_id: ::std::os::raw::c_int,
    #[doc = "\n Combination of cef_touch_handle_state_flags_t values indicating what state\n is set.\n"]
    pub flags: u32,
    #[doc = "\n Enabled state. Only set if |flags| contains CEF_THS_FLAG_ENABLED.\n"]
    pub enabled: ::std::os::raw::c_int,
    #[doc = "\n Orientation state. Only set if |flags| contains CEF_THS_FLAG_ORIENTATION.\n"]
    pub orientation: cef_horizontal_alignment_t,
    pub mirror_vertical: ::std::os::raw::c_int,
    pub mirror_horizontal: ::std::os::raw::c_int,
    #[doc = "\n Origin state. Only set if |flags| contains CEF_THS_FLAG_ORIGIN.\n"]
    pub origin: cef_point_t,
    #[doc = "\n Alpha state. Only set if |flags| contains CEF_THS_FLAG_ALPHA.\n"]
    pub alpha: f32,
}
#[test]
fn bindgen_test_layout__cef_touch_handle_state_t() {
    const UNINIT: ::std::mem::MaybeUninit<_cef_touch_handle_state_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_cef_touch_handle_state_t>(),
        36usize,
        concat!("Size of: ", stringify!(_cef_touch_handle_state_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_cef_touch_handle_state_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_cef_touch_handle_state_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).touch_handle_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_handle_state_t),
            "::",
            stringify!(touch_handle_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_handle_state_t),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enabled) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_handle_state_t),
            "::",
            stringify!(enabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).orientation) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_handle_state_t),
            "::",
            stringify!(orientation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mirror_vertical) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_handle_state_t),
            "::",
            stringify!(mirror_vertical)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mirror_horizontal) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_handle_state_t),
            "::",
            stringify!(mirror_horizontal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).origin) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_handle_state_t),
            "::",
            stringify!(origin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_cef_touch_handle_state_t),
            "::",
            stringify!(alpha)
        )
    );
}
pub type cef_touch_handle_state_t = _cef_touch_handle_state_t;
#[doc = "\n No permission.\n"]
pub const cef_media_access_permission_types_t_CEF_MEDIA_PERMISSION_NONE:
    cef_media_access_permission_types_t = 0;
#[doc = "\n Device audio capture permission.\n"]
pub const cef_media_access_permission_types_t_CEF_MEDIA_PERMISSION_DEVICE_AUDIO_CAPTURE:
    cef_media_access_permission_types_t = 1;
#[doc = "\n Device video capture permission.\n"]
pub const cef_media_access_permission_types_t_CEF_MEDIA_PERMISSION_DEVICE_VIDEO_CAPTURE:
    cef_media_access_permission_types_t = 2;
